[
  {
    "name": "INTERACTIVE READING",
    "popupName": "Interactive Reading",
    "alias": "iwt",
    "description": "Each student is assigned one Interactive Reading in each Lesson Set, based on leveling data gathered by the system. There are three parts to each Interactive Reading. Reading Checkpoints and Summaries are automatically scored. Critical Responses are scored by the teacher using a rubric."
  },
  {
    "name": "STUDY PLAN",
    "popupName": "Study Plan",
    "alias": "studyplan",
    "description": "Each student receives a personalized plan based on the results of a Pretest in the first three Lesson Sets of each unit. After additional instruction and practice, students take a posttest, which measures mastery of the skills. A student who scores 100% on the Pretest is finished and earns 100% for that study plan."
  },
  {
    "name": "VOCABULARY, WORD STUDY, AND READING COMPREHENSION",
    "popupName": "Vocabulary, Word Study, and Reading Comprehension",
    "alias": {
      "0": "phonictextbasedslide",
      "1": "pluralnouns",
      "2": "digraphs",
      "3": "word_families",
      "4": "syllables",
      "5": "word_sort",
      "6": "rotatinglists",
      "7": "extendedphonic",
      "8": "word_slam"
    },
    "description": "Students will complete assignments for vocabulary words on which they received direct instruction, including Word Slam and Word Match. They will also complete practice assignments of words in isolation in Word Study Practice and words in context in Word Study Readers."
  },
  {
    "name": "iPRACTICE",
    "popupName": "iPractice",
    "alias": "dailyassignment",
    "description": "These assignments provide practice for the skill or strategy taught in Whole Group instruction. Daily assignments are mostly scored by the teacher using a rubric."
  },
  {
    "name": "WRITING",
    "popupName": "Writing",
    "alias": {
      "0": "essay",
      "1": "paragraph"
    },
    "description": "Students are assigned one short writing assignment in each of the first three Lesson Sets of each unit. Writing is automatically scored. Students can check their score and get feedback on their writing. They can revise as many times as they choose before they submit their writing as final."
  },
  {
    "name": "MONITOR PROGRESS",
    "popupName": "Monitor Progress",
    "alias": "monitor",
    "description": "Assessments that monitor students' reading comprehension progress, including Weekly Reading Checks, Unit Benchmark Assessments, and GRADE assessments."
  },
  {
    "name": "INFORMATION",
    "popupName": "Information",
    "alias": "nsa",
    "description": "Send weekly learning objectives to students so the focus of instruction and practice is clear each week and how instruction and practice aligns to state standards."
  }
]
