{
  "id": "body-switch",
  "title": "Body Switch",
  "author": "Saddleback Educational Publishing",
  "coverImage": "/images/covers/body-switch.svg",
  "lexileLevel": 100,
  "genre": "Fiction,Thrillers,Mysteries,Action and Adventure",
  "summary": "A wish comes true in a mysterious restaurant. Two boys switch places. Brian Stark is a normal middle school kid. He is bored with his family. School is a drag. Watching his little sister is a total pain. Jamie Hawk is an international pop star sensation with a ton of money, but he has no normal life. His dad bosses him around. He has no privacy. He never sees his mom. Zap! With a crack of lightning and a selfie, it all changes.",
  "totalPages": 26,
  "chapters": [
    {
      "title": "Copyright Page",
      "pages": [
        {
          "pageNumber": 1,
          "text": "Body Switch\n\nKiller Flood\n\nClan Castles\n\nThe Lost House\n\nThe Code\n\nRacer\n\nFlyer\n\nSky Watchers\n\nFight School\n\nStanding by Emma\n\nThe Garden Troll\n\nStarstruck\n\nGhost Mountain\n\nStolen Treasure\n\nThe Gift\n\nThe Soldier\n\nThe Hero of Crow’s Crossing\n\nZombies!\n\nI Am Underdog\n\nZuze and the Star\n\nWith more titles on the way …\n\nCopyright ©2015 by Saddleback Educational Publishing\n\nAll rights reserved. No part of this book may be reproduced in any form or by any means, electronic or mechanical, including photocopying, recording, scanning, or by any information storage and retrieval system, without the written permission of the publisher. SADDLEBACK EDUCATIONAL PUBLISHING and any associated logos are trademarks and/or registered trademarks of Saddleback Educational Publishing.\n\nISBN-13: 978-1-62250-944-7\n\nISBN-10: 1-62250-944-7\n\neBook: 978-1-63078-173-6\n\nPrinted in Guangzhou, China\n\n0000/CA00000000\n\n19 18 17 16 15 1 2 3 4 5"
        }
      ]
    },
    {
      "title": "MEET THE CHARACTERS",
      "pages": [
        {
          "pageNumber": 2,
          "text": "Age: 13\n\nWorst Part of Being Famous: can’t go skateboarding when he feels like it\n\nSecret Fear: that he is growing up too fast\n\nFuture Goal: to play Eminem in the movie version of his life\n\nBest Quality: talented\n\nAge: 13\n\nHobby: photographing animal shapes in clouds\n\nFavorite Food: school cafeteria meatloaf\n\nCollege Goal: to major in physics at Cal Tech\n\nBest Quality: smart"
        }
      ]
    },
    {
      "title": "1 JAMIE",
      "pages": [
        {
          "pageNumber": 3,
          "text": "1\nJAMIE\n\n“Get up, Jamie,” his dad said. “You have an interview soon. Web Celeb news.”\n\nJamie opened his eyes. His dad was staring at his tablet. Jamie hated that thing. It always meant work.\n\n“Why so early?” Jamie asked. “I was out late.”\n\n“Sorry. Can’t be helped.” His dad sighed. Patted Jamie’s arm. “Three more cities. Six more concerts. Then you can take a break.”\n\nJamie groaned. There was never a break. Not really. Not since he was five. When his dad posted that video. Jamie was singing. Wearing his jammies. Using a wooden spoon as his mic. It went viral. It happened in a flash. Normal kid to rock star.\n\nIt was fun. At first. Now? Not so much.\n\nBut Jamie had his fans to think of. He didn’t want to let them down. He rolled out of bed. Dressed.\n\nHis dad’s phone rang. He answered it with, “What? Are you kidding? I’ll be right down.” He clicked off. “Problem with the hotel bill,” he said to Jamie. “I have to take care of it. Stay here.”\n\n“Fine.”\n\nHis dad rushed out.\n\nJamie stared out the window. It was a nice day. Sunny. Bright blue sky. All he’d seen were hotels. Concert halls. For five long months. He was sick of it.\n\nHe could not stay in this room. Not for one more second.\n\nHe didn’t think about it. He bolted. Jumped in the elevator. Snuck through the hotel lobby. Slinked by his dad at the main desk."
        },
        {
          "pageNumber": 4,
          "text": "He stepped onto the sidewalk. What a relief. It felt good to stretch his legs. Get some air. He’d be back before his dad could get too mad.\n\nA guy with a camera saw him. “Hey! Jamie!” he yelled. “How’s it going?” His camera clicked away. Shooting hundreds of photos.\n\nGreat. Those guys were always waiting. They were like vultures. Jamie walked faster. Looked over his shoulder. Now there were two of them.\n\n“Jamie!” one of them called. “Where you headed?”\n\nArgh!\n\nJamie ran a few blocks. Spotted a narrow alley. Slipped into it.\n\nHe leaned against a wall. Stayed still. The guys rushed by. Didn’t see him.\n\nPhew.\n\nJamie glanced down the small street. It was a dead end. Most city alleys were dirty. Filled with trash. But this one was paved with bricks. Lined with potted plants. Twinkling lights swung overhead. A fountain trickled water. It was tidy. And calm.\n\nIt was like the city had vanished. He let out a breath. Relaxed his shoulders.\n\nThere was a blue door at the end of the alley. A sign with gold letters read Zeus’s Greek Food. A huge statue guarded the door. Zeus? Probably.\n\nHe hadn’t eaten breakfast. He was really hungry.\n\nGreek? Whatever. Sounded as good as anything."
        }
      ]
    },
    {
      "title": "2 BRIAN",
      "pages": [
        {
          "pageNumber": 5,
          "text": "2\nBRAIN\n\nBrian Stark and his family were lost. They’d visited the art museum. Walked back to the street. Then somehow ended up here. In front of this alley.\n\n“Huh.” Mr. Stark rubbed the back of his neck. Looked at the map again. “The war memorial should be here. Right where we’re standing.”\n\n“Except it’s not,” Mrs. Stark said.\n\n“Da-ad,” Missy whined. She was Brian’s little sister. “I’m hungry. My feet hurt.”\n\nBrian was hungry too. And tired. He glanced down the alley. “Hey. There’s food.”\n\nThey all looked. The alley was a dead end. And there it was.\n\n“Greek?” his dad said.\n\n“Let’s try it,” his mom said. “We need food. And a break.”\n\nThey walked in. There were some tables. White tablecloths. Gold lamps. They were the only customers.\n\nA beaded curtain swished. A man in a white jacket came out. Smiled. Stood straight. His blue eyes met Brian’s. Brian shivered. It was like the guy looked right through him.\n\n“Sit wherever you wish,” he said.\n\nThey took a table against a wall. Studied their menus. Brian knew what he wanted. He tapped the table. Waited for his family.\n\nHe wasn’t looking forward to going home. He had school the next day. A history test to study for. His life was so boring. Watching Missy. Chores. Brian wished his family would take a real vacation. Not just drive into the city. He wanted to do cool things. See new places."
        },
        {
          "pageNumber": 6,
          "text": "The man returned. Was he the waiter? Yes. He took their orders. The bell over the door chimed.\n\nBrian glanced over.\n\nHe looked again.\n\nWait. Was that?\n\nNah. Couldn’t be.\n\nTheir waiter smiled at the boy. “Sit wherever you wish.”\n\n“Thanks.” The kid took a table against the other wall. Read his menu.\n\n“Brian,” his mom said. “Don’t stare. It’s rude.”\n\n“I think that’s Jamie Hawk,” he said.\n\n“No way!” Now Missy stared.\n\nIt must be him, Brian thought. His friend Skye had mentioned it. Jamie was doing concerts here. At the arena. Skye had wanted to get tickets.\n\n“Who’s Jamie Hawk?” his dad asked.\n\n“Just the biggest pop star ever,” Missy said.\n\n“Oh.” Mr. Stark glanced across the room. “Looks about your age, Brian. Maybe thirteen. He’s eating alone? Where are his parents?”\n\n“How sad,” Mrs. Stark said.\n\n“It’s not sad,” Brian said. “It’s awesome! He’s famous. He gets to travel all over the world. Do his own thing.”\n\nBrian pulled out his phone. Snuck a photo of Jamie. He’d text it to Skye. She’d freak.\n\nThe waiter brought their food. Brian ate. But all he could think about was Jamie Hawk.\n\nHe was eating lunch with Jamie Hawk!"
        }
      ]
    },
    {
      "title": "3 THE ORACLE",
      "pages": [
        {
          "pageNumber": 7,
          "text": "3\nTHE ORACLE\n\nJamie peeked over his menu. That family was staring at him. Mostly the kid. The one who just snapped his picture.\n\nHe ordered his meal. The waiter gave him a strange crooked smile. What was that about? Jamie brushed it off. He was just glad to be out of that hotel room. On his own. Without his bossy dad. Without creeps taking his picture. He sat back in his chair.\n\nFree time. It felt strange. Maybe he’d send a tweet to his fans. He patted his pockets. Oops. He’d left his phone at the hotel. At least he had his wallet. He could pay for lunch.\n\nHe tapped his leg. Why had he thought of tweeting his fans? Instead of calling or texting someone? Because who would he call or text? He didn’t have any friends. Not real friends. Just his dad. Members of his band. He glanced at the kid with his family. Jamie bet that kid had tons of friends.\n\nThe waiter delivered the family’s food. Jamie guessed he and the boy were about the same age. What was his life like? For sure he went to school. Jamie had never been to school. Only tutors.\n\nMaybe the kid played a sport. Was he popular? Did he have a girlfriend? Jamie bet they ate dinner together every night. His mom baked him cookies. Greeted him with a hug after school. He and his dad played catch. Tossed a football in the yard."
        },
        {
          "pageNumber": 8,
          "text": "The kid smiled at Jamie. Jamie smiled back. Shrugged. The waiter set Jamie’s meal in front of him. He dug in. The food was good. Really good. He quickly cleaned his plate.\n\nThe waiter came out. “Tell the oracle,” he said.\n\n“Huh?”\n\n“Your fortune. Your deepest wish. Tell the oracle,” the waiter said.\n\n“Um, no thanks.”\n\nWhat is he talking about? He laughed to himself. My deepest wish? he thought. To be normal. Like that kid over there. I want to be that kid. I want his life.\n\nBrian knew it was rude. But he kept staring at Jamie Hawk. Their eyes met. Jamie smiled. And shrugged!\n\nHoly crud.\n\nWhat’s his life like? Brian wondered. Jamie was only thirteen. But he was already worth millions. He could live anywhere. Have anything he wanted. He sang in front of adoring fans. All over the world. Made awesome albums. He was a somebody. Not a nobody. Like Brian. Jamie Hawk didn’t have to go to school. Or do chores. Or watch a kid sister.\n\nThe waiter arrived. Pointed at Brian. “Tell the oracle.”\n\n“What?” Brian asked.\n\n“Your fortune. Your deepest wish. Tell the oracle,” the waiter said.\n\n“Thanks. Not today,” Brian’s dad said. “We’ve got to get home.”\n\nThe waiter disappeared behind the beads.\n\nMy deepest wish? Brian thought. To be Jamie Hawk. I want his life.\n\nBrian knew it was silly. Stupid even. But he wished it again. I wish I was Jamie Hawk."
        },
        {
          "pageNumber": 9,
          "text": "All at once his arms tingled. His head spun. His stomach churned.\n\nHe jumped up. He was going to be sick."
        }
      ]
    },
    {
      "title": "4 BIG SWITCH",
      "pages": [
        {
          "pageNumber": 10,
          "text": "4\nBIG SWITCH\n\n“Brian?” his mom said. “What’s wrong?”\n\nThe sick feeling quickly passed. Brian shook his head. “Nothing. Just dizzy for a second.”\n\nA chair scraped. Across the room Jamie Hawk jumped up. Held his stomach. Then he dropped his hand. Shook his head.\n\nWeird, Brian thought.\n\n“We better go.” Brian’s dad rose from the table. “Where’s that waiter? I’d like to pay our bill.”\n\n“I’ll see if I can find him,” Jamie offered.\n\nBrian’s heart thumped. Jamie Hawk just talked to my dad!\n\nJamie stepped through the beaded curtain. Came back a few seconds later. “No one’s there. Not even a cook.” He left some cash on his table. “This should cover it.”\n\n“Right.” Brian’s dad pulled out a few bills. Slid them under a plate. “Okay. Let’s go, gang.”\n\nThey all reached the door at the same time. Brian waited for his family to leave. He didn’t want to miss this chance.\n\n“Hey, Jamie,” Brian said. He and Jamie were alone. “I just want to tell you. I really like your music.”\n\n“Cool. Thanks.”\n\n“Um. Can I take a selfie with you?”\n\nJamie sighed. “Sure.”\n\nBrian held out his phone. He stood next to Jamie. Moved closer. Their shoulders touched.\n\nBrian took a quick photo. Then he looked at it. It was black. What? He was sure the flash worked.\n\n“Um. Sorry. Can we do this outside? I don’t know what’s wrong.”\n\nJamie shrugged. “Sure.”"
        },
        {
          "pageNumber": 11,
          "text": "They walked out of Zeus’s. Both boys tripped over the small step. Both grabbed the statue. Steadied themselves.\n\n“This should do it,” said Brian.\n\nTheir shoulders touched. Brian took the photo again.\n\nZap! It was like a lightning bolt hitting them. Brian’s head spun. The sick feeling came back. Only a hundred times stronger. He closed his eyes. Their shoulders seemed fused together.\n\nThen, all at once, they flew apart.\n\nBrian stumbled. Opened his eyes. But he wasn’t looking at Jamie. He was looking at … himself. How was that possible? What was happening? “You’re me.” Brian touched his throat. It didn’t sound like his voice.\n\n“And you’re … me,” said Jamie.\n\n“The oracle,” Brian said. He pointed at the statue. “I wished to be you.”\n\n“So did I. I mean. I wished to be you.”\n\n“You did? Why would you do that? I’m boring.”\n\n“Exactly,” Jamie said. “I want to be normal.”\n\n“And I want to be famous.”\n\nHalfway down the alley, Mr. Stark said, “Come on, Brian. What’s keeping you?”\n\n“Nothing, Dad,” Jamie said. He looked at Brian. “Are you cool with this?”\n\n“Yeah. I think I am.”\n\nJamie glanced at the phone still in his hand. Well, him in Brian’s body. “Call me sometime. Okay?”\n\n“Sure. Yeah.” Brian smiled. “Awesome.”\n\n“Cool.”\n\n“Brian?” his dad said. “I’m sure this young man has things to do.”"
        },
        {
          "pageNumber": 12,
          "text": "“Yeah, he does.” Jamie winked. Gave Brian a thumbs-up. “Enjoy your stay at the Regent Park. Suite fifteen hundred. I hear it’s a nice place.”\n\n“Right. Thanks.”\n\nBrian watched himself walk down the alley. Then he gazed at hands that weren’t his. At clothes his parents couldn’t afford.\n\nHe didn’t believe in magic. But he had to believe this. Because it was right here. In front of his eyes. He was a rock star.\n\nHe was Jamie Hawk."
        }
      ]
    },
    {
      "title": "5 DAY ONE",
      "pages": [
        {
          "pageNumber": 13,
          "text": "5\nDAY ONE\n\nBrian stepped out of the alley. Jamie had said the Regent Park. That must be a hotel. But where was it? A woman walked toward him. “Um. Excuse me,” he said. “I’m looking for the Regent Park?”\n\nHer eyes widened. She covered her mouth with her hand. “Jamie Hawk!”\n\nHe smiled. “Yes. Right. That’s me.\n\nShe whipped out her phone. “Can I take your picture?”\n\n“Oh. Sure!”\n\nThey cozied up together. Brian grinned.\n\nBy now more people had stopped. A crowd formed. A crowd! All because of him. They asked for his autograph. They took his picture. It was awesome. Like he had a million friends. But he thought he should get to the hotel.\n\n“The Regent Park?” he asked the crowd. “Can anyone tell me where it is?”\n\n“Sure. I’ll take ya.” It was a cab driver. He’d parked at the curb. Taken Brian’s photo. Really Jamie’s photo.\n\n“Great. Thanks.” Brian got in.\n\nFive blocks later the cab stopped. “Here it is,” the driver said.\n\nBrian checked his wallet. It was full of twenties. Fifties. Hundreds. More money than he’d ever seen. He pulled out a twenty.\n\n“That’s okay.” The cabbie held up his hand. “On the house. But can I have your autograph? For my daughter. She’s a big fan.”\n\nBrian signed the back of a notepad. “Thanks a lot for the ride.”"
        },
        {
          "pageNumber": 14,
          "text": "He climbed out of the cab. All at once a bunch of guys mobbed him. They all had big cameras. They took his picture. Over and over. They also shouted questions.\n\n“Did you and your dad have a fight?”\n\n“Are you firing him as your manager?”\n\n“Are you dating Zoe Lane?”\n\n“The party boy rumors. Any comment?”\n\nBrian didn’t know what they were talking about. So he said, “Um … no?” He made his way into the hotel. The doorman kept the mob outside.\n\nNow what? Brian had been to a hotel. Exactly once. When they’d visited Grandma Bev. The first numbers were the same as the floor. Jamie had said fifteen hundred. He got in the elevator. The top floor was fifteen. He pressed the button.\n\nDing! The doors opened. He got off. Looked up and down the hallway. Strange. There were only a few doors.\n\nHe knocked on the door with 1500 on it.\n\nA man swung it open. “There you are!” He was tall. Thin. Brown eyes. Dimpled chin. An older version of Jamie. Except for the bright red cheeks. “Where have you been?” he yelled. “You missed the interview. You cannot sneak out like that, Jamie!” He slammed the door behind them.\n\n“Sorry.”\n\n“You should be! I was worried. Anything can happen on the streets. Where did you go?”\n\n“Greek food.”\n\n“I hope it was worth it.”\n\n“It was. It was great!”"
        },
        {
          "pageNumber": 15,
          "text": "Mr. Hawk eyed Brian. He grabbed a tablet. Slid his finger over the screen. “George will be here soon.”\n\n“George?”\n\n“Yes. George. I have an errand to run. Can I trust you to stay here?”\n\n“Sure. No problem. Dad.”\n\nMr. Hawk gave Brian another look. “Are you all right?”\n\n“I’m perfect.” Brian glanced around the huge suite. “Never been better.”"
        }
      ]
    },
    {
      "title": "6 SUITE 1500",
      "pages": [
        {
          "pageNumber": 16,
          "text": "6\nSUITE 1500\n\nMr. Hawk left. That gave Brian a chance to explore. This was not the Motel Ten near Grandma Bev’s. There were two large bedrooms. A living room. A kitchen. A bar. A piano. A hot tub. It looked like it could hold ten people. And a massive flat-screen TV. With video games! The place was bigger than his whole house.\n\n“Awesome!” Brian’s fingers itched to grab the game remote. But first things first. He found a cell phone next to a king-size bed. Hoped the phone was Jamie’s. Entered his own number.\n\n“Brian?” Jamie answered.\n\n“Yeah. How’s it going?”\n\n“Cool. I love your family.”\n\n“You do?” Brian scratched his head. “I need to know who George is.”\n\n“He’s a songwriter. He’s been working with me. On my next album.” There was a long pause.\n\n“Something wrong?” Brian asked.\n\n“No. It’s just that I had some song ideas. I wish we shared each other’s brains. Then you’d know what I’m thinking.”\n\n“What should I do? I don’t know a thing about music.”\n\n“I don’t know what to tell you. I’d better go. You have a concert tomorrow night. Have fun!”\n\n“Concert. Jamie, I just realized. I don’t know all the words to your songs!”\n\n“Then you’d better learn them. Don’t want to disappoint those fans. All fifteen thousand of them.”\n\n“No way! Yikes.”\n\n“Hey. Is Skye your girlfriend?” Jamie asked.\n\n“No. She’s just a friend. Why?”\n\n“I was looking at her picture. On your phone. She’s hot.”"
        },
        {
          "pageNumber": 17,
          "text": "“Hot! No she’s not. She’s like my sister.”\n\n“Well, she’s not like my sister. Time to make a move.”\n\nBrian heard voices in the background.\n\n“Hey, really gotta go,” Jamie said. “We’re at a rest stop. Your fam is coming back. Loaded with snacks. Cool.”\n\n“Hey, Jamie! I just remembered. I … I mean you … have a math club meeting on Wednesday. You have to go. Or you can’t be in the math contest.”\n\n“Math contest?” Jamie laughed. “Sorry, bro. No way. I hate math. Catch ya later.” His phone clicked off.\n\nBrian gripped the phone. He’d gone to three math contests. This was the year he was going to win. He and Skye studied for it like crazy. And Jamie thought Skye was hot? What would she think about that?\n\nHe took a deep breath. He had to let Skye go. Let math go. That wasn’t his life anymore. He was a rock star now.\n\n“I. Am. A. Rock star!” He punched the air.\n\nHe needed to study lyrics. But first a video game. Or maybe the hot tub.\n\nThere was a knock at the door. He opened it slowly.\n\nA man with bushy red hair barged in. “Yo, Jamie. Ready to work?”\n\nThis must be George. “Uh. Sure.” George headed to the piano. “Get your guitar. We only have a few hours.”\n\n“My guitar?” Brian said.\n\nHe didn’t know how to play the guitar."
        }
      ]
    },
    {
      "title": "7 NORMAL",
      "pages": [
        {
          "pageNumber": 18,
          "text": "7\nNORMAL\n\nJamie leaned his head against the car seat. Munched potato chips. He’d never felt so relaxed. Free. No concert. No screaming fans. No one wanting a piece of him.\n\nAnd this family! They were perfect. A mom. A dad. A cute little sister. Jamie hardly ever saw his mom. His dad was his boss. He had no siblings.\n\nYeah, the phone call had upset him a little. He had some cool song ideas. And the thought of Brian blowing his concert? Ugh.\n\nBut so what? He wasn’t Jamie Hawk anymore. He was Brian Stark.\n\n“Stop hogging the chips,” Missy said.\n\n“Oh,” Jamie said. “I thought they were mine.”\n\n“Mo-om!”\n\nMrs. Stark twisted in her seat. “Share, Brian.”\n\n“Sure. Here.” He handed the bag to Missy. “You just had to ask.”\n\nShe socked him in the arm.\n\n“Ow. What was that for?”\n\n“For being you.”\n\nCute.\n\nMr. Stark pulled into a driveway. The house looked like all the others on the block. Small. One story. A basic square. That was fine with Jamie. His houses were so big. Mansions. He felt lost in them.\n\nHe followed Missy down a hall. She went into a pink bedroom. The next bedroom was blue. Must be his. Pink and blue. Talk about normal. He loved it.\n\nHe plopped onto the bed. Lay on his back. The walls were covered with posters. There was even one of him. Jamie snickered."
        },
        {
          "pageNumber": 19,
          "text": "“Is your homework done?” Mr. Stark stood in the doorway. “Don’t you have a history test?”\n\nMath contests. History tests. What a drag. But he’d be going to school tomorrow. A real school. With real kids. “History,” he said. “Sure. I’m on it.”\n\n“And you need to take the trash out.”\n\nJamie sat up. “I get to take out the trash?”\n\n“Uh … yes.”\n\nThis was so amazing. He felt a song coming on. A great song. About being normal. A normal boy. In a normal family. “I need a guitar.”\n\n“Okay. Remind me before Christmas.”\n\n“No. I mean right now.”\n\n“We don’t have a guitar.”\n\n“A piano?”\n\nMr. Stark narrowed his eyes. “Brian. You’re scaring me.”\n\n“No worries. I’m just feeling creative.”\n\n“Well. There’s the little electric piano. The one Grandma Bev used to play.”\n\nJamie jumped to his feet. “Will you help me get it? Please?”\n\nThey found the piano in the basement. Carried it to his room. Jamie plugged it in. Played a few notes. He began to sing.\n\nHis voice squeaked. It shook. Went flat. Then sharp.\n\nHe cleared his throat. Tried again. He sounded worse. Just awful!\n\nHe couldn’t sing. That is, Brian couldn’t sing. And Jamie was stuck with Brian’s voice. “Dang.” Jamie kicked the piano.\n\nThen he thought about it. He wasn’t here to sing. He’d wished to be Brian so he could be normal. Like going to school. Having real friends.\n\nThis was worth it. Totally worth it."
        }
      ]
    },
    {
      "title": "8 SCHOOL",
      "pages": [
        {
          "pageNumber": 20,
          "text": "8\nSCHOOL\n\nJamie got on the school bus. Walked down the aisle. Kids screamed. Laughed. An apple flew past his ear. His foot hit something. He tripped. Fell into a girl’s lap.\n\n“Hey! Get off!” she yelled.\n\n“Sorry,” he mumbled.\n\n“Dweeb!” came a voice from behind him.\n\nJamie turned. A kid was snorting. His big foot was stuck in the aisle.\n\n“Ha-ha. Very funny,” Jamie said. He got up. Brushed himself off. This was crazy.\n\n“Hey! Keep it moving!” the bus driver called.\n\nJamie hurried down the aisle.\n\n“Hey, Brian!”\n\nA girl waved at him. It was Skye. He recognized her. From the photo in Brian’s phone. He slid onto the seat. Thankful for a friendly face.\n\n“Carlos sticks his foot out every morning,” she said. “I can’t believe you didn’t see it.”\n\n“Guess I was distracted.”\n\n“Thinking about the history test?” she asked.\n\n“Uh, sure.” He’d looked through Brian’s backpack last night. At his books and notebook. None of it made sense. He’d figure it out today.\n\nHe stared at Skye. She wore glasses. Her hair was pulled back in a ponytail. It would look better loose. But she had smooth skin. Big brown eyes. Jamie had dated since last year. There were always girls hanging around. Before concerts. After concerts. They all wanted to be with Jamie Hawk. The rock star. Not Jamie Hawk the person.\n\n“Why are you staring? Do I have something on my face?” She wiped her cheek."
        },
        {
          "pageNumber": 21,
          "text": "He smiled. “No. I just think you’re pretty.”\n\n“Huh?”\n\n“Brian … I mean I … should have told you that before.” He held her hand.\n\n“Brian!” She pulled her hand away. “What’s going on? You’re acting weird.”\n\n“Weird in a good way?” He grinned.\n\n“I don’t think so.” She scooted next to the window. Stared outside.\n\n“Okay. Whatever.”\n\nThe bus pulled up to Trent Middle School. Skye trotted ahead of him. Two geeky kids in the hall said, “Hi, Brian.” Otherwise, Brian didn’t seem to have a lot of friends.\n\nJamie had found a class schedule in Brian’s notebook. He went to his first class. Then the next. And the next. He’d never been so bored. He daydreamed. How would tonight’s concert go? Would Brian blow it? Would his fans hate him?\n\nThe thought bugged Jamie. He’d spent a long time building his image. Would all that work be ruined in one night?\n\nHe went to lunch. The lunchroom was as crazy as the bus. Jamie gripped his tray. Looked around the crowded room. Skye sat nearby. She glanced away. Man. Cold.\n\nThe kids who’d said hi in the hallway waved him over.\n\nThen Jamie saw a table of cool-looking kids. Nice clothes. Nice hair. He headed their way. Set down his tray. Like he belonged there. “Hey,” he said. “What’s up?”\n\nThey looked at each other. Rolled their eyes. Moved to the other end of the table.\n\nWow. Middle school was brutal. Who knew?"
        }
      ]
    },
    {
      "title": "9 ENOUGH",
      "pages": [
        {
          "pageNumber": 22,
          "text": "9\nENOUGH\n\nBrian stood offstage. The opening band was playing. They were in the middle of their set.\n\nHis whole body dripped with sweat. He’d stopped breathing a while ago. He’d never been this nervous. Even at the last math contest.\n\nHe still didn’t know how to play the guitar. He’d tried to memorize the words to every Jamie Hawk song. But would he remember when he got onstage? There were thousands of fans here to see him. Him! Well, Jamie.\n\nWhat if he blew it? He shook his head. Of course he’d blow it. He might look like Jamie Hawk. And sound like Jamie Hawk. But he was Brian Stark. Always would be.\n\nMr. Hawk stood a few feet away. Swiping at his tablet.\n\n“Um, Dad?” Brian said. “I don’t feel so good. I’m gonna be sick.”\n\n“You’ve been saying that for the past hour.”\n\n“But it’s true now.”\n\nThe band ended their song. The crowd cheered.\n\n“I mean it, Dad! Don’t make me go out there. Please.”\n\n“What is wrong with you tonight? You never have stage fright.”\n\nArms wrapped Brian in a bear hug. “Hi, sweetie.” Brian twisted around. It was a girl. The prettiest girl Brian had ever seen. It was Zoe Lane. The actress. The one the photographer had asked him about.\n\n“See if you can calm him down,” Mr. Hawk said to her."
        },
        {
          "pageNumber": 23,
          "text": "“Oh, poor baby. What’s wrong?” Zoe said. “Maybe this will help.” She pulled Brian’s face to hers. And kissed him. On the lips! In front of his dad. Ew!\n\nBrian pulled away. “I … I have to go. Sorry.” He ran through the back. Then out of the arena. He pulled out Jamie’s phone. Called his own number.\n\nJamie picked up on the first ring. “Yo.”\n\n“Jamie!” Brian said. “I’m not a musician. I’m not a rock star. I don’t want to be you anymore. I want to be me again.”\n\n“Huh. I don’t know. I’m really digging being Brian Stark.”\n\nBrian slumped against a wall. “I was afraid of that. My life is pretty great. Isn’t it?”\n\n“No, dude. I’m joking! I hate being you. I want my life back.”\n\n“Good. Great. But how?”\n\n“I’ve been thinking about it. Ever since lunch. Let’s meet up where it happened. I think that weird waiter knows something. Let’s see if he can reverse the spell.”\n\n“Okay. But can you hurry? Your show starts in an hour. And my house is fortyfive minutes away.”\n\n“I’ll try. Do you have my wallet?”\n\n“Yeah.” Brian pulled it out of his pocket.\n\n“Find the gold credit card. We’ll need it. Cabs aren’t free. Okay. Here’s what we do.”"
        }
      ]
    },
    {
      "title": "10 FINAL WISH",
      "pages": [
        {
          "pageNumber": 24,
          "text": "10\nFINAL WISH\n\nBrian returned backstage. He didn’t want Jamie’s dad to worry. Forty minutes later he snuck out again. Got in a cab.\n\nThey drove a few miles. Parked behind another cab. Jamie stepped out of it. “Wait here,” Jamie told both drivers.\n\nBrian and Jamie ran down the alley.\n\nAnd froze.\n\n“Oh no,” Brian said.\n\n“What the heck?” Jamie said.\n\nThe alley was … an alley. No potted plants. No cheery fountain. The blue door was painted a dull gray. A sign on it read Acme Paper Products. The asphalt road was lined with trash bins. The statue was gone.\n\n“This can’t be the same place,” Jamie said.\n\n“It has to be,” said Brian. “Those are the right cross streets. And I remember these buildings. What are we going to do? We need that waiter.”\n\n“Maybe not,” Jamie said. “Think. How did it happen before?”\n\n“The waiter. He was … odd,” Brian said. “I wished to be you. Then I took that selfie.”\n\n“The flash didn’t work. We bumped that statue. Then you took another picture,” Jamie said. He got Brian’s phone. Scrolled through the photos.\n\n“There!” Brian said. “There it is! That statue. Whoa. It’s looking at the camera.”\n\n“But it’s not here. Let’s take another selfie,” said Jamie. “We can wish.”\n\n“Yeah.”\n\nThey stood near the door. Faced the alley. Pressed their shoulders together. Jamie held up Brian’s phone.\n\n“Are you sure you want to do this?” Brian asked.\n\n“Totally. You?”\n\nBrian nodded."
        },
        {
          "pageNumber": 25,
          "text": "“Okay,” Jamie said. “Now!”\n\nBrian looked into the camera. He began to wish. He wished with all his heart to be himself again. To be Brian Stark.\n\nZap! It was like a lightning bolt hitting them. Brian’s head spun. His shoulder seemed fused to Jamie’s.\n\nThen they flew apart.\n\nBrian stumbled. He was afraid to look. He held out his hands. Opened his eyes. “Hah!” he shouted. “I’m me! What a relief!”\n\n“Cool!” Jamie said, looking at himself.\n\nBrian looked at their selfie. No. Way. “Jamie. Look!”\n\nJamie sucked in his breath. “That’s not possible.”\n\nThe statue stared back at them. They turned. No statue. It was only in the photo.\n\n“Hey, I’d love to talk. But I have a concert to get to. I’m about to give the show of my life. This alley gives me the creeps.”\n\n“Yeah. I know. Let’s go!”\n\nJamie ran. Brian followed close behind.\n\nNext to a trash bin, a pair of eyes glowed in the shadows. They watched as the boys got into their cabs. He looked like any homeless man. Down on his luck. But his crooked smile told a different story.\n\nThe next day was tough for Brian. Skye wouldn’t talk to him. He wasn’t sure what Jamie had said to her. So he didn’t have a clue how to make things right. But it was great to have his old life back.\n\nAfter school the doorbell rang. His mom answered it. “Special delivery!” she called. “It’s for you, Brian.”"
        },
        {
          "pageNumber": 26,
          "text": "He took the envelope. “Thanks.”\n\nInside were two tickets. To Jamie Hawk’s last concert in the city. There was also a note.\n\nHey, Brian!\n\nIt was interesting being normal for a day. I don’t know how you do it! Invite Skye to the concert. Tell her you’re sorry for being a jerk. But you meant it when you said she was pretty. Thanks for everything.\n\nJamie\n\nIt took some fast-talking from Brian. But Skye agreed to go to the concert. They sat in the front row. Brian said exactly what Jamie had written in his note.\n\nSkye’s cheeks flushed. She smiled. Then she held his hand."
        }
      ]
    }
  ]
}