{
  "id": "crash-dive",
  "title": "Crash Dive",
  "author": "James Collier",
  "coverImage": "/images/covers/crash-dive.jpg",
  "lexileLevel": 550,
  "genre": "Action",
  "summary": "When a submarine springs a deadly leak under Arctic ice, fourteen-year-old Marco must use everything his father taught him to save the crew.",
  "totalPages": 15,
  "chapters": [
    {
      "title": "DESCENT",
      "pages": [
        {
          "pageNumber": 1,
          "text": "Marco had dreamed about this day for three years. Now he was finally here, standing inside the USS Triton, a nuclear submarine longer than a football field. His father, Captain David Reyes, had promised him this trip since Marco turned eleven. \"Take Your Kid to Work Day\" on a submarine. How many kids could say that?\n\nThe air smelled like metal and cleaning spray. Everything was gray steel and blinking lights. Pipes ran along the ceiling like veins. Marco had to duck under some of them, even though he was only five foot four.\n\n\"Stay close and don't touch anything red,\" his father said. Captain Reyes was a tall man with a shaved head and serious eyes. But right now he was smiling. \"Red means danger.\"\n\n\"Got it,\" Marco said. \"No red.\"\n\nA sailor named Kowalski led them through a narrow hallway. Marco's shoulders almost touched both walls. The submarine was huge from the outside, but inside, every inch of space was packed with equipment."
        },
        {
          "pageNumber": 2,
          "text": "\"This is the control room,\" Kowalski said. He was a big guy with a red beard and a gap between his front teeth. \"The brain of the boat.\"\n\nMarco looked around. Screens glowed green and blue. Crew members sat at stations with headphones on, watching numbers and lines scroll across their displays. A large screen on the front wall showed a map of the ocean floor.\n\n\"We call it a boat, not a ship,\" Kowalski explained. \"Old Navy tradition.\"\n\n\"Why?\" Marco asked.\n\nKowalski shrugged. \"Because the first submarines were small enough to fit inside a ship. The name stuck.\"\n\nCaptain Reyes checked the instruments and nodded to his crew. \"Prepare to dive. Set depth to two hundred feet.\"\n\nThe orders echoed through the submarine. Marco felt a low hum in the floor as the engines powered up. Then came a sound like rushing water, distant but strong.\n\n\"That's the ballast tanks flooding,\" his father told him. \"We let water in to make the boat heavy. Heavy things sink.\"\n\nMarco grabbed a railing as the floor tilted. They were going down."
        },
        {
          "pageNumber": 3,
          "text": "The descent was smoother than Marco expected. No shaking. No rattling. Just a gentle lean forward, like riding an escalator. The depth gauge on the wall climbed: one hundred feet, one fifty, two hundred.\n\n\"Leveling off at two hundred feet,\" a crew member announced.\n\nMarco pressed his face to a small porthole. Outside was pure darkness. No light reached this deep. He could see nothing but black water.\n\n\"Pretty cool, right?\" Kowalski said.\n\n\"It's like outer space,\" Marco whispered. \"But underwater.\"\n\nThe Triton cruised north through the Arctic Ocean. Marco learned that they were on a routine patrol under the polar ice cap. Above them, a sheet of ice stretched for hundreds of miles. Marco tried not to think about that too much. Hundreds of miles of ice between him and the sky.\n\nHis father gave him a tour of the engine room, the galley where the cook made meals for eighty crew members, and the torpedo room. The torpedoes were as long as cars.\n\n\"Don't worry,\" Captain Reyes said. \"This is just a patrol. Nothing exciting ever happens on patrols.\"",
          "image": "/images/illustrations/crash-dive-1.jpg"
        },
        {
          "pageNumber": 4,
          "text": "Marco ate dinner with the crew in the mess hall. Meatloaf, mashed potatoes, and green beans. Not bad for food cooked inside a metal tube under the ocean. The sailors were friendly. They asked about school and sports. Marco told them about his soccer team and how they almost made the state finals.\n\nAfter dinner, Kowalski showed Marco how sonar worked. A green line swept around a circular screen like a clock hand.\n\n\"Every sound in the ocean shows up here,\" Kowalski said. \"Whale songs. Shrimp clicking. Other submarines, if they're nearby.\" He pointed to a blip on the screen. \"See that? Probably a whale.\"\n\nMarco was about to ask what kind of whale when the overhead lights turned red.\n\nA siren screamed through the hallway. It was the loudest sound Marco had ever heard. It bounced off the steel walls and hit him from every direction.\n\nKowalski's face changed in an instant. The friendly smile vanished. His eyes went hard.\n\n\"Stay here,\" Kowalski said. \"Don't move.\"\n\nHe ran toward the control room. Marco stood alone in the sonar room, his heart hammering. The red lights pulsed like a heartbeat."
        },
        {
          "pageNumber": 5,
          "text": "Marco didn't stay. He couldn't. He had to find his father.\n\nHe ran down the narrow hallway toward the control room. Sailors rushed past him in both directions. Someone yelled, \"Seal section four!\" Another voice shouted, \"Get damage control down there now!\"\n\nMarco reached the control room door. Inside, his father stood at the center, calm as stone. Every screen in the room was flashing.\n\n\"Report,\" Captain Reyes said.\n\n\"Hull breach in lower compartment seven, sir. We're taking on water.\"\n\nMarco felt his stomach drop. A hull breach. That meant the ocean was getting in. At two hundred feet below the surface, the water pressure was enormous. Like having a car sitting on every square inch of the hull.\n\n\"How bad?\" his father asked.\n\n\"Bad, sir. The weld on a pipe joint failed. Water's coming in fast.\"\n\nCaptain Reyes looked up and saw Marco standing in the doorway. For just one second, Marco saw something in his father's eyes he had never seen before.\n\nFear.\n\n\"Marco, go to your bunk. Now.\"\n\nBut Marco didn't move. Something told him that going to his bunk wouldn't matter. Not if the ocean was pouring in."
        }
      ]
    },
    {
      "title": "PRESSURE",
      "pages": [
        {
          "pageNumber": 6,
          "text": "\"Surface the boat,\" Captain Reyes ordered. \"Emergency blow.\"\n\nThe helmsman's fingers flew across his controls. Then he stopped. He looked up with wide eyes.\n\n\"Sir, we can't. Ice cover is solid above us. Sonar shows at least twelve feet thick. If we hit that at full speed...\"\n\nHe didn't finish the sentence. He didn't need to. Marco understood. Punching into twelve feet of solid ice would crush the top of the submarine like a soda can.\n\nCaptain Reyes gripped the edge of the command table. \"Find me a gap in the ice. Any opening. A polynya, a lead, anything.\"\n\n\"Scanning now, sir. Nearest open water is... forty-seven miles north.\"\n\nForty-seven miles. Marco did the math in his head. At full speed, that would take almost two hours. He looked at the damage report on the screen. Water was flooding compartment seven at three hundred gallons per minute.\n\n\"Can we last that long?\" Marco asked. He didn't mean to say it out loud.\n\nEvery head in the control room turned to look at him. His father's jaw tightened.\n\n\"Yes,\" Captain Reyes said. \"We can. Helm, all ahead full. Course three-five-zero.\""
        },
        {
          "pageNumber": 7,
          "text": "The submarine lurched forward. Marco grabbed a pipe on the ceiling to keep from falling. The engines roared louder than he'd heard all day. The Triton was running for its life.\n\nKowalski appeared and took Marco by the arm. \"Come on, kid. You need to be somewhere safe.\"\n\nHe led Marco through the hallways toward the middle of the sub. They passed sailors carrying tools and emergency equipment. Everyone moved fast, but nobody ran. They were trained for this.\n\nAs they passed a heavy steel door, Marco heard a sound that made his skin crawl. A hissing, roaring sound. Like a fire hydrant blasting at full force. Behind that door, the ocean was forcing its way in.\n\n\"Seal it,\" someone shouted.\n\nTwo sailors spun a heavy wheel on the door. It shut with a deep clang. The roaring got quieter, but Marco could still hear it through the steel.\n\n\"If they seal that section, won't the people inside...\" Marco started.\n\n\"Everyone's been evacuated,\" Kowalski said quickly. \"Standard procedure. People first, then seal the compartment.\"\n\nMarco nodded, but his hands were shaking."
        },
        {
          "pageNumber": 8,
          "text": "Kowalski brought Marco to the crew quarters and told him to wait. The bunks were stacked three high, like shelves in a closet. Marco sat on a lower bunk and tried to breathe slowly.\n\nThe submarine tilted slightly. He could feel it in his gut. Were they sinking? No. They were still moving. He could hear the engines.\n\nA voice crackled over the intercom. \"All hands, this is the captain. We have a contained hull breach in section seven. We are proceeding to open water at maximum speed. Estimated time to surface: one hour forty minutes. All damage control teams report to station. That is all.\"\n\nOne hour and forty minutes. Marco looked at his watch. It was 8:15 PM.\n\nHe tried to think about something else. Soccer practice. His dog, Biscuit. His mom back home in Virginia, probably watching TV right now, not knowing that her son was trapped under the Arctic ice in a leaking submarine.\n\nAnother alarm sounded. Shorter this time. Two sharp blasts.\n\nFootsteps pounded down the hallway. Marco heard a voice he didn't recognize: \"Second breach! Section nine! We've got water in section nine!\""
        },
        {
          "pageNumber": 9,
          "text": "Marco's blood went cold. A second leak. The pressure at this depth was crushing the submarine's weak points, one by one.\n\nHe jumped off the bunk and ran into the hallway. Kowalski was nowhere in sight. Sailors rushed past, carrying pumps and welding gear. The floor was wet. Not flooded, but a thin layer of water covered the metal grating.\n\nMarco splashed through it toward the control room. He had to find his father. He had to know what was happening.\n\nBut the path was blocked. A heavy door had been sealed, cutting off the front of the submarine from the back. Marco pounded on it with both fists.\n\n\"Dad!\" he yelled. \"Dad, open the door!\"\n\nNo answer. The steel was too thick. His voice couldn't get through.\n\nMarco leaned his forehead against the cold metal. Think, he told himself. Think.\n\nHe was stuck in the back half of the submarine. The control room was in the front half. His father was in the front half. Between them was a sealed bulkhead and an ocean trying to get in.\n\nThe lights flickered. Then they went out.\n\nTotal darkness. The kind of dark where you can't see your own hand."
        },
        {
          "pageNumber": 10,
          "text": "Emergency lights kicked on after five seconds. They were dim and red, barely enough to see by. Marco's heart was beating so hard he could feel it in his throat.\n\n\"Hey! Kid!\" A woman's voice. Marco turned and saw a sailor with short black hair and grease on her face. Her name tag read CHEN. \"You're the captain's son?\"\n\n\"Yes.\"\n\n\"Okay. Stay with me. I'm heading to engineering.\"\n\nMarco followed Chief Chen through corridors that were getting wetter by the minute. Water dripped from pipes above. The floor was slick. Twice, Marco almost fell.\n\nThey reached the engineering section. Three other sailors were already there, working on a massive tangle of pipes and valves. A digital gauge on the wall read DEPTH: 195 FEET. They were slowly sinking.\n\n\"Pumps are losing the fight,\" one of the sailors reported. \"We're taking on water faster than we can pump it out.\"\n\nChief Chen studied the gauges. \"How long until we hit crush depth?\"\n\nThe sailor paused. \"At this rate? Maybe thirty minutes.\"\n\nCrush depth. The depth where the ocean's pressure would flatten the submarine like a tin can. Marco felt dizzy. Thirty minutes.",
          "image": "/images/illustrations/crash-dive-2.jpg"
        }
      ]
    },
    {
      "title": "SURFACING",
      "pages": [
        {
          "pageNumber": 11,
          "text": "Marco stared at the gauges and valves. Something tugged at his memory. A conversation from a long time ago.\n\nHe had been ten years old, sitting on the back porch with his father. It was summer, and his dad had been explaining how submarines work. Marco had asked the question every kid asks: \"What happens if the submarine sinks too deep?\"\n\nHis father had smiled. \"We have a trick for that. Emergency ballast tanks. They're filled with water to keep the boat at the right depth. But in an emergency, we can fill them with high-pressure air. Blow out all the water at once. The boat gets light in a second and shoots up like a cork.\"\n\n\"Even through ice?\" Marco had asked.\n\n\"Through thin ice, yes. The sail on top is reinforced. It's designed to punch through. But the ice has to be thin enough. Three feet or less.\"\n\nMarco looked at Chief Chen. \"The emergency ballast tanks. Can we blow them from here?\"\n\nChen stared at him. \"We can, but there's ice above us. We'd need to find a thin spot, and navigation is in the forward section. We're cut off.\""
        },
        {
          "pageNumber": 12,
          "text": "\"What about sonar?\" Marco said. \"Is there a sonar repeater back here?\"\n\nChen's eyes lit up. She turned to one of her sailors. \"Briggs, is the secondary sonar display still working?\"\n\nBriggs checked a panel on the far wall. He flipped two switches. A small green screen hummed to life. \"It's working, Chief. I've got a picture of the ice above us.\"\n\nMarco crowded in next to Briggs. The screen showed a bumpy line across the top, like an upside-down mountain range. That was the ice. Most of it was thick. Ten feet. Twelve feet. But here and there, the line dipped down to thinner sections.\n\n\"There,\" Marco said, pointing. \"That section looks thinner. How thick is it?\"\n\nBriggs adjusted the controls. \"Two point seven feet. That's thin enough.\"\n\n\"How far ahead?\" Chen asked.\n\n\"About eight hundred yards. At our current speed, we'll reach it in three minutes.\"\n\nChen grabbed the intercom handset. Static crackled. The connection to the forward section was spotty. \"Control, this is engineering. Do you copy?\"\n\nNothing. More static.\n\n\"Control, this is Chen in engineering. We have a plan. Do you copy?\"\n\nA broken voice came through. \"...copy... Chen... go ahead.\""
        },
        {
          "pageNumber": 13,
          "text": "\"Captain, we've found a thin spot in the ice. Two point seven feet, eight hundred yards ahead. Requesting permission to execute emergency ballast blow from engineering.\"\n\nThe static hissed. Marco held his breath. Then his father's voice came through, rough but clear enough.\n\n\"Do it, Chen. Blow all tanks on my mark. And Chen, my son is back there with you.\"\n\n\"He's the one who thought of it, sir.\"\n\nA pause. Then: \"That's my boy. All hands, brace for emergency surface. This is going to be rough.\"\n\nChen moved to a large panel with two red handles behind protective covers. She flipped the covers open. The handles were labeled EMERGENCY BLOW - FORWARD and EMERGENCY BLOW - AFT.\n\n\"Everyone grab something solid,\" Chen ordered.\n\nMarco wrapped his arms around a steel support beam. His whole body was tense. The water on the floor was up to his ankles now.\n\nThe intercom crackled one more time. His father's voice: \"Three... two... one... BLOW!\"\n\nChen pulled both handles down with all her strength."
        },
        {
          "pageNumber": 14,
          "text": "The sound was like a freight train. Massive jets of compressed air slammed into the ballast tanks, forcing hundreds of tons of water out through the vents. Marco felt the submarine shudder from bow to stern.\n\nThen it started to rise. Not gently. Not like the smooth descent from before. This was violent. The floor tilted sharply backward as the nose pointed up. Marco's feet slipped on the wet metal. He held onto the beam with everything he had.\n\nThe depth gauge spun backward. 195 feet. 180. 160. 120. They were rocketing toward the surface.\n\n\"Hold on!\" Chen yelled.\n\n80 feet. 50 feet. 30 feet.\n\nIMPACT.\n\nThe crash threw Marco off his feet. He slammed into the wall and saw stars. The entire submarine rang like a bell. Metal screamed against ice. Marco covered his ears.\n\nThen daylight.\n\nActual daylight, pouring through the porthole above him. Gray Arctic sky, the most beautiful thing Marco had ever seen.\n\nThe submarine had punched through the ice and broken the surface. The Triton sat in a field of shattered ice, its black hull steaming in the freezing air.\n\nThey had made it."
        },
        {
          "pageNumber": 15,
          "text": "It took twenty minutes to unseal the bulkheads. When the heavy door between the forward and aft sections finally swung open, Marco's father was the first one through.\n\nCaptain Reyes dropped to his knees and pulled Marco into a hug so tight it hurt. Marco didn't care. He hugged back just as hard.\n\n\"You scared me,\" his father said. His voice was rough.\n\n\"I scared you? I was the one in the dark with the water coming in.\"\n\nHis father laughed. It was a shaky laugh, the kind that comes after you've been afraid for a long time and the fear is finally leaving your body.\n\n\"Chief Chen says you came up with the plan,\" Captain Reyes said.\n\n\"You taught me about the ballast tanks. Remember? On the back porch.\"\n\nHis father put a hand on Marco's shoulder. \"I remember. I just didn't think you were listening.\"\n\n\"I'm always listening, Dad.\"\n\nThey walked together toward the main hatch. Cold air poured down from above, sharp and clean. Marco climbed the ladder behind his father and stepped out onto the top of the submarine. White ice stretched in every direction under a pale sky. The wind bit his face.\n\nMarco took a deep breath of Arctic air and grinned.\n\nBest. Field trip. Ever."
        }
      ]
    }
  ]
}
