{
  "id": "crash-dive",
  "title": "Crash Dive",
  "author": "Lee Frederick",
  "coverImage": "/images/covers/crash-dive.svg",
  "lexileLevel": 440,
  "genre": "Fiction,Action and Adventure",
  "summary": "The U-1X is a new kind of U-boat, out to do what no German submarine had ever done before. Her captain was Commander Heinrich Rohmer, a man who knew every trick in the book about hunting and sinking ships.   The Lancer is an American destroyer in battle for the first time. Captain William Coffey was in command. His last ship had been sunk by a U-boat. This time he wanted it to be the other way around. It would be torpedoes against depth charges in a battle only one ship could win.",
  "totalPages": 37,
  "chapters": [
    {
      "title": "1 THE U-1X",
      "pages": [
        {
          "pageNumber": 1,
          "text": "CHAPTER 1\nTHE U-1X\n\nIt was during World War II.\n\nAll of Poland was under German control. Outside of Danzig, Poland, the Germans built ships at a place called Zarchowa.\n\nEach night, the lights at Zarchowa were turned out. This was done so Zarchowa could not be seen by American and British airplanes. Very important work was being done at Zarchowa. U-boats were being built there. U-boats were what the Germans called submarines.\n\nDuring most nights when the lights were out, no work was done. But this night was different. It was November 29, 1943. Before the sun came up again, the U-1X would leave Zarchowa.\n\nThe U-1X was a new kind of German sub.\n\nCommander Heinrich Rohmer stood near the U-1X. He was a tall man with deep blue eyes. His face was weathered from many years at sea. He wore officer’s black clothes. Commander Rohmer liked his job and did it well. He was one of the best U-boat commanders in the German Navy. He was about to begin his most important job. He was the first commander of the U-1X.\n\n“Hello.”\n\nCommander Rohmer turned around. “Yes?”\n\n“I’m Eric von Braun,” said a young man.\n\nThere was a full moon out. The commander could see that Eric von Braun was an officer. But the commander knew he had never seen the young man before.\n\n“What do you want?” Commander Rohmer asked him.\n\n“I’m to be First Officer on the U-1X.“\n\n“You look young for a First Officer.”"
        },
        {
          "pageNumber": 2,
          "text": "“I’ve been on four U-boats, sir.”\n\n“I see.”\n\n“Are you Commander Rohmer?”\n\nThe commander moved his head up and down. “Welcome to the U-1X,” he said.\n\n“Thank you, sir.”\n\nCommander Rohmer turned to look at the sub. It was painted black. However, he could still see it in the light of the full moon. It was not as long or as wide as the other subs at Zarchowa. But the U-1X looked strong and ready to go.\n\nThen Eric von Braun spoke again. “I can’t get over how different it looks,” he said.\n\n“That’s because it is different.”\n\n“Yes, sir.”\n\n“It’s not as big as other U-boats,” said Commander Rohmer. “But it can make much longer trips and do it in less time. And, most important of all, the U-1X can carry more torpedoes.”\n\n“What about our orders, sir? What are we supposed to do with this new U-boat?”\n\n“I don’t know. I was told not to open the orders until we are under way. Only then will we know where we are going.”\n\nFirst Officer Eric von Braun went to put away his things. Commander Rohmer went on board, too. He stood on the deck of the sub. He welcomed the other members of the crew as they came on board.\n\nMost of the crew had spent the past ten weeks at work on the U-1X. They had learned all about the sub. Now they were ready to leave Zarchowa."
        },
        {
          "pageNumber": 3,
          "text": "At four o’clock in the morning, the engines of the U-1X were started. The ropes were freed, and the sub pushed away.\n\nIn less than an hour, the U-boat had sailed out of the Gulf of Danzig. Now it was in the Baltic Sea. The water was cold and dark.\n\nThe U-1X was on its way.\n\nWith the U-1X was another submarine, the U-28. It was not a new sub like the U-1X. But it had a very good war record. It had sent many enemy ships to the bottom. The two submarines moved across the dark surface of the sea.\n\nIn his office, Commander Rohmer wondered where the U-1X would be sent. He took the closed orders out of his safe and put them on his desk. It was time to open them.\n\nThen there was a knock at his door.\n\n“Come in.”\n\nIt was First Officer von Braun. “Sorry to break in on you, Commander. But have you—?”\n\nCommander Rohmer laughed and picked up the orders. “I was just about to open them,” he said. “Sit down.”\n\n“Thank you, sir.”\n\nThe commander read the orders twice before he spoke again. Then all he said was, “Portsmouth.”\n\n“Portsmouth!” the First Officer said. “The Allied defenses at Portsmouth are very strong.”\n\n“That’s why we are going there,” Commander Rohmer said. “All U-boats from now on will be built like the U-1X. If we can get past the Allied defenses at Portsmouth, that is.”\n\n“And what if we can’t?”"
        },
        {
          "pageNumber": 4,
          "text": "Commander Rohmer looked at his young First Officer. He didn’t answer the question.\n\nHe didn’t have to."
        }
      ]
    },
    {
      "title": "2 PORTSMOUTH",
      "pages": [
        {
          "pageNumber": 5,
          "text": "CHAPTER 2\nPORTSMOUTH\n\nU.S. Navy Captain William Coffey looked at the ship’s clock in his room. The clock showed the time, and it also showed the day. It was Captain Coffey’s birthday. It was December 9, 1943.\n\nBut he had not told anyone it was his birthday. There was a war going on. Everyone was too busy to think about birthdays.\n\nWilliam Coffey was the captain of the American ship Lancer. Lancer was a destroyer. Destroyers were built to fight against U-boats in the war.\n\nLancer was a new destroyer. It had never been in a fight with a U-boat.\n\nBut Captain Coffey had been in many fights with many U-boats. He had won most of them. Once, however, he had lost. His last ship went down because of a U-boat. And many of his men went with it.\n\nCaptain Coffey and his crew had sailed their new ship all the way across the Atlantic Ocean. They left America ten days ago. They reached England yesterday. Now they were staying at a famous English port.\n\nThe port was called Portsmouth.\n\n“Happy birthday, Captain Coffey!”\n\nThe captain couldn’t believe his ears. He turned around to see who was talking. All he said was, “What?”\n\nMr. Baker, one of the ship’s officers, stood by the open door. He smiled. “I said, happy birthday.”\n\n“Thank you,” the surprised captain answered. “But how did you know?”\n\n“You talked about it last night.”\n\n“I did?”"
        },
        {
          "pageNumber": 6,
          "text": "“Yes, sir. It was very late. I heard you when I walked past your room.”\n\n“I was talking in my sleep?”\n\n“I think so, sir.”\n\nCaptain Coffey turned red. He felt a little silly. “Er…well, thank you again, Mr. Baker. Is there anything else?”\n\n“Yes, sir. Edwin Gray, the Port Commander, is here to see you.”\n\n“Send him in.”\n\n“Right away, sir.”\n\nMr. Baker left, and in a minute another man came to the door.\n\n“Welcome to Portsmouth, Captain,” said the Port Commander as he came into the room. He was old. His hair was white. He looked like someone’s grandfather. But he moved and talked very fast, like a young man. “We have never had an American destroyer stationed here before.”\n\nCaptain Coffey shook the Port Commander’s hand. “I hope my crew and I can be some help to you here, Commander Gray,” he said.\n\n“Perhaps, but we have never had any need for a destroyer. We have never had a German ship or U-boat get past our defenses. Portsmouth is famous for its strong defenses. We always blow them out of the water.”\n\n“Well, Lancer is ready, Commander,” said Captain Coffey. “Just in case.”\n\nSoon dinner was carried into the room by a member of the crew. A table was set up for the captain and the Port Commander. But before they could finish their food, they heard a giant explosion out in the port."
        },
        {
          "pageNumber": 7,
          "text": "Captain Coffey dropped a piece of bread. He jumped to his feet. “What was that?” he shouted.\n\nThe Port Commander was almost out the door. “I think we just got another one,” he answered as he ran from the room.\n\nCaptain Coffey followed the Port Commander. Up on the destroyer’s deck, he checked to see if anything was wrong with his ship. Lancer was not hurt. Everyone was safe.\n\nIt was night, and big lights were shining all over the port. Captain Coffey looked around. All of the other ships seemed to be OK, too. He wondered where the explosion had come from.\n\nThen he heard another explosion. He saw water shoot up into the air near the mouth of the port. And then a fire started to burn right on top of the water.\n\nThe lights were all pointed at the fire. Captain Coffey could see a pool of oil on top of the water. It was the oil that burned, not the water.\n\nThe Port Commander came over to Captain Coffey. “That fire is all that is left of a German U-boat,” he said. “It’s the second one this week that tried to get past our mine fields and submarine nets.”\n\n“The other one didn’t make it either?”\n\n“Of course not. Our defenses here at Portsmouth cannot be broken.”\n\n“Perhaps.” Captain Coffey shook his head. “But it shows me the Germans are not going to stop trying,” he said."
        }
      ]
    },
    {
      "title": "3 UP PERISCOPE!",
      "pages": [
        {
          "pageNumber": 8,
          "text": "CHAPTER 3\nUP PERISCOPE!\n\nCommander Rohmer of the U-1X looked into the sub’s periscope. He watched the pool of oil burn on the water inside Portsmouth.\n\nThe U-1X was two hundred yards away. It was underwater, out of reach of the big lights in the port.\n\n“Now we are on our own,” the commander said to First Officer von Braun. “We go the rest of the way alone.”\n\n“What happened to sink the other U-boat?” the First Officer wanted to know.\n\n“It must have hit a mine. It didn’t even get half the way into Portsmouth.”\n\n“Are we still going to try, Commander?”\n\n“We are. The U-1X is not as big as the U-28 was. We can make it if we are careful and go very, very slowly.”\n\n“Yes, sir.”\n\nCommander Rohmer ordered the periscope to be brought down. “Ahead one-third,” he said.\n\nFirst Officer von Braun told the engine room to go forward at one-third speed. The U-1X started to move in the water.\n\n“Portsmouth won’t be ready for another U-boat so soon,” said Commander Rohmer. “We will catch them by surprise.”\n\n“If we can get past their defenses,” First Officer von Braun said.\n\n“We can.”\n\n“Yes, sir. I hope so, sir.”\n\n“What’s the matter? You look sick.”\n\n“I think I’m frightened, sir.”\n\nCommander Rohmer knew how his First Officer felt. He had felt the same way many times in the past. As a matter of fact, he felt the same way right now. “So am I,” he said."
        },
        {
          "pageNumber": 9,
          "text": "“You, sir?” First Officer von Braun sounded very surprised.\n\n“That’s right. This is a new kind of U-boat, and no one knows how well it will work.”\n\nFirst Officer von Braun did not say anything.\n\nCommander Rohmer smiled. “But if anything can get past the defenses at Portsmouth,” he said, “the U-1X can.”\n\n“Yes, sir.”\n\nCommander Rohmer ordered the sub to slow down. No one said anything after that. All of the members of the crew stayed at their posts and waited.\n\nThe U-1X went very slowly. It was deep in the water, near the sea floor.\n\nSuddenly, the U-boat hit something. Many members of the crew were knocked down. The lights inside the U-1X went out, but they came back on right away.\n\n“Is everyone all right?” Commander Rohmer asked. He was the first one back on his feet.\n\nNo one seemed to be hurt. And the U-1X was still in one piece.\n\n“We must have hit a rock,” the commander said. “Or part of the U-28 or some other ship that was sent to the bottom. If it had been a mine, we would not be living now.”\n\nSo the U-1X kept going. The sub got past the mine fields and passed the submarine nets. Many times the sides of the sub rubbed against things. It took over an hour. Finally, however, the U-boat was inside Portsmouth."
        },
        {
          "pageNumber": 10,
          "text": "The crew shouted with joy. Everyone was happy. Even Commander Rohmer laughed and joked with his crew. It made them all feel good. They had done what they wanted to do. What no sub had ever done before.\n\nNow all they had to do was show the Allies what the U-1X had done.\n\nAnd escape when that was finished.\n\n“Up to periscope depth,” Commander Rohmer said.\n\nThe German submarine moved slowly up almost to the surface.\n\n“Up periscope!”\n\nThe commander took a good look around Portsmouth. He counted the ships and made notes about how big they were.\n\nNext, Commander Rohmer picked out two of the ships. One was the British ship HMS Dorchester. The other was an American ship, the Connecticut.\n\n“We will sink those two ships,” he said.\n\nThe U-1X fired three torpedoes at each of the ships. The torpedoes raced across the port and into the sides of the ships.\n\nThe explosions shook the port. Commander Rohmer looked into the periscope. He smiled.\n\n“We got them,” he said. “They are both on fire. They have started to sink.”"
        }
      ]
    },
    {
      "title": "4 THE Lancer",
      "pages": [
        {
          "pageNumber": 11,
          "text": "CHAPTER 4\nTHE Lancer\n\nAll of the big lights at Portsmouth were turned on again. Bells rang. Men shouted. Fires burned. Smoke filled the cold night air.\n\nLancer was not hurt. But the ship next to it, the Connecticut, was sinking.\n\nOn board the destroyer, Captain Coffey went up to the bridge. He ordered his crew to their battle stations. He told Mr. Baker to turn off the ship’s loud bell. Then he sent the order below to start the engines.\n\nSoon, Lancer was ready to go.\n\nThe destroyer was the first ship in Portsmouth to start moving. But two other ships soon followed Lancer into the open port.\n\nAll of the ships had their big lights turned on. They made the water as bright as day. Everyone at Portsmouth wanted to find the U-boat that had broken their defenses.\n\nBut the German sub was not to be seen.\n\n“Should we drop some depth charges, Captain?” asked Mr. Baker.\n\n“Yes,” said Captain Coffey. “Right away.”\n\nMr. Baker sent the order to the crew. Two strings of charges were fired. They were set to go off when they were deep in the water.\n\n“The depth charges,” said Mr. Baker, “should either sink the U-boat or make it surface. It cannot hide for long.”\n\n“If it has not already escaped.”"
        },
        {
          "pageNumber": 12,
          "text": "After the first depth charges went off under the water, two more strings of depth charges were thrown over the side. They flew into the air and landed in the water. They sank from sight. A minute later, they also went off. Mountains of water from the explosions shot up into the air with a roar.\n\nWater splashed over the destroyer. The crew got ready to fire more depth charges. But Captain Coffey ordered them to wait. He didn’t want to fire more than he had to.\n\nSuddenly, Mr. Baker pointed to the right side of the ship. “Look, Captain,” he shouted. “Over there! Torpedoes!”\n\nCaptain Coffey turned around to see. Sure enough, two big torpedoes were coming at the destroyer. But he could see that they would miss his ship. “Don’t worry,” he said to Mr. Baker. “We are OK.”\n\n“The German is not a very good shot,” Mr. Baker said with a laugh.\n\nCaptain Coffey just shook his head. “I think he is very good,” he said.\n\nThe captain pointed to the two ships behind Lancer. One torpedo hit each of the other ships. The explosions made both ships burn with orange and yellow fire. Black smoke climbed into the night sky.\n\n“By firing when he did, the other ships couldn’t see the torpedoes coming. Lancer was in the way,” Captain Coffey explained. Then, shouting over the noise, he ordered, “Fire more depth charges!”"
        },
        {
          "pageNumber": 13,
          "text": "More depth charges were fired from the Lancer’s deck. The charges landed near where the torpedoes were first seen. They sank into the water and blew up.\n\n“I hope we get the U-boat this time, Captain,” Mr. Baker said. He looked worried.\n\n“So do I, Mr. Baker,” said the captain.\n\n“We have to, Captain. It will fire one of its torpedoes at us next.”\n\n“Let’s get it before it does, Mr. Baker. Fire depth charges!”\n\nStill more depth charges were dropped into the sea. The explosions rocked Lancer. They pounded the sides of the ship like a giant hand. But the German sub was not to be found.\n\nJust then, Mr. Baker turned white. He pointed. “Look, Captain! Look!”\n\nTwo more torpedoes could be seen. And both of them were coming right at the American destroyer.\n\n“Stop the engines,” Captain Coffey told the engine room.\n\nLancer slowed in the water. The change in speed made one of the torpedoes miss the ship.\n\nThe other torpedo, however, crashed into the side of the destroyer. But there was no explosion. When the torpedo hit the ship, it sounded like a big, empty drum had been hit very hard.\n\n“It didn’t blow up,” Mr. Baker said. “It was a dud. The torpedo was a dud!” He jumped up and down. He seemed very happy.\n\nThe captain was happy, too. But he did not have the time to show it. “Full speed ahead,” he ordered. “And lay more depth charges!”"
        },
        {
          "pageNumber": 14,
          "text": "Once again, depth charges flew into the air and landed in the water. By the time the Lancer’s crew was ready to fire again, Captain Coffey ordered them to stop.\n\nFar ahead of them, a U-boat was coming up out of the water. It came up near the mouth of the port. It had U-1X painted on its side in white letters.\n\nOn the American destroyer, the crew shouted with joy. “We forced them up!” Mr. Baker said. “Lancer has won its very first battle with a U-boat!”"
        }
      ]
    },
    {
      "title": "5 THE HUNT BEGINS",
      "pages": [
        {
          "pageNumber": 15,
          "text": "CHAPTER 5\nTHE HUNT BEGINS\n\nWhen the U-1X was on the top of the sea again, First Officer von Braun turned to Commander Rohmer. “We are on the surface, Commander,” he said.\n\n“Start the diesel engines,” Commander Rohmer ordered. The diesel engines could not be run under water. They needed air to work. But they were much faster than running the U-boat on its batteries.\n\n“I don’t understand why you told us to come up, Commander,” the First Officer said. “The destroyer is twice as fast as we are.”\n\nCommander Rohmer turned to face First Officer von Braun. He saw many other members of the crew looking at him, too. They all wanted to hear what he had to say.\n\n“We can make better speed on the surface,” he told them. “And there are no mines or nets. Besides, the Allies know we are here now. There is no use in trying to get past their mines under water again. The high waves and the dark will hide us very soon. We will be much better off on the surface.”\n\nEveryone seemed to believe the commander was right.\n\n“Full speed ahead,” the commander ordered.\n\n“Let’s get out of here while we still have the chance.”\n\nJust then, the sound of explosions filled the U-1X. Then again. And again.\n\n“They are firing at us with their guns!” First Officer von Braun shouted. He could not be heard very well above the noise of the explosions. They were very close."
        },
        {
          "pageNumber": 16,
          "text": "“Then we shall fire back,” Commander Rohmer said. “Man the deck gun!”\n\nSeveral members of the crew ran up the steps and climbed out of the U-1X. Commander Rohmer and First Officer von Braun followed them up.\n\nThe two officers stood on the sub’s deck. It went up and down with every wave. They watched the crew fire the U-boat’s gun at the destroyer that was coming at them.\n\nThe first shell landed in the water in front of the destroyer.\n\n“Too short!” First Officer von Braun shouted. “Up 15!”\n\nTwo shells from the destroyer landed on either side of the sub, throwing up white water.\n\n“Hard to port!” said Commander Rohmer. The sub made a sharp turn to the left. A few seconds later, another shell from the destroyer exploded right where the sub had been.\n\nThe crew fired the U-boat’s gun again. This time the shell came down right next to the destroyer.\n\nThe destroyer turned to the right, still firing. But the U-boat was beginning to pull away from the American ship.\n\nA few shells from the destroyer fell around the U-1X, but not so close now. The moon had gone down. The night was very dark. The sea was covered with high waves."
        },
        {
          "pageNumber": 17,
          "text": "After a while, the U-1X was a long way from the destroyer. It stopped firing. The sub was already lost from sight in the English Channel. Soon it would be in the North Sea. Commander Rohmer saw the fires that the U-1X had caused at Portsmouth. They were very far away now.\n\nFor a long time, the only sound was the noise of the sub’s engines. Finally, First Officer von Braun spoke. He said, “The U-1X did a very good job tonight.”\n\n“The U-1X,” said Commander Rohmer, “could not have done better.”\n\n“We sank four ships, maybe five. I would like to know about that last one, the destroyer. I think we sank it, too, Commander.”\n\n“Perhaps,” Commander Rohmer answered. “In any case, the U-1X did a fine job tonight.”\n\n“And best of all,” von Braun said, “we got away. We escaped.”\n\nCommander Rohmer was about to say something. But the man who was on watch shouted at him. “Commander!” the man said. “There is a destroyer coming at us—fast!”\n\nThe commander could see the black shape of the American ship in the sea close behind them. The ship was running at top speed. It was coming right at them.\n\nCommander Rohmer shouted an order to his crew. “Crash dive!” he shouted. “Crash dive!”"
        }
      ]
    },
    {
      "title": "6 THE LONG NIGHT",
      "pages": [
        {
          "pageNumber": 18,
          "text": "CHAPTER 6\nTHE LONG NIGHT\n\nThe captain had ordered lights. He did it as soon as he was sure the sub had seen them. The lights flashed out into the black night like arrows. Now he and Mr. Baker were on the destroyer’s bridge. The lights found the U-boat. It was diving. They watched the U-boat sink below the surface.\n\nThe sub was almost out of sight, but the lights helped them. They could still see its black shape in the water.\n\n“It seems small, not like other U-boats,” said Mr. Baker.\n\n“It’s different, all right,” said Captain Coffey.\n\n“It had to be different to get past the defenses at Portsmouth.”\n\n“What does it say on the side?”\n\n“U-1X.”\n\n“Get the depth charges ready,” the captain ordered, and Mr. Baker passed the order to the crew on the deck.\n\n“Ready and waiting, sir,” came a call from one of the crew members.\n\n“By the time we get over there, the sub will be gone,” Mr. Baker said.\n\n“Lancer has a new machine for finding U-boats,” Captain Coffey said. “It’s called sonar. It sends out sound waves under the water. Our sonar man can listen to the sound waves when they come back. He can tell where a U-boat is and how far away it is. That is, he can if his sound waves hit the sub. When sonar works, it’s great. But it does not always do well in heavy seas.”\n\n“Like tonight?”\n\n“Yes, like tonight,” the captain said."
        },
        {
          "pageNumber": 19,
          "text": "As soon as the destroyer reached the spot where the U-boat went under, Captain Coffey ordered his ship to slow down.\n\nThen Captain Coffey picked up the ship’s telephone and called below. “First, I want to hear what the sonar man has to say,” he told Mr. Baker.\n\n“We have something on the sonar,” the man told Captain Coffey. “It’s the U-boat, all right. Less than three hundred yards ahead of us. It’s moving away fast.”\n\n“Full speed ahead,” the captain told the engine room. Lancer raced forward until it had gone more than four hundred yards. That should have put them right above the U-boat. Then Captain Coffey ordered, “Fire depth charges!”\n\nSeveral depth charges flew out from the destroyer. A few seconds later, Lancer rocked in the water when the explosions went off in the water behind the ship.\n\nThen Captain Coffey picked up the ship’s telephone again. “Anything?” he asked the sonar man.\n\n“The U-boat is still moving away, sir,” the sonar man answered. “Very fast.”\n\nThe captain called the engine room and ordered the ship to go as fast as it could.\n\nThe destroyer had not gone far, however, before the sonar man came back on the ship’s telephone. He was talking fast.\n\n“I think the U-boat is stopping, sir,” he said.\n\n“Stopping? Are you sure?”\n\n“No, sir. All the noise from the explosions knocked out the sonar.”"
        },
        {
          "pageNumber": 20,
          "text": "Captain Coffey ordered his ship to slow down again. He waited for his sonar man to listen for a minute. Then he asked, “Well?”\n\n“I think…” said the sonar man. “I think…Wait a minute.”\n\n“What is it? What do you hear?”\n\n“It’s no use, sir. It’s gone. The U-boat is gone. I can’t hear anything.”\n\n“Don’t you know where it stopped? We must know,” said the captain.\n\n“I’m sorry, sir. In this area, I think. But just where, I don’t know.”\n\nCaptain Coffey put down the ship’s telephone. He didn’t say anything.\n\n“What’s the matter?” Mr. Baker asked.\n\n“The Germans have turned off their engines. They are probably sitting on the bottom. As long as they don’t make any noise, we may never find them.”\n\n“What about the sonar?”\n\n“We can’t count on it. It’s still very new. Sonar works best when you have some idea of where to look. And we don’t know where to point it as long as the U-boat stays still. We could look for a week.”\n\n“So what do we do?”\n\nThe captain was tired. He rubbed his eyes. The long night was almost over. It would be light in a few hours.\n\n“Captain?”\n\n“This is what we will do,” the captain said. “We will run Lancer from one end of this area to the other. We will lay a string of depth charges all the way.”\n\n“If we do that, we can’t miss,” said Mr. Baker. “We will sink them for sure.”"
        },
        {
          "pageNumber": 21,
          "text": "“Maybe we will sink the U-boat. Maybe not. But if nothing else, we can make it turn on its engines and try to escape. Then we can’t miss.”\n\n“Yes, sir. When do we start?”\n\n“Right now.”\n\nLancer spent the next hour and a half sailing from one end of the area to the other. And the ship’s crew dropped depth charges all the way. It did not seem possible that the U-boat could escape the explosions.\n\nMuch to Captain Coffey’s surprise, however, the charges did them no good. The sonar man still could not hear anything. And Captain Coffey knew they had not hit the U-boat because nothing was floating on the water.\n\n“When a U-boat is hit,” he told Mr. Baker, “something always floats to the surface.”\n\n“I don’t understand how we could miss, Captain, with all those depth charges.”\n\n“I don’t either, Mr. Baker,” the captain said. He shook his head slowly. Then he looked up. “Wait a minute,” he said.\n\n“What is it, Captain?”\n\n“I just remembered. Something like this happened in a battle I had with another U-boat once. I found out later that the U-boat had followed right behind my ship, just under the surface. The U-boat could not be heard by us because it was in the ship’s heavy wake.”\n\n“You think the U-1X did the same thing to us tonight, Captain?”\n\n“I’m sure of it, Mr. Baker.”\n\n“Is it still following us?”"
        },
        {
          "pageNumber": 22,
          "text": "“Not if the German commander is smart. He should have followed us only as far as the end of our run. Then he should have dropped off, gone to the bottom, and waited.”\n\nCaptain Coffey pointed to the far end of the area. “The sub is probably over there now, waiting for us to use up all of our depth charges. Let’s go!”\n\nMr. Baker called the engine room. “All ahead full,” he said."
        }
      ]
    },
    {
      "title": "7 ON THE BOTTOM",
      "pages": [
        {
          "pageNumber": 23,
          "text": "CHAPTER 7\nON THE BOTTOM\n\nThe U-1X rested on the floor of the sea like a sleeping fish. Not a sound came from the sub. It had not moved an inch in more than an hour.\n\nInside the U-boat, all of the crew members were being very still. And they were careful not to make any noise. Even when they talked, they just whispered.\n\nIt had been several minutes since they had heard or felt any depth charges. And the last ones had been very far away. Slowly, the members of the crew began to take it easy. They started to talk out loud, and they smiled a lot. “The destroyer must be out of depth charges,” someone said. They felt safe, and they thanked their commander for saving them.\n\n“The U-1X has escaped, thanks to you, Commander Rohmer,” First Officer von Braun said.\n\nMany members of the crew were ready to have a party. They were happy that their work was over for now. They were glad that they were not hurt or dead. They were glad, too, that the U-1X was OK. Now they wanted to drink, and sing, and tell stories. They wanted to have some fun.\n\nCommander Rohmer would have liked a good time, too. But he was not laughing or talking out loud like the rest of the crew. He was still very worried."
        },
        {
          "pageNumber": 24,
          "text": "“The American captain will soon understand what we have done,” Commander Rohmer told the crew. “If he is any good at his job, he will be after us again.”\n\nThe commander’s words put an end to the happy talk. No one knew now if the U-1X was safe or not.\n\nThey listened.\n\nAnd they waited.\n\nA few minutes later, they heard the rush of the destroyer’s engines. Then the U-1X shook like a leaf in the wind. A depth charge went off close to the sub. Then another. And another.\n\nThree close depth charges in just a few seconds. All very close. It was almost more than the U-boat could take.\n\n“We have to do something, Commander,” First Officer von Braun said.\n\n“I know,” said the commander. But he couldn’t think of what to do. He took in a lot of air. Then he let it all out at once. He looked around at the crew. He could see how frightened they were. Each man knew that the next explosion could mean the end. He had to say something to them.\n\nHe was just about to speak. Suddenly, a gray-haired member of the crew grabbed at his chest and fell over. “Oh-hhhh,” George Wilheim said, and then he stopped moving.\n\n“Call the doctor!” said First Officer von Braun. “This man needs help!”\n\n“Never mind,” said Commander Rohmer. He was feeling George Wilheim’s neck. “This man is dead.”\n\n“Dead? How?”"
        },
        {
          "pageNumber": 25,
          "text": "“His heart, I think,” the commander said. “I told him he was too old for U-boats. He would not listen.” Rohmer stood up. He felt tired and very sad.\n\nNo one said anything for what seemed like a long time.\n\n“Commander Rohmer, sir,” First Officer von Braun said at last. “George Wilheim’s problems are over now. But ours are getting worse. We have to do something.”\n\nOnce again, explosions went off right next to the U-1X. The lights were knocked out. The walls made a cracking sound. The sub rolled over on its side and lay on the sea bottom like a dead animal.\n\nFinally, however, the U-boat righted itself. And soon the lights came back on.\n\nOnly a few people were hurt. But everyone was frightened. They all knew that the U-1X could not take much more pounding.\n\nThen Commander Rohmer pointed at the floor. His eyes were very large. “Where is that water coming from?” he shouted.\n\n“The Stores Room,” came a call from the back of the sub. “The wall is cracked. We have locked the door. No more water is getting in.”\n\nCommander Rohmer looked at von Braun. “Another string of explosions like that one and we are finished,” he said.\n\n“Let’s start our engines and make a run for it,” said the First Officer. There was a cut on his face, and his hands were shaking."
        },
        {
          "pageNumber": 26,
          "text": "“That is just what the Americans want us to do,” the commander said. “If we start our engines now, they will know right where we are. The sound of the engines would give us away. Then we would be finished for sure.”\n\nVon Braun looked very frightened. Commander Rohmer would not have been surprised if his young first officer started to cry. But von Braun did not.\n\n“Well, just what are we going to do, sir?” he asked the commander.\n\n“We are going to let George Wilheim save all of us,” Commander Rohmer said.\n\n“How can that be? George Wilheim is dead.”\n\n“Put his body in one of the empty torpedo tubes. Also put in a broken chair, some shoes, and other things that will float. We will shoot them out and let some oil go at the same time. The Americans will see all of these things floating on the surface. They will think that we are all dead.”\n\nVon Braun smiled. “A great plan,” he said. Then he turned to the crew. “OK, you men. You heard the commander. Let’s go!”\n\nCommander Rohmer’s orders were carried out. Then the crew of the U-1X again waited and listened. No more depth charges came their way. But the destroyer could still be heard, going around and around in a big circle on the surface."
        },
        {
          "pageNumber": 27,
          "text": "Von Braun shook his head. “I can’t understand why there is only one ship after us,” he said. “There has been more than enough time for others to get here by now.”\n\nCommander Rohmer could not understand it, either. He had tried already, many times. Then the First Officer said something that made it all clear.\n\n“The Americans must not be calling for help,” von Braun said. “Can it be that their radios are all broken?”\n\n“No,” the commander said. “The American radios are not broken. They are very smart. They are not using their radios. They do not want news about the broken defenses at Portsmouth to get out.”\n\n“Then no one knows that the U-1X sank four ships inside Portsmouth?”\n\n“No one but the people at Portsmouth,” the commander said. “And us, of course.”\n\nFirst Officer von Braun looked like he was about to speak again. But Commander Rohmer held up his hand.\n\n“Yes, I know what you are going to say. The news that we broke the defenses at Portsmouth must get back to Germany. It must get back even if we don’t,” the commander said. “We can’t use our radio underwater. Get ready to surface,” he ordered."
        }
      ]
    },
    {
      "title": "8 TORPEDOES TO PORT!",
      "pages": [
        {
          "pageNumber": 28,
          "text": "CHAPTER 8\nTORPEDOES TO PORT!\n\n“There are no more bodies, sir,” Mr. Baker said to Captain Coffey. “There was just that one. Doctor Wilson is looking at it now.”\n\n“Did we find anything other than the body, Mr. Baker?”\n\n“Yes, sir. A broken chair, some food, clothes, and lots of oil.”\n\nDoctor Wilson stepped onto the ship’s bridge. He was a small man with a pink face. “Hello, Captain,” he said.\n\n“Hello, Doc. What did you find out?”\n\n“The man we fished out of the water was a German, all right. His name was George Wilheim, judging from papers he had in his pocket,” the doctor said.\n\n“Is there anything more you can tell us?”\n\n“Yes. He has U-1X written on his shirt.”\n\nMr. Baker smiled. “Then we got them!” he said. “We did it, Captain. We got them.”\n\nDoctor Wilson shook his head. “Maybe, Mr. Baker. Only maybe.”\n\n“What do you mean?”\n\n“I mean, George Wilheim did not drown. I think he was dead before he got into the water.”\n\n“If he didn’t drown,” the captain asked, “how did he die?”\n\n“He was old and rather fat. He should never have been on a submarine in the first place. I think his heart gave out.”\n\n“What does this mean?” Mr. Baker wanted to know. “Didn’t we get the U-boat after all?”"
        },
        {
          "pageNumber": 29,
          "text": "“I don’t think so,” said the captain. “But we probably came very close. To save themselves, they put the man’s body into the water. That and the other things we found floating.”\n\n“They tried to trick us,” said Doctor Wilson. “But I know a drowned man when I see one.”\n\n“Thanks, Doc,” Captain Coffey said.\n\nAfter Doctor Wilson left, Captain Coffey turned to Mr. Baker. “The German commander is smart. But now he has told us that he is in this area for sure. Now we can lay our charges and get that U-boat.”\n\n“But, sir, we have only six depth charges left. That’s not enough for even this small area,” Mr. Baker said.\n\nCaptain Coffey shook his head. He had not been counting depth charges. Now he wished he had. He had wasted them while the U-1X had sat safe and sound. It made him mad.\n\nBut what could he do? He needed to know where the U-boat was sitting. He had to know the exact spot. He couldn’t miss. If he did, the U-1X would get away for sure.\n\nThen the answer came to him. He hit his leg with his open hand.\n\n“Sonar! Of course! We can use our sonar again. We know about where the U-boat is. Sonar will tell us the exact spot.”\n\n“Then we will know where to drop the last of our depth charges?” Mr. Baker said."
        },
        {
          "pageNumber": 30,
          "text": "“That’s right,” the captain answered. He picked up the ship’s telephone. He was about to call the sonar man, but Baker stopped him.\n\n“Captain!” Mr. Baker shouted. He was pointing to the left side of the ship. “Torpedoes on the port side!”\n\nCaptain Coffey looked. He saw two white trails in the dark water. He knew that the trails were made by torpedoes.\n\nThe white trails were growing longer.\n\nAnd they were coming right at the destroyer."
        }
      ]
    },
    {
      "title": "9 SITTING DUCK",
      "pages": [
        {
          "pageNumber": 31,
          "text": "CHAPTER 9\nSITTING DUCK\n\nCommander Rohmer looked into the sub’s periscope. He could see the two white trails rushing toward the American destroyer.\n\nRohmer watched the two torpedo trails. It looked like both torpedoes would hit the ship at the same time. And in the same place, too-close to the back end.\n\n“They look like good shots,” he told the crew as he watched the explosions light the sky.\n\nThen he turned away. “Down periscope,” he said. The periscope came down, and Commander Rohmer ordered, “Start the engines. Let’s take her up. As soon as we are on the surface, full speed ahead. We shall see how much the destroyer was hurt.”\n\n“Did we hit it, sir?” von Braun asked.\n\n“Yes, we did. Right in the tail with both torpedoes.”\n\n“Then why are we running?”\n\n“We are not running. We are out of torpedoes in the front tubes. And we have only one left in the back tubes. This way, if the ship comes after us, we can fire our last torpedo at it without slowing down.\n\n“And if the destroyer cannot follow us?”\n\n“Then we will go home,” said Commander Rohmer.\n\n“And have a party?” asked von Braun.\n\nThe commander smiled. “Yes. And have a party,” he said.\n\nThen he turned to another member of the crew. “Get ready to surface,” he said. “Bring her up to periscope depth.”\n\n“Yes, sir, Commander.”"
        },
        {
          "pageNumber": 32,
          "text": "The U-boat moved slowly up toward the surface. Commander Rohmer brought the periscope up out of the periscope well. He put his eye to the eye-piece as the periscope came up. He looked all around, moving the periscope around in a circle.\n\nThe only thing in sight was the American destroyer. It was on fire. The U-boat’s torpedoes seemed to have done their work very well.\n\n“Surface!” Commander Rohmer ordered. “I don’t think we will have to worry about that destroyer any more.”\n\nThe U-1X surfaced. Commander Rohmer and First Officer von Braun came up on the deck. They could see the American destroyer several hundred yards away.\n\nIt was not coming after them. It was not moving. It seemed to be dead in the water. Orange and red fire burned on the back end of the ship. The fire looked very hot. And thick black smoke hung in the air above the ship.\n\n“It looks like the destroyer is finished,” von Braun said to the commander. “Shall we head for home?”\n\n“Yes,” the commander answered. “Head for home. Full speed ahead.”\n\nThe submarine pulled away from the burning destroyer.\n\nSuddenly, Commander Rohmer ordered the U-boat to stop. He shook his head. “We cannot go. Not when our last torpedo could sink that destroyer. Let’s go back.”\n\n“What about its guns, Commander? It could blow us out of the water.”"
        },
        {
          "pageNumber": 33,
          "text": "“Don’t worry. We will come at it from the back. It will have to move to train its guns on us. If it does, we will crash dive.”\n\nThe U-1X went in a wide circle around the destroyer. Rohmer and von Braun watched the fire burn on the ship. Lancer fired over and over again at the U-boat. But Commander Rohmer made sure that the U-1X stayed out of reach of the ship’s guns.\n\n“The destroyer is still not moving,” von Braun said. “And it looks like many men are trying to put out the fire.”\n\n“The ship may not be moving,” said the commander, “but it is not sinking, either.”\n\n“Sir?”\n\n“Our last torpedo may be enough to sink it.”\n\nCommander Rohmer ordered the sub to stop. It was as close to the destroyer as it could be and still be safe. “The destroyer is a sitting duck,” he said.\n\nThe U-1X had to turn around. Only then would its last torpedo be pointed at the ship.\n\nThe commander gave the order.\n\nSlowly, the U-1X began to turn."
        }
      ]
    },
    {
      "title": "10 THE KILL",
      "pages": [
        {
          "pageNumber": 34,
          "text": "CHAPTER 10\nTHE KILL\n\nOn the destroyer’s bridge, Captain Coffey stood with Mr. Baker. They were both watching the U-1X.\n\nIn the back of the ship, crew members were keeping close watch on the burning oil drums they had put there. The burning oil made it look like the destroyer was on fire.\n\n“The U-boat is very close, now, Captain,” said Mr. Baker. “Your plan is working.”\n\n“I knew we could get them to come to us only one way,” said Captain Coffey. “We had to look like we were an easy kill.”\n\n“Should we set fire to any more oil drums, sir?” Mr. Baker asked.\n\n“No. I think our little fire has done its job very well.”\n\n“Yes, sir. You were right about another thing, too. It must have looked to the Germans like Lancer was hit by their torpedoes.”\n\n“Yes.”\n\n“I still can’t get over it, sir,” Mr. Baker said. He shook his head. He could not keep himself from smiling. “Have you ever heard of two torpedoes running into each other that way?”\n\n“Who knows, Mr. Baker? It may have happened before.”\n\n“Talk about luck! When I saw them coming I thought we were done for. Then, at the last second, they ran into each other and exploded.”\n\n“We can talk about it later,” Captain Coffey said. “The important thing now is timing. And right now I think the U-1X has come as close as it is going to come.”\n\n“Is it turning around, Captain?”"
        },
        {
          "pageNumber": 35,
          "text": "“Looks like it,” said the captain. “That’s good.”\n\n“It is?”\n\n“Yes, it is. Start the engines, Mr. Baker.”\n\n“Yes sir,” Mr. Baker said. He reached for the ship’s telephone.\n\nOn the U-1X, Commander Rohmer and First Officer von Braun stood together. They were on the deck. Both men heard the sound of the destroyer’s engines. They looked across the water at the dark shape of the American ship.\n\nThere were many other members of the crew on the deck. They were about to man the sub’s deck gun. They, too, heard the ship’s engines.\n\nThe air was very still. The sea was almost calm, more so than it had been all night. The only sound was the noise of the Lancer engines.\n\nThe American ship began to move in the water. It picked up speed fast. Then it turned toward the U-boat.\n\n“Look, Commander!” First Officer von Braun said. “The destroyer has started its engines. They are coming for us! They are not really on fire after all!”\n\n“The American captain has tricked us,” Commander Rohmer said. “Get everyone below. And fast!”\n\nA loud horn started to sound on the U-1X. Men ran for the open hatches.\n\nCommander Rohmer waited for the last of his men to get inside. Then he shouted, “Crash dive! Crash dive! Crash dive!”\n\nThe U-1X started to sink in the water. But it did not go down fast enough."
        },
        {
          "pageNumber": 36,
          "text": "Before the first wave had splashed across the sub’s deck, it was hit by the destroyer. And the destroyer was going full speed. The crash made a noise like no one had heard before. The U-1X broke in two.\n\nThe two parts of the U-1X floated in the water for less than a minute. Then they sank from sight.\n\nThe sea all around the destroyer was filled with the members of the U-boat’s crew. There were also many other things floating all over the area.\n\nThe crew of the American ship went to work. They pulled the crew of the German sub out of the cold water.\n\nHalf an hour later, Captain Coffey and Mr. Baker left the Lancer’s bridge. They were on their way to the deck.\n\nOn the deck below, Commander Rohmer stood next to First Officer von Braun. The commander was wearing a heavy coat that the destroyer’s crew had given him.\n\nFirst Officer von Braun was not standing. He was sitting on the deck. His leg was broken.\n\nCommander Rohmer looked around. Most of his crew had escaped with their lives. But the U-1X was lost. Worse yet, news of Portsmouth had not been sent home.\n\nFirst Officer von Braun moved. “Commander?” he said.\n\n“Yes. I am here.” The commander lowered his head toward his First Officer.\n\n“Am I…?”\n\n“The American doctor says your leg is broken, but you will be OK.”"
        },
        {
          "pageNumber": 37,
          "text": "Von Braun looked like he was glad for that. But he still seemed worried and frightened. “So what’s to become of us now?”\n\n“We will probably spend the rest of the war in an American prison camp.”\n\n“But, Commander.…”\n\n“Rest now. That’s an order.”\n\n“Yes, sir.”\n\nWhen Commander Rohmer looked up, he found Captain Coffey standing beside him. The captain was holding a cup of hot tea. He held it out to the commander.\n\nIn the east, the sun was coming up."
        }
      ]
    }
  ]
}