{
  "id": "dream-of-the-dead",
  "title": "Dream of the Dead",
  "author": "Marie Seth",
  "coverImage": "/images/covers/dream-of-the-dead.svg",
  "lexileLevel": 290,
  "genre": "Horror,Action and Adventure,Thrillers,Mysteries,Romance,Fiction",
  "summary": "Was it really happening, or was it all just a dream?  Diana was less and less sure.  The ghost of a Scottish girl dead for 200 years was slowly taking control of her mind.  Not even Mark, who loved her, could bring her back now.  For now Diana was dreaming the dream of the dead.",
  "totalPages": 44,
  "chapters": [
    {
      "title": "1 THE POND",
      "pages": [
        {
          "pageNumber": 1,
          "text": "CHAPTER 1\nTHE POND\n\n“Ghosts!” Diana Fessler said. “Do you have real ghosts here?”\n\n“Now wait a minute!” Andrew Lang said, laughing. “Jenny, tell your friend you were joking. Don’t frighten her as soon as she begins her visit.”\n\nJenny Lang smiled. “All right, Uncle Andrew. Diana, I was joking. But this is the kind of big old house that should have a ghost. And there are strange noises. A lot of strange things happened when we first moved in.”\n\n“It was all in your mind,” Andrew Lang said. “After we talked it over, they stopped, didn’t they?”\n\n“Yes, and I was glad,” Jenny said. “I was really frightened for a while. But people around here believe in the ghost. Even Mark does, I think. And he is a parson’s son.”\n\nMark Woodburn smiled. He was tall and good-looking. “No, Jenny,” he said. “I don’t believe in ghosts. But I have seen things here that I can’t explain. And I told your uncle when you came that no one stays here long. That’s all I said.”\n\n“No more talk of ghosts now while we eat,” Mr. Lang said. “Diana, I can’t tell you how glad I am that you came to Scotland for the summer. It is good for Jenny to have company here.”\n\n“Yes,” Jenny said, “Mark and his father, the parson, are our only neighbors. It’s nice to have company. For all of us.”"
        },
        {
          "pageNumber": 2,
          "text": "“I was so glad when you sent me the ticket,” Diana said. “I still can’t believe I’m in Scotland.”\n\nDiana was an old friend of Jenny’s. She used to spend her summer vacations with Jenny and her uncle, Andrew Lang.\n\n“I’m glad you could come,” Jenny said. “It will be just like the old days when you used to stay at our house for the summer. Remember those long walks we used to take?”\n\n“I remember how Diana used to walk in her sleep,” Mr. Lang said. “We were afraid she would walk right out the door. Do you still walk in your sleep, Diana?”\n\n“Oh, no,” Diana answered. “I haven’t walked in my sleep for a long time.”\n\n“That’s good,” said Mark. “We wouldn’t want you walking off and getting lost. There are very few houses around here for miles. Just this house, our house, and the church.”\n\n“It is rather out-of-the-way,” Diana said. “How did you happen to come here?” she asked Mr. Lang.\n\n“My people were from around here,” he said. “Long, long ago, of course. This summer my wife wanted a long visit with her sisters. I decided to come here—to this part of Scotland. I have always wanted to. Jenny came to keep an eye on me. This was the only house we could rent. So here we are.”"
        },
        {
          "pageNumber": 3,
          "text": "Diana looked about the room. Everything she could see was large and old. It was hard to see much by the light of the candles. The house had no electricity. It was too far out of the way for electricity.\n\nThere were two pictures on the wall across from her.\n\nDiana went over to look at them.\n\nOne was of a man in an army coat and hat. The kind they wore long ago. He looked mean, Diana decided.\n\nThe other picture was of a young woman. Diana wondered who she was. She couldn’t see the picture clearly by the light of the candles.\n\n“Her name was Elizabeth Angus,” Mark said, as if reading her mind. “She was the daughter of the man who built this house, over two hundred years ago.”\n\nHe turned to Mr. Lang. “You should take that picture down.”\n\n“It isn’t our house, Mark. We must leave things as they are,” Mr. Lang said. “Besides, what trouble can a picture cause?”\n\nMark didn’t answer.\n\nThere was a flash of lightning outside. Diana jumped and then felt silly.\n\nMark gave her a warm smile. “That’s just one of our sudden storms,” he told her. “I think I’d better be going before the rain begins.”\n\n“Yes,” Mr. Lang said. “I wouldn’t want you to get lost in a storm and walk into the bog.”"
        },
        {
          "pageNumber": 4,
          "text": "Mark said to Diana, “I don’t know if you know about bogs. They are fields of mud. Deep, deep mud. You sink down and down and are never seen again. I don’t want to frighten you. But a bog is something to keep away from. There is one near the graveyard next to the church.”\n\n“I’ll remember,” Diana said.\n\nAfter he left, Diana said, “How nice he is, Jenny.”\n\n“He was brought up well,” Mr. Lang said.\n\n“But he is still nice,” Jenny said, laughing.\n\nDiana could feel her eyes getting heavy.\n\n“You have had a long trip, Diana,” Mr. Lang said. “Jenny, why don’t you take her up to her room now.”\n\n“Take a candle,” Jenny said. “We always have to remember to carry a candle at night.”\n\nDiana said, “It’s going to be hard getting used to not having electricity.”\n\nThey went up the long turning stairs and down a long dark hall. They turned into another hall and went into the last room.\n\n“We don’t use most of the rooms,” Jenny said. “You will get lost at first. But your room is right next to mine. Uncle Andrew is just at the other end of the hall.”\n\nDiana said, “Oh, Jenny, it will be so good to have our long talks again.”\n\n“Let’s talk tomorrow,” Jenny said. “I’ll let you sleep now.”\n\nThere was an oil lamp on a small table. She showed Diana how to light it."
        },
        {
          "pageNumber": 5,
          "text": "Jenny left the room. Diana went to the window. But she couldn’t see anything. She could only hear the rain and the wind.\n\nShe looked around the room. Next to the lamp was a large old music box. Diana picked it up. The key would not turn. It was broken. She put it back on the table and got ready for bed.\n\nWith the noise of the storm outside, she didn’t think she would fall asleep soon. But she did. She dreamed about her long trip over the ocean.\n\nHer dream was not the way her real trip had been. In her dream the airplane was not flying in good weather. There was a storm. The plane shook as lightning hit it again and again.\n\nJust as the plane was about to crash, a voice screamed. It said, “Help me! Please help me!”\n\nDiana sat up in bed, shaking.\n\n“What a dream!” she said. “I’m glad it’s over. It was so real!”\n\nBut there it was again. Above the noise of the wind she thought she heard someone scream, “Help me! Please help me!”\n\nDiana ran to the window. She opened it, letting in the rain.\n\n“Where are you? I’ll help you. Tell me where you are,” she shouted.\n\nIn a flash of lightning she could make out a pond. Near the edge of the pond, she could see someone splashing in the water."
        },
        {
          "pageNumber": 6,
          "text": "There was another flash of lightning. Now she could not see anyone in the pond. Even with the wind blowing, the water was still. There were no waves at the edge.\n\nThere was no time now to think how strange that was."
        }
      ]
    },
    {
      "title": "2 THE GIRL IN THE GRAVEYARD",
      "pages": [
        {
          "pageNumber": 7,
          "text": "CHAPTER 2\nTHE GIRL IN THE GRAVEYARD\n\n“Diana, what is it? I heard you shouting,” Jenny said. She ran into the room with a candle.\n\n“Someone out there needs help. Someone in the pond,” said Diana. She rushed to the door.\n\n“Wait, Diana,” Jenny said. “What do you mean? What pond? Who needs help?”\n\n“I’ll tell you on the way,” Diana said. She ran down the hall. “Help me find the stairs.”\n\nJenny ran beside her. She pointed out the way. As they ran, the candle went out.\n\n“Stop, Diana. We can’t run down the stairs in the dark. Wait until I light this candle again,” Jenny said. “Tell me what happened.”\n\n“I heard a woman scream for help. In a flash of lightning, I saw her in the pond. The next time the lightning flashed she was gone,” Diana said.\n\n“But, Diana, there is no pond,” Jenny said.\n\nThey looked at each other in the low light of the candle.\n\n“I saw a pond,” Diana said. “I saw it very clearly.”\n\nJenny asked, “Are you sure you heard someone scream? Could you have dreamed it? Or could it have been the wind?”\n\n“Well, I was having a bad dream,” Diana said. “Only I heard it again after I woke up. I couldn’t hear it too clearly because of the sound of the wind.”"
        },
        {
          "pageNumber": 8,
          "text": "“There you are then,” Jenny said. “Listen, Diana, this house does strange things to people. Mark and his father won’t tell me much. But I heard Mark tell Uncle Andrew that strange things have happened here before.”\n\nDiana and Jenny walked back down the hall.\n\n“Yes, you said you had trouble when you first came here,” Diana said. “What kind of trouble? Can you tell me?”\n\n“I heard things, too,” Jenny said. “Or I thought I did. And I thought I saw things sometimes. I was never really sure. Then one day I was all by myself in the house. It was a hot day. Suddenly I was so cold. As cold as ice. I just shook from the cold.”\n\nThey went into Diana’s room. Diana sat down on the bed. Jenny sat in a large soft chair.\n\n“What did you do?” Diana asked.\n\n“I ran out and looked for Uncle Andrew,” Jenny said. “We had a long talk. He said I was probably coming down with a cold. Or I had been standing by an open window. I told him about the other things.”\n\n“Was he surprised? Or did he just laugh?” Diana said.\n\nJenny said, “Uncle Andrew told me it’s like that in some old houses. No one knows why. He told me what to do the next time something strange happened. He said just to tell myself over and over that it wasn’t real. And it worked.”\n\n“You don’t see or hear strange things now?” asked Diana."
        },
        {
          "pageNumber": 9,
          "text": "Jenny smiled. “Sometimes I almost do. But right away I tell myself it isn’t happening. It stops and it doesn’t frighten me any more.” She stood up. “We had better get to sleep now.”\n\n“Good night, Jenny,” Diana said as her friend left the room.\n\nIt was some time before Diana could get back to sleep. She turned from side to side. Now and then she thought she heard a voice calling far away. Calling her name.\n\n“It’s only the wind. It’s only the wind,” she told herself over and over.\n\nShe had a strange empty feeling. She felt she had let down someone who needed her help.\n\n“I want to help you,” she whispered. “But I don’t know how.” Hearing the words made her feel silly. She smiled and went to sleep.\n\nIn the morning the first thing she did was look out the window.\n\nShe saw green grass, a garden, and trees. There was no pond in sight. There was just a clear space in the middle of a circle of big trees. She could also see the old church and the graveyard next to it.\n\nIt was a cool, gray morning so she put on a pretty yellow dress.\n\nJenny’s room was empty. Diana found her way down to the kitchen.\n\n“Jenny, where did you learn to cook with a wood stove?” she said, laughing."
        },
        {
          "pageNumber": 10,
          "text": "“Mark showed me how,” Jenny said. “Poor Uncle Andrew ate a lot of burned food at first. But now I have the hang of it. Mark and his father do their own cooking.”\n\nDiana said, “Then the parson’s wife—”\n\n“Parson Woodburn was never married,” Jenny said to her friend. She saw the puzzled look on Diana’s face.\n\nJenny explained, “Mark’s parents died when he was five or six. The parson took him in. Mark doesn’t talk much about it. But I know he looks on Parson Woodburn as a father. Mark took Woodburn for his last name. He did it because he wanted to.”\n\n“Oh,” Diana said. “Then both of you lost your parents when you were little. That must make you even better friends.”\n\n“Don’t get the wrong idea about Mark and me,” Jenny told Diana, with a smile. “We are just friends. Nothing more.”\n\nJust then they heard Andrew Lang coming down the stairs. He was singing a happy song. He went out the side door.\n\n“He is so happy here,” Jenny said. “I’m so glad we came to Scotland. Oh, look, I haven’t set the table yet.”\n\n“I’ll do that,” Diana said. She flew about finding dishes and cups.\n\nHearing that Jenny wasn’t interested in Mark made her feel like singing. But that was silly. She had only met him once.\n\nMr. Lang came in with some eggs.\n\nDiana ate a big breakfast. At home she was never hungry in the morning."
        },
        {
          "pageNumber": 11,
          "text": "After breakfast Mr. Lang went to the study to read his mail. Jenny and Diana heated water to wash the dishes.\n\nThe sun came out. Light streamed in the windows. The bad dream and strange feelings of last night seemed far away.\n\nLater Mr. Lang took Diana to see the garden.\n\nDiana couldn’t stop thinking about Mark Woodburn. From time to time she looked toward the church.\n\nThen she saw someone walking in the graveyard. It could be Mark. He was too far away for her to be sure.\n\nA woman was standing in the man’s path. She was wearing a long white dress. The man walked right by her without slowing down.\n\n“Take a look at this row of greens,” Mr. Lang said. “Did you know that you can cut them and they will grow right back?”\n\n“No, I didn’t,” Diana said. When she looked up again, the man was much closer. The woman was gone.\n\n“Here comes Mark,” Mr. Lang said. “I’m going in for a basket. I want to cut some greens for lunch.”\n\nMark Woodburn gave Diana a warm smile and said hello.\n\nShe smiled back and said, “Who was the woman in the graveyard? Does she live around here?”\n\nMark’s smile was gone. “What woman?” he said. “What are you talking about?”\n\n“The woman in the long dress,” Diana said. “I wonder why she is wearing a long dress on such a warm day.”"
        },
        {
          "pageNumber": 12,
          "text": "Mark gave her an angry look. “There was no woman there, Diana. The sun was playing tricks with your eyes.”\n\n“But she was right in your path,” Diana said. “You almost bumped into her. You must have seen her.”\n\nMark looked so angry that Diana was afraid. “I tell you that there was no woman in the graveyard!” he shouted."
        }
      ]
    },
    {
      "title": "3 THE FACE IN THE MIRROR",
      "pages": [
        {
          "pageNumber": 13,
          "text": "CHAPTER 3\nTHE FACE IN THE MIRROR\n\nDiana looked at Mark with wonder. She didn’t know what to say.\n\n“You should not have come,” Mark said in a cold voice. “All of you should have stayed away. Why wouldn’t Mr. Lang listen to me?”\n\nHe walked toward the house with quick steps. Diana followed slowly.\n\nWhy was Mark so angry with her? What had she said? Did the woman in the graveyard mean something to him? Something he did not want her to know about?\n\nShe didn’t see him in the house. She heard voices from the study. But she couldn’t make out the words.\n\nDiana headed for the kitchen to look for Jenny.\n\nIn the hall she saw a mirror. She stopped to see what the wind had done to her hair.\n\nThe hall was dark. The mirror was old. The only light came from the room across the hall.\n\nBut in the mirror she could see a tear on her face.\n\n“Mark made me cry. I didn’t even know it,” she said to herself. She rubbed her face. The tear was still there.\n\n“How strange!” she said. Her heart began to beat fast.\n\nSuddenly she saw that the face in the mirror had very long hair. Not short, like hers. And a different color—light brown. Her own hair was dark brown.\n\nDiana began to shake. She backed away from the mirror, her heart pounding."
        },
        {
          "pageNumber": 14,
          "text": "She looked behind her to see if there was someone there. No one was there. But across the hall she saw the picture of Elizabeth Angus.\n\n“Of course,” Diana said. “That’s what I saw in the mirror. The girl in the picture. That has to be it.”\n\nDiana looked closer at the picture. The girl did look very sad. She was not crying, however.\n\nLight from the window was shining on something in the picture. It was something the girl was wearing around her neck. It looked like a gold locket.\n\n“Maybe that locket was the tear I saw,” Diana said to herself. “Maybe it was a trick of the light.”\n\nBehind the girl in the picture was a circle of young trees. The trees were around a small round pond.\n\nHer heart began to beat fast again.\n\nThe pond looked just like the one in her dream. It was the same pond.\n\nShe jumped when she heard a voice behind her. It was Mark.\n\n“I’m so sorry for the way I spoke to you,” Mark said. “There was no call for it.”\n\n“But why were you so angry?” Diana asked. “I don’t understand.”\n\nMark said, “I can’t explain. It would only frighten you. How I hate this house! I said you shouldn’t have come here, Diana.”\n\nJenny called out from the kitchen, “Mark, is that you? The stove is too hot again. Come and tell me how to fix it.”"
        },
        {
          "pageNumber": 15,
          "text": "Mark fixed the stove and then left. He said he would try to come back after dinner.\n\nAfter he left, Jenny said, “He checks up on us every day.” She laughed. “It is almost as if he thinks there will be trouble.”\n\nThe day went fast. The sun stayed out.\n\nJenny and Diana took a long walk in the afternoon. They walked in a big circle around the house.\n\nWhen they were in the graveyard, Jenny pointed to the left. “Don’t ever walk too far over that way,” she said.\n\n“Why not?” asked Diana. “What is over there?” She could see that there was a lot of tall grass but not many trees.\n\n“The bog,” Jenny said.\n\n“Did anyone ever get caught in it?”\n\nJenny said, “Mark says long, long ago a girl was lost. It was the little sister of the girl in that picture in the house. She was never found. They decided she went down in the bog.”\n\nSuddenly Diana went cold. It felt like someone had put ice down her back.\n\n“You’re shaking. What is wrong?” Jenny said.\n\n“I don’t know. I’m cold,” said Diana.\n\n“It’s this graveyard,” Jenny said. “These big old trees keep out the sun. Let’s go.”\n\nDiana felt better when they were back in the house. She helped Jenny fix dinner.\n\nDiana said, “Did Mark tell you he hates this house?”\n\n“He told you that?” Jenny said. “But then why does he come every day?”"
        },
        {
          "pageNumber": 16,
          "text": "“He comes to see the people, not the house,” Diana pointed out.\n\n“It is strange,” Jenny said. “He seems to worry about us so much. I don’t know what he thinks is going to happen.”\n\nMark came over after dinner. The four of them played cards. It was late when Mark left.\n\nAfter he left, Mr. Lang said, “Jenny, did you see what I saw?”\n\n“See what?” Diana asked.\n\nMr. Lang and Jenny laughed.\n\n“You and Mark,” Jenny said. “His eyes never light up when he looks at me. But they did the first time he saw you. There is an electricity between the two of you.”\n\nMr. Lang said, “Someone might think that you and Mark were old friends.”\n\nDiana could feel her face burn. “I don’t know what you mean,” she said. But she did know. She had felt it, too.\n\nShe went up to her room. For a long time she stood by the window. She looked up at the stars. She wondered how Mark felt.\n\nThen she went to bed. Right away she began to dream. She knew it was a dream.\n\nIn her dream she got up. She walked down the hall in the dark. She went down the stairs and out the door.\n\n“I have to find it,” she said.\n\nDiana walked to the edge of the pond."
        },
        {
          "pageNumber": 17,
          "text": "“It fell here by the edge,” she said out loud. “I saw it fall by this tree. But why are the trees so large? So large and old?”\n\nShe got down on the ground. Her fingers dug into the earth.\n\n“Diana, what in the world are you doing?”\n\nDiana looked up. Jenny was standing over her. They were outside.\n\nThere was a full moon. Diana looked around. She could see her fingers were black with dirt. They hurt from digging.\n\nShe looked for the pond.\n\nThere was no pond. She knew there was no pond. Why couldn’t she get it out of her mind?"
        }
      ]
    },
    {
      "title": "4 THE TOMBSTONE",
      "pages": [
        {
          "pageNumber": 18,
          "text": "CHAPTER 4\nTHE TOMBSTONE\n\n“Diana, I’m sorry. I know I should not wake you when you walk in your sleep. But what are you doing?” Jenny said.\n\n“I have to find it,” Diana said. She was still half in her dream.\n\n“Find what?” Jenny asked as she helped her up. “What are you looking for?”\n\n“I don’t know,” Diana said. “I had to find something. I knew it was right here. Right here near this tree.”\n\n“Why can’t you dream in bed like other people?” Jenny said. She smiled at her friend.\n\n“I haven’t walked in my sleep for years,” Diana said. “I thought I was over that.”\n\n“You frightened me,” Jenny said. “I was still awake. I heard you go past my door. I saw that you didn’t have a light. So I went after you with a candle.”\n\nThey went back inside. Jenny walked with Diana to her door.\n\n“Do you want me to lock you in?” Jenny asked.\n\nDiana said, “No, I’ll put a chair in front of the door. Remember when I used to have to do that every night?”\n\nDiana lay awake for a long time. Too many strange things were happening.\n\nDiana was afraid.\n\n“Is there something wrong with me?” she wondered.\n\nAt last she went to sleep. There were no more dreams that night.\n\nAt breakfast Mr. Lang told her she did not look well.\n\n“I’m all right. I didn’t sleep well,” she said."
        },
        {
          "pageNumber": 19,
          "text": "She wished she could tell him about her fears. But he would just tell her not to think about it. Or maybe he would think the kind thing to do would be to send her home. She didn’t want to go home, away from Jenny. Away from Mark.\n\nEven Jenny didn’t know all of it. She didn’t know about the face in the mirror. For some reason, Diana didn’t want to tell her about it. Not yet. She couldn’t make up her own mind about it.\n\nAfter breakfast Mark came over. He was riding a horse. He was leading two other horses.\n\n“Hello, Diana. Hello, Jenny,” he said. “Would you like to go riding? I brought some horses over for you.”\n\n“I would love to,” Jenny said. “But I have to write a letter now. You two go.”\n\n“Mr Lang, would you like to ride this morning?” Mark asked.\n\n“Not this morning,” Mr. Lang said. “I have some work to do.”\n\nDiana knew that Jenny and Mr. Lang were being kind. They were letting her and Mark have some time together.\n\nShe wondered if Mark knew it. It was hard to tell what Mark was thinking.\n\nDiana told Mark she had never been on a horse. Mark showed her how to get on.\n\nShe looked down. It seemed a long way to the ground."
        },
        {
          "pageNumber": 20,
          "text": "Mark laughed. “That horse is so old it can hardly walk. Don’t you worry. If you want to stop, just pull. But don’t pull too hard or fast.”\n\nThey rode for half an hour.\n\nMark said, “You are doing great for your first ride, Diana. But I think we should rest. Here is a good spot.”\n\nDiana enjoyed riding. But it felt good to get off the horse for a while.\n\nThey sat down on a large rock.\n\nThere were so many things Diana wanted to know about Mark. Yet she felt she knew him without knowing about his past.\n\n“Were you born near here?” she asked.\n\n“Yes,” he answered. He didn’t say any more for a minute. Then he added, “I was born in the house you are staying in.”\n\n“Oh,” Diana said.\n\nMark was looking down in an angry way.\n\n“I know you don’t like to talk about the house,” Diana said. “But can I ask you about that picture of the girl?”\n\n“What about it?” Mark said. He was looking away from her.\n\n“Who was the girl in the picture? Do you know anything about her?” Diana asked.\n\nMark’s voice was hard. But he looked sad, not angry.\n\n“She killed herself,” he said. “She drowned herself.”\n\nDiana jumped to her feet. “I don’t believe you!” she shouted.\n\n“What do you mean?” Mark said. “Why would I make it up?”"
        },
        {
          "pageNumber": 21,
          "text": "“Oh, Mark, what a silly thing for me to say!” Diana said. “I don’t even know why I said it. I didn’t know I was going to say it.”\n\n“Let’s get back on our horses,” Mark said. “I want to show you something.” He smiled at her. But his eyes were full of worry.\n\nThey rode to the graveyard. At the edge of it he pointed out a tombstone. They got off their horses.\n\n“The writing on it is very old,” he said. “It’s hard to read. See if you can make it out.”\n\nIt took Diana a long time. Mark didn’t help her. Diana knew he wanted her to read it for herself.\n\nShe said, “The name on top is Elizabeth Angus. The stone says she died in 1778. That’s two hundred years ago.”\n\n“See if you can make out the other words,” Mark said.\n\nLittle by little, Diana read:\n\n“Cut short her own life at the start.\n\nDrowned because of a broken heart.”\n\nThey didn’t speak for a while.\n\nAfter a few minutes Diana said, “I saw a pond in that picture of her. Did she drown in that pond?”\n\n“Yes,” Mark said.\n\n“Mark, it all happened so long ago. Two hundred years ago. Why does it hurt you to talk about it?” Diana said.\n\nMark looked at her. “The pond was near the house. It was inside that circle of trees.”\n\n“But there is no pond there,” Diana said."
        },
        {
          "pageNumber": 22,
          "text": "“Not any more,” Mark said. “The pond was filled in after my parents drowned in it.”"
        }
      ]
    },
    {
      "title": "5 THE STORY OF ELIZABETH",
      "pages": [
        {
          "pageNumber": 23,
          "text": "CHAPTER 5\nTHE STORY OF ELIZABETH\n\n“I didn’t want to tell you, Diana,” Mark said. “I didn’t want to frighten you.”\n\n“Sometimes it’s worse not to know something,” Diana said. “There is too much going on that I don’t understand. I am not a child that you should keep things from me.”\n\n“I have to start way back,” Mark said. “Long before what happened to my parents.”\n\n“All right,” Diana said. They sat down again to talk.\n\n“There is a lot that I don’t understand either,” Mark said. “My father—the parson, that is—won’t talk about it.”\n\n“How did you learn what you do know?” Diana asked.\n\n“From friends and neighbors,” Mark said. “There was a kind old woman who used to cook and clean for us. She helped the parson bring me up. She liked to talk about the old days.”\n\n“Does it begin with Elizabeth Angus?” Diana asked the parson’s son.\n\n“Yes,” Mark said. “Elizabeth Angus was very young. She was in love with a man named Ian Mackenzie. Her father didn’t like it.”\n\n“Because she was too young?” Diana asked.\n\n“That was part of it,” Mark said. “Also, the Mackenzies were poor. They had a small farm. Ian was in the army. So was Elizabeth’s father. Of course, he was much higher up than Ian.”\n\n“That sounds bad for Ian,” Diana said."
        },
        {
          "pageNumber": 24,
          "text": "“It was,” Mark said. “Elizabeth’s father had him sent far away. To some war or other. I don’t know just when this happened. Elizabeth’s father may have hoped that he would be killed. Or that Elizabeth would forget about him.”\n\n“What happened?” Diana asked.\n\n“Some people say that news came that Ian was dead. And Elizabeth went out that night and drowned herself.”\n\nDiana said, “Why is it that I know that can’t be true?”\n\nMark said, “Other people told me that Elizabeth would not believe Ian was dead. Her father told her and she would not believe him.”\n\n“Then why would she drown herself?” Diana said. “For what reason?”\n\n“I don’t know,” Mark said. “Some people even say that the news of Ian’s death came after Elizabeth had drowned. How ever it happened, that was the beginning of the end of the Angus family. Elizabeth’s little sister died in the bog a month later. Her parents died soon after. The house was left to other members of the family. They stayed for only a few weeks. The house was rented several times. No one stayed long. After that it was empty for many, many years.”\n\n“You mean people were afraid to stay in it?” Diana said.\n\n“I guess so,” Mark said. “At last the Angus family died out. The house and land were sold. The new owners moved in. They left the next morning with food still on the table.”\n\n“The house was empty again,” Diana said."
        },
        {
          "pageNumber": 25,
          "text": "“For a few years,” Mark said. “Then my father wanted to get married. But he had no money. He was a painter. So he and my mother said they would look after the house and grounds. They moved in as soon as they were married.”\n\n“And they stayed,” Diana said.\n\n“One night when I was six I heard my mother scream outside. I ran out. My mother was in the pond. She was caught in the weeds.”\n\n“You still remember all of it, don’t you?” Diana said.\n\n“Like the night it happened,” said Mark. His hands were shaking. “My father jumped in to save her. He told me to run for help. I ran to the parson.”\n\n“And came back to find them both drowned. Poor Mark,” Diana said. “But did it have something to do with Elizabeth Angus?”\n\nMark said, “I don’t see how it could. But other people believe it did. I just know I hate the house. Too many bad things happen there.”\n\n“Did you tell Mr. Lang about all this?” asked Diana.\n\n“I told him some of it. He laughed at the idea that something could be wrong with the house.”\n\n“Mark, I want to tell you some strange things that have happened to me. But I want to think about what you have told me first,” Diana said.\n\n“I’ll come over tonight. We can talk then,” Mark said.\n\nThey rode back to the house. Jenny met them at the door."
        },
        {
          "pageNumber": 26,
          "text": "“How did the riding lesson go?” Jenny asked.\n\n“Diana rides like she was born to it,” Mark said, smiling.\n\n“He means I didn’t fall off once,” Diana said.\n\nMark took her hands. “Don’t worry too much. We will try to work it out tonight,” he said in a low voice.\n\nThe day went by slowly for Diana.\n\nOutside, the day had turned gray and rain had begun to fall. Diana sat by the window, watching the rain splash against the glass.\n\nAt dinner Mr. Lang said, “Who wants to go into town tonight? A woman is giving a talk on weed control.”\n\n“In this rain?” Jenny said. “Besides, I have to finish a letter.”\n\nMr. Lang said, “How about you, Diana?”\n\n“I’m afraid I have to finish a letter, too,” Diana said. Now why did I say that? she asked herself.\n\n“Who are you writing to?” Jenny asked.\n\nDiana started to answer but she stopped. Her head was light and her heart was beating fast. She had started to say she was writing a letter to Ian Mackenzie. A man who had been dead two hundred years.\n\nDiana said quickly, “And Mark Woodburn is coming over.”\n\n“Maybe he would rather go to the talk instead,” Mr. Lang said.\n\nIt took Diana a minute to see that he was joking.\n\nMark came over soon after Mr. Lang left for town in his car.\n\n“I’ll go up and finish my letter,” Jenny said."
        },
        {
          "pageNumber": 27,
          "text": "“Please stay,” Diana said. “I want you to hear what I say to Mark.”"
        }
      ]
    },
    {
      "title": "6 A LETTER TO IAN",
      "pages": [
        {
          "pageNumber": 28,
          "text": "CHAPTER 6\nA LETTER TO IAN\n\nDiana told Mark about the girl screaming in the pond. She told Jenny about the girl in the graveyard. The girl Mark had not seen. She told about the face in the mirror. And about walking in her sleep and looking for something outside.\n\n“I don’t know how to explain it,” Diana said. “Maybe I am going out of my mind.”\n\nMark said quickly, “I don’t believe that. And don’t you believe it.”\n\n“We have been friends too long for me to believe any such thing,” Jenny said.\n\nDiana said, “Why did I dream about a pond? That was before I ever found out there once had been a pond here.”\n\n“There is a pond in that picture of Elizabeth Angus. You saw the picture the first night,” Jenny pointed out. “Maybe that is why you dreamed about a pond.”\n\n“That’s possible,” Diana said. “And maybe I didn’t really see a girl in the graveyard. The sun was in my eyes. The graveyard is dark with all those tall trees. Maybe the light played a trick on my eyes.”\n\nBut she didn’t really believe her words. Mark could see that, too.\n\n“But you still think it was something else, don’t you?” he said. “You think it was a ghost.”\n\n“Yes,” Diana said slowly. “Yes, I do.”\n\nJenny said, “Well, I don’t believe in ghosts.”"
        },
        {
          "pageNumber": 29,
          "text": "“I don’t either,” Mark said. “And it doesn’t have to be a ghost. It might just be this house. I think that some old houses hold on to their past. Past feelings, that is. A sad past can stay on. Or a happy one. That’s all there is to it.”\n\n“Maybe,” said Diana. “There are so many things no one knows for sure. But sometimes I have a strong feeling that there is someone here. Someone sad who needs help.”\n\n“What kind of help? Don’t you think you could make things worse by trying to help?” Mark said. “You could get hurt. You could be playing with fire.”\n\n“Maybe,” Diana said. “All I know is, I feel that someone is asking me to help.”\n\n“Diana, I want you to stop thinking about it,” Mark said. “The more you think about it, the more real it will seem. So put it out of your mind. For your own good.”\n\n“Mark is right,” Jenny said.\n\n“You think I am making all of this up,” Diana said in a cold voice. “You think I am going out of my mind.”\n\nMark said, “I think you don’t know if it is real or not. But I’m afraid you will talk yourself into it. We all do that kind of thing. Please don’t be angry. We only want to help you.”"
        },
        {
          "pageNumber": 30,
          "text": "“I know, Mark,” Diana said. “And you are right…I will try to do what Jenny did. When I see something strange, I will tell myself it isn’t happening.”\n\nAnd Diana really did mean to do that.\n\nMark left. He had to be at work early the next morning.\n\nDiana heard herself say, “I’ll go up now, Jenny. I must finish my letter.” There it was again. The letter to Ian.\n\nShe ran up the stairs before Jenny could question her.\n\nIn her room she said, “No, I will not think about it. I will not think about Ian or letters. Ian Mackenzie is dead. He died two hundred years ago.”\n\nShe got ready for bed. She put a chair in front of her door and got into bed. But she could not lie still.\n\nDiana walked up and down the room in the dark. She said, “I must get hold of myself. I will read for a while.”\n\nShe sat in the soft chair beside the table with the oil lamp. She tried reading a book. But the book did not interest her now.\n\nDiana got up and walked again. She stopped and looked at the big music box. Diana picked up the old box. She took it near the oil lamp to see it better.\n\nSuddenly she almost dropped the box. The bottom was loose. The bottom piece had started to slip off."
        },
        {
          "pageNumber": 31,
          "text": "She took off the bottom piece to see if she could fix it. Some sheets of paper spilled out.\n\n“A hiding place!” she said. “I must have touched the right spot to open it.”\n\nThe papers were stiff and hard to open. Diana was afraid she might tear them.\n\nShe was able to open one a little way. She saw the words: “When the war is over, I will stay in this new land. As soon as I am doing well, I will come for you. In a few years it won’t matter if your father is willing or not.”\n\nA few sheets of paper were not folded. Diana picked them up. She brought them close to the oil lamp.\n\nIt was a letter. “My dear Ian,” it began.\n\nA letter to Ian! Diana’s hands were shaking so much it was hard to read the letter. She had to sit down.\n\n“My dear Ian,” she read again.\n\n“So much has happened this day. The painting of me is finished at last. But, oh what trouble it caused!\n\n“I wore the gold locket you gave me while I was sitting for the painting. I wanted it to be in the picture.\n\n“I remember your last words before we parted. You said to wear the locket always and wait for you. Then I will know that we will meet again. When I look at your picture in it, I feel that we are together still."
        },
        {
          "pageNumber": 32,
          "text": "“I always wore the locket next to my heart, out of sight. But I wanted the locket to show in the painting. I did not think Father would notice it. But he did.\n\n“Today Father saw the painting for the first time. At first all he said was that the painter had done a fine job. Then Father saw the locket in the painting.\n\n“He asked why he had never seen it before. I had to tell him that you gave it to me. He was so angry.\n\n“He took the locket away from me. He threw it as far as he could. I saw it fall at the edge of the pond near a young tree. Father thought it had landed in the pond. He told me I would never see it or you again.\n\n“He doesn’t know he will never see me again. It is almost dark now. There is a storm. I can go out now to find the locket without being seen.\n\n“Then I will ride away from here. My Aunt Mary will hide me. I have always been her favorite.\n\n“When the war is over, I will join you as we planned. Now I will hide this letter so Father cannot find it while I am outside. I will finish it when I reach Aunt Mary’s home.”\n\nThat was all there was of the letter. Elizabeth had never finished it.\n\nDiana listened to the sound of the rain. It was raining hard now."
        },
        {
          "pageNumber": 33,
          "text": "“It must have been on a night like this,” she said. “Poor Elizabeth. But it doesn’t seem as if she wanted to kill herself. Far from it.”\n\nDiana put the pages of the letter back together. She put all the papers together. She would show them right away to Jenny. Her friend would have to believe her now.\n\nShe picked up a candle to take with her. But her hands were shaking. She dropped the candle on the pile of letters.\n\nThe papers caught on fire."
        }
      ]
    },
    {
      "title": "7 THE LOCKET",
      "pages": [
        {
          "pageNumber": 34,
          "text": "CHAPTER 7\nTHE LOCKET\n\nDiana had to keep the house from burning. There was no time to think or plan. She opened the window. She threw the papers out in the rain. Tears ran down her face.\n\nDiana lay down on the bed and had a long cry. At last she got up. She pushed the bottom of the music box in. It closed. She put the box away.\n\nShe lay in the dark for a long time. The storm was loud. Diana felt as stormy as the weather.\n\nFinally she fell asleep. At once she began to dream.\n\nShe was by a tree at the edge of the pond. It was a stormy night. She felt around on the grass. In a flash of lightning she saw something shining on the ground.\n\nShe half stood up and reached over for it. The grass was wet. She slipped.\n\nShe screamed as she fell into the pond.\n\nShe felt herself sinking.\n\nThe weeds were so thick that she couldn’t swim. She tried but she couldn’t.\n\n“Father,” she screamed. “Help me! Help me!”\n\nShe heard a voice from the front of the house. “Where are you, child? Oh, what have you done! If only I could see in this rain!”\n\nShe felt herself being pulled under the water.\n\nDiana woke up in bed shaking and cold. She lay in the dark with her eyes open for the rest of the night.\n\nIn the morning the sun was a welcome sight."
        },
        {
          "pageNumber": 35,
          "text": "She got up saying, “This can’t go on. Mark must help me. I can’t think clearly any more.”\n\nShe did not look forward to their talk. If only she had the letters to show him.\n\nShe decided not to talk to Jenny about it. Jenny was so matter of fact. Mark would understand better. She was afraid Jenny would go to her uncle. Mr. Lang might want to send her home. She couldn’t let that happen.\n\nThen she remembered the music box. She could show them the secret place. But she could not find the way to open it again.\n\n“Could I have dreamed all that?” she asked herself. “Was it all a dream?”\n\nMark did not show up all morning. Diana’s head hurt from not sleeping. She was cross all day. If only she could talk to Mark.\n\nShe spent most of the morning inside the house. Mr. Lang and Jenny had gone into town to buy some food. They had wanted her to come with them. But Diana had said no. She wanted to be by herself. She wanted some time to think about what was going on.\n\nThe old house was as quiet as a graveyard. But, still, from time to time Diana thought she heard a voice calling to her. Calling her name."
        },
        {
          "pageNumber": 36,
          "text": "She went into the hall and looked at the picture of Elizabeth Angus. The girl in the picture seemed to be looking right at her. Her eyes seemed to be asking Diana for help.\n\n“What do you want?” Diana said to the girl in the picture. “What do you want from me?”\n\nBut there was no answer.\n\nIn the late afternoon she went for a walk by herself. After a while she found herself near the graveyard. She decided to look at Elizabeth’s tombstone again.\n\nA man was already there. He was a thin old man. He looked tired but kind.\n\n“You must be Diana,” he said. “I am Parson Woodburn.”\n\n“How did you know who I am?” asked Diana.\n\nParson Woodburn said, “Oh, Mark has said a lot about you. Last night we talked a long time about your troubles. Mark looked so troubled when he came home that I made him sit down and talk about it.”\n\nFor some reason Diana found it easy to talk to him. She told him about the letters and about her dream. She told him about the letters burning.\n\n“What is it you are really afraid of?” the parson asked. “Do you think that all of this is just in your mind?”\n\nDiana said, “I don’t know which is worse. Is it better if it is all in my mind? Or if it is real?”\n\nThe parson shook his head. “Was there anything in the letters that you could not have dreamed?”"
        },
        {
          "pageNumber": 37,
          "text": "“I’ve been thinking so much about Elizabeth. I could have dreamed the letters and the music box. But it seemed very, very real,” Diana said. “I have to find the answer.”\n\n“I wish I knew how to help you,” the parson said. “I really do.”\n\nThey stood looking at Elizabeth’s tombstone. But there was no answer there.\n\nThe parson said, “You may never know the answer. But I do know one thing. You must stop getting mixed up in it right now. Or you will be hurt. Let it be.”\n\nHe was doing his best to help. Diana smiled her thanks. She did not tell him that she couldn’t let it be.\n\nThen she saw Mark by the church. She called to him.\n\nThe parson said, “I will leave you two together.” He left.\n\nDiana told Mark about the letters.\n\nMark said, “I hoped that this business was all over. You said you would not think about it any more. That you would let it be.”\n\n“I didn’t want to,” Diana said. “But then I found the letters. I had to read them. Mark, if Elizabeth is still here, why would she stay? What do you think?”\n\n“I’ve read books about things like this,” Mark said. “Elizabeth might not understand that she is dead. She would be very mixed up. She died thinking only of that locket. That’s all she can think of still. Maybe she never did think of anything besides herself and what she wanted.”"
        },
        {
          "pageNumber": 38,
          "text": "“You mean she was a person who thought only of herself?” Diana said.\n\n“We don’t know what kind of person she was. If she is here, she is using you to get what she wants. She has no power to hunt for the locket herself. She needs you for that. Time would have no meaning for her. For some reason she can’t make the break. She can’t stop thinking of the world of the living. So she can’t leave,” Mark said. “That is what people who believe in ghosts would say.”\n\n“You want me to think only of myself,” Diana said. “That is just as bad.”\n\n“I don’t want you to get hurt,” Mark said. “Let it be, Diana.”\n\n“Let it be! Let it be!” Diana said. “So it just goes on and on and never stops. And more people get hurt!”\n\n“The people who get hurt are the people who don’t let it be!” Mark shouted. “Can’t you see that? You are in the middle of forces no one understands. I believe in you, Diana. But I don’t want to believe in your strange dreams.”\n\n“You think I dreamed the letters then?” Diana said.\n\n“Oh, Diana, can’t you understand? If you don’t stop this, Elizabeth will take complete control of your mind. It won’t matter if a ghost is doing it. Or if you are doing it to yourself!” Mark said.\n\n“Mark, why are we getting so angry?” Diana said. “There is no reason to be angry.”"
        },
        {
          "pageNumber": 39,
          "text": "“Diana, don’t you know how much I care about you? And I am so afraid for you. But you won’t let me help you. You have to stop thinking about Elizabeth,” said Mark.\n\n“I can’t, Mark,” Diana said. “I can’t.”\n\nMark did not answer.\n\nHe turned and walked away. She knew by the way he walked that he was very angry.\n\nDiana wanted to call after him. The words would not come.\n\nMark did not look back."
        }
      ]
    },
    {
      "title": "8 THE BOG",
      "pages": [
        {
          "pageNumber": 40,
          "text": "CHAPTER 8\nTHE BOG\n\nDiana walked slowly toward the house. She reached the circle of trees and stopped.\n\nWhy not look for the locket now? There was not much hope of finding it. But she could try.\n\nShe remembered which tree she had walked to in her sleep. She found the tree. Then she got down and dug with her hands. The ground was soft. But the grass was thick.\n\nShe found a strong stick. That helped a little.\n\nShe dug and dug. All at once Diana felt something in her fingers. Something small. Something hard and round. She closed her hand around it and got up.\n\nSuddenly she saw someone was watching her. It was Jenny.\n\n“What are you doing?” Jenny asked, giving her a strange look.\n\n“Nothing…nothing,” Diana said, hiding the locket in her hand.\n\n“You had better come in the house now,” Jenny said. “It’s time for dinner.” Diana could see the worried look on Jenny’s face. Why had Diana been digging in the ground? Jenny was afraid that her friend was going out of her mind.\n\nDuring dinner Diana couldn’t keep her mind on what the others were saying. They talked to her. She hardly heard them. Once in a while she caught Jenny looking at her with worried eyes.\n\nSoon after dinner, Diana said she was going up to her room.\n\nMr. Lang asked, “Do you want us to call you when Mark comes?”\n\n“He won’t come tonight,” Diana said."
        },
        {
          "pageNumber": 41,
          "text": "“Of course he will,” Mr. Lang said.\n\nJenny looked at Diana. Diana looked away.\n\nIn her room she sat down in the big chair. She closed her eyes.\n\nOne part of her mind said, “I will go to bed. I’ll get a good night’s sleep.”\n\nAnother part said, “Wait here. Wait until it is safe to go. He is waiting for you. Your true love is waiting for you.”\n\nIt was late at night when she left her room.\n\nIn her hand was the old locket. It was covered with dirt. As she walked, she rubbed off the dirt.\n\nShe opened her hand. The locket was shining in the light of the moon.\n\nNow she was near the graveyard. “That is a place for the dead. I do not belong there. No matter what they say.”\n\nShe looked all around. Where was he?\n\n“Ian,” she called. “Here I am, Ian, my love. I have the locket. Now we can be together again. Where are you?”\n\nThere he was. Ian Mackenzie. Over to the left. By the bog.\n\nShe could see him clearly by the light of the moon. Ian Mackenzie was waiting for her.\n\nFar behind her she heard a voice. It was Jenny.\n\n“Diana! Where are you going. Oh, dear, you are walking in your sleep again. I followed you from the house. Diana! Stop!”\n\nThe voice did not mean anything to her. The name did not mean anything to her. Who was Diana? She was Elizabeth. Elizabeth Angus."
        },
        {
          "pageNumber": 42,
          "text": "She kept on walking toward the ghost of Ian Mackenzie. A ghost only she could see. He waited for her, smiling.\n\nThere was another voice. A man’s voice, from the graveyard. It was Mark.\n\n“Diana! Wait! I’ve been walking here all night. We will work things out together, Diana.”\n\nShe kept on walking. Mark’s voice and his words had no meaning for her.\n\n“Diana! Don’t go that way. Stop where you are!” Mark shouted. “You will sink in the bog!”\n\n“Oh, Mark, we can’t get to her in time!” said Jenny.\n\n“Go back and get a rope. Run as fast as you can,” Mark shouted. “She is walking into the bog. She will drown!”\n\nDiana kept going. She was close to the ghost of Ian now.\n\n“Come to me,” the ghost said. “I will lead you home, Elizabeth.”\n\nShe began to run to him.\n\nSuddenly she could not move her feet. She fell forward.\n\nShe began to sink into the bog.\n\n“Ian! Help me!” she screamed.\n\n“Diana, can you hear me? It’s Mark. I love you, Diana. I need you.”\n\nIan held out his arms. “Come to me, Elizabeth. Come to me.”\n\nAll at once she knew.\n\n“No, Ian!” Diana screamed. “No! I can’t! I’m not—” And then her mind was a blank.\n\nWhere was she? How did she get into the bog?\n\nShe remembered going up to her room after dinner. She did not remember anything after that. Nothing at all.\n\nWas this real? Or was she dreaming again?"
        },
        {
          "pageNumber": 43,
          "text": "By the light of the moon, she saw a man and a woman. They walked hand in hand over the bog. The woman was holding something in her hand—the locket. Then Diana couldn’t see them any more.\n\n“Diana! Can you hear me?”\n\n“Mark!” she screamed. “Oh, Mark!” She was sinking fast into the bog.\n\n“I can’t reach you,” Mark said. “Don’t move. That will only make it worse.”\n\n“Help me, Mark! Do something! Please!” Diana said. She could feel herself being pulled down into the bog.\n\nMark took off his tie and his belt. He tied them together. He held one end and threw the other toward her.\n\nShe tried to grab it several times. Each time she went down deeper into the bog.\n\nShe could hardly lift her arms now. But at last she caught it.\n\n“Hold on with both hands, Diana. It will break if I try to pull you out. But it will keep you from sinking as fast,” Mark said. He kept talking to her until Jenny came running with the rope.\n\nHe tied one end of the rope to the tie and belt.\n\n“Pull it toward you,” Mark said.\n\nDiana tied the rope under her arms. She held the rope with her hands.\n\nMark and Jenny pulled on it as hard as they could. Slowly they pulled Diana from the bog.\n\nJust in time. Another minute and she would have gone under and drowned."
        },
        {
          "pageNumber": 44,
          "text": "Mark held her in his arms. “It’s going to be all right now,” he said.\n\nDiana’s mind was still mixed up. “But, Mark,” she said. “What about the others? We must help them.”\n\n“The others?” Mark said.\n\n“A man and a woman. I don’t know who they are. I saw them walking on the bog. Didn’t you see them?” Diana said.\n\nMark said nothing for a minute. He looked out across the empty bog.\n\nThen he turned and looked into Diana’s eyes. “It’s all right, Diana,” he said. “It is done with. Elizabeth Angus and Ian Mackenzie are together again at last…Now it is time for us to begin, you and I.”"
        }
      ]
    }
  ]
}