{
  "id": "ghost-mountain",
  "title": "Ghost Mountain",
  "author": "Saddleback Educational Publishing",
  "coverImage": "/images/covers/ghost-mountain.svg",
  "lexileLevel": 150,
  "genre": "Fiction,Thrillers,Action and Adventure",
  "summary": "Luke Lawson is raising two couch potatoes, and that does not sit well with him. So he decides he’s going to toughen up his two boys, Winston and Nelson, with an adventure in the great outdoors. At first, the boys are grumpy and upset, but as they explore nature, they become more curious and interested in the world around them. And Winston experiences a life-changing event when he meets the ghost of a Native American teen and takes a mellow midnight ride on horseback.",
  "totalPages": 28,
  "chapters": [
    {
      "title": "Copyright Page",
      "pages": [
        {
          "pageNumber": 1,
          "text": "Body Switch\n\nKiller Flood\n\nClan Castles\n\nThe Lost House\n\nThe Code\n\nRacer\n\nFlyer\n\nSky Watchers\n\nFight School\n\nStanding by Emma\n\nThe Garden Troll\n\nStarstruck\n\nGhost Mountain\n\nStolen Treasure\n\nThe Gift\n\nThe Soldier\n\nThe Hero of Crow's Crossing\n\nZombies!\n\nI Am Underdog\n\nZuze and the Star\n\nWith more titles on the way …\n\nCopyright ©2014 by Saddleback Educational Publishing\n\nAll rights reserved. No part of this book may be reproduced in any form or by any means, electronic or mechanical, including photocopying, recording, scanning, or by any information storage and retrieval system, without the written permission of the publisher. SADDLEBACK EDUCATIONAL PUBLISHING and any associated logos are trademarks and/or registered trademarks of Saddleback Educational Publishing.\n\nISBN-13: 978-1-62250-897-6\n\nISBN-10: 1-62250-897-1\n\neBook: 978-1-63078-029-6\n\nPrinted in Guangzhou, China\n\n0000/CA00000000\n\n18 17 16 15 14 1 2 3 4 5"
        }
      ]
    },
    {
      "title": "MEET THE CHARACTERS",
      "pages": [
        {
          "pageNumber": 2,
          "text": "Age: 11\n\nFavorite Food: lamb stew\n\nBest Skills: shooting video game aliens and drawing with marker pens\n\nHis Dog’s Name: Smoky Joe\n\nBest Quality: can admit when he’s wrong\n\nAge: around 14 (when he died)\n\nFavorite Food: bighorn sheep stew\n\nBest Skills: shooting a bow and arrow and mixing paint colors from berries and leaves\n\nHis Horse’s Name: Floating Smoke\n\nBest Quality: friendliness"
        }
      ]
    },
    {
      "title": "1 MAN UP",
      "pages": [
        {
          "pageNumber": 3,
          "text": "1\nMAN UP\n\n“Winston Lawson,” Dad yelled in his big voice. “What're you doing, boy? You've been in that room for two hours.”\n\n“I'm playing a cool game, Dad,” Winston yelled back. “Doomscape. The alien warriors got us cornered. We got these new lasers. My friend from school is playing on his laptop too. But I'm helping our guys more.”\n\nWinston was eleven. He was in sixth grade. There was nothing he liked more than playing action games. He played on his laptop and cell phone.\n\n“The sun is shining out there,” Dad shouted. Dad never talked in a low voice. He talked loud. He talked very loud when he was angry. Like now. “Sun shining. Birds singing. Folks out on bikes. Jogging. Shooting hoops. Some of them walking their dogs. It's Saturday. No school. What're you doing playing silly games in yourroom?”\n\nDad swung open the door to his oldest son's room. “Hey, Winston, shut that thing off. Get moving!”\n\n“But, Dad,” Winston groaned. “We're in the middle of a game. I'm winning. The aliens are on the run.”\n\n“Shut that thing off. Get moving, boy. Or you're gonna be on the run from me,” Dad shouted again.\n\nMom came down the hall. “Oh, honey, give Winston a break. He's done all his chores. He's been doing his homework,” Mom said. “No harm in him having a little fun.” Mom was a lot nicer than Dad. Winston thought so anyway. He wished Dad was more like Mom."
        },
        {
          "pageNumber": 4,
          "text": "“Bella,” Dad said. “The boy likes adventure, right?”\n\n“Yes, he's playing his favorite adventure game,” Mom said. “It's called Doomscape.”\n\n“Yeah,” Winston said eagerly. He hoped Mom was winning Dad over. “It's really exciting.”\n\n“I like adventure too,” Dad said. “Adventure in the real world. Climbing hills. Meeting wildlife. Crawling over rocks. Getting sore and dirty. That's what we're doing today.” He pointed at Winston. “You. Me. And your brother, Nelson. I got the truck all packed. Sandwiches, fruit, cold drinks.”\n\n“Awww, Dad,” Winston groaned.\n\n“Come on, boy. Get your jeans on. Your hiking shoes. I just bought them for you. The great outdoors is calling,” Dad said. He walked down the hall to his younger son's room. “Nel! Nelson,” he shouted, knocking on the door. “What's up, boy?”\n\n“I'm sleeping,” Nelson said in a groggy voice. “It's Saturday. No school.” Nelson was eight years old. He was in third grade.\n\n“Sleeping? At this hour of the morning?” Dad yelled. “Up and at 'em, boy. We got big plans. You. Me. Winston. We're going to have an adventure. Put on your jeans. Your hiking shoes. You boys are going to man up today. And in a big way.”"
        }
      ]
    },
    {
      "title": "2 BUNNY ATTACK",
      "pages": [
        {
          "pageNumber": 5,
          "text": "2\nBUNNY ATTACK\n\nMom was in the hall behind Dad. “I'm worried. Boys as young as Winston and Nelson hiking in wild places. I mean, it can be dangerous in the hills. What with snakes and wild things. One little slip? You can be badly hurt. They're just little boys,” she said.\n\n“Bella, I went hiking with my dad. And my brothers. And my sisters in Arkansas when I was four years old! Four freakin' years old. We're raising wimpy couch potatoes. I won't stand for that. I want strong boys. Outdoor boys. With a feel for nature. I don't want them playing video games twenty-four seven. Hiding in their rooms. Sleeping away the day.”\n\n“Where are you taking them hiking?” Mom asked. She still looked worried. She grew up in the city. Mom's idea of wildlife was a chipmunk in the front yard. “I don't want the boys falling off a cliff. I don't want them attacked by wildlife.”\n\n“Bella, we're going to the Anza Borrego Desert. Nice easy trail. Maybe a couple bunnies. But I'll protect the boys if they attack. I mean, I know those bunnies got big teeth. But we'll be okay. I never heard of a bunny eating a boy.”\n\n“Now you're making fun of me,” Mom grumbled.\n\nLuke Lawson was a big, burly man. He looked a bit mean. But his eyes danced when he smiled. He looked jolly. Now, he grinned. And grabbed Mom. He swung her around."
        },
        {
          "pageNumber": 6,
          "text": "“Girl, I love those boys with all my heart. I'll bring them home safe and sound. Promise,” Dad said.\n\nWinston came slowly from his room. “I hate this,” he said.\n\n“That's too bad,” Dad said. “You know what I hate? I hate a boy of mine wasting his time on stupid video games. You know why I named you Winston?”\n\nWinston rolled his eyes. “Yeah, Dad. You told me a million times. Some fat, old English dude. Winston Churchill. Died a million years ago,” Winston said.\n\n“You just got an F in history,” Dad said. “Winston Churchill was a great man. He helped save the world from evil. And I named your brother for Nelson Mandela. Because Mandela suffered so much to bring freedom to his people. They were great men. They were active. They didn't waste their time playing stupid games. They were doers. These are your heroes. Not comic book freaks in video games.”\n\nAn hour later, the three of them were in the truck. They were heading east.\n\n“I hate these jeans,” Winston said. “They're stiff as boards.”\n\n“Yeah, mine too,” Nelson said. “And these shoes hurt my feet.”\n\n“What's the stupid place we're going to?” Winston asked.\n\n“The Anza Borrego Desert. And it's not stupid,” Dad said.\n\n“The desert?” Nelson said. “I bet there's a bunch of rattlesnakes out there. Just waiting for us.”\n\n“I hate snakes,” Winston said. “They make my skin crawl.”\n\n“They hate you too,” Dad said. “Snakes are more afraid people.”"
        },
        {
          "pageNumber": 7,
          "text": "“We'll die out there,” Nelson moaned. “I can see the story on TV. Three die in desert from snakebites.”"
        }
      ]
    },
    {
      "title": "3 COUCH POTATOES",
      "pages": [
        {
          "pageNumber": 8,
          "text": "3\nCOUCH POTATOES\n\n“It's hot in the desert,” Winston said. “People die in the heat. I'm sick already just thinking about it.”\n\n“It's only March,” Dad said. “It's not hot.”\n\n“There's nothing to eat out there,” Nelson said. “We'll starve.”\n\n“There's enough food in the ice chest to feed an army,” Dad said. “Man, this hike is overdue. You two are lazy whiners. You're soft, boys. You need to man up so bad.”\n\n“In the mountains, we could find wild berries. Or something,” Winston said.\n\n“Oh, we can find wild seeds. We can pound them into flour,” Dad said.\n\nThe boys looked grossed out. Their eyes were big.\n\n“I don't want to pound seeds into flour,” Nelson said.\n\nDad laughed. “We've got lots of food. We'll only be gone five or six hours. You can stuff yourselves. There are sandwiches and cookies.”\n\n“You mean we gotta hike for six hours? My feet hurt already in these ugly shoes,” Winston griped. “Dad! It'll kill us. We'll drop dead.”\n\n“We'll be hiking for an hour. Maybe,” Dad said. “If you can't make it back, you can piggyback down to the trailhead.”\n\n“I hate this so much,” Nelson said.\n\n“Know what I hate?” Dad yelled. “Whiny couch potatoes. In an hour from now, we'll be seeing great stuff. The Kumeyaay people used to live out here. They left beautiful art. They harvested berries. Made them into mush.”\n\n“What's mush?” Winston asked.\n\n“Like cereal. Like oatmeal. Sort of,” Dad said."
        },
        {
          "pageNumber": 9,
          "text": "“I hate oatmeal. I like pancakes. And syrup. And lots of butter,” Nelson said.\n\n“Yeah,” Dad said. “That's why you're putting on weight. Getting out of shape. Gotta do something about that. You guys need this hike. Toughen you up. Make you lean. I've been planning this for a long time.”\n\n“When will we get there?” Winston asked. “It seems like we've been driving forever. I'm thirsty too. You got something to drink in that cooler?”\n\n“We've been driving for an hour. And we'll be there in about forty minutes,” Dad said. “But I'm a nice guy. I'll pull over. Get you guys some cold orange juice.”\n\n“No soda pop?” Nelson asked.\n\n“You guys drink too much of that,” Dad growled. He pulled the truck off the highway. “Don't make me mad.” Then he got out of the truck. He went to the back. Then started looking in the ice chest.\n\nWinston turned to his brother. “I'm so bored!” he said.\n\n“Me too,” Nelson said. “I wish this horrible day was over. I hate this. And we got that hike ahead of us. My feet hurt just thinking about it.”\n\nWinston looked out the window. That's when he saw it. A huge snake. Right where Dad was standing. It was crawling out from behind a rock."
        }
      ]
    },
    {
      "title": "4 SNAKE!",
      "pages": [
        {
          "pageNumber": 10,
          "text": "4\nSNAKE!\n\n“Dad! Look out!” Winston shouted. “There's a snake by your foot!”\n\nDad jumped. The boys had never seen him jump so high.\n\n“Whoa,” he shouted.\"That's a rattlesnake there. Big fella too. Just woke up from a nap, I guess.” Dad looked up into the cab of the truck. “Good heads-up, Winston.”\n\n“Let's go home,” Winston groaned. “I knew there were snakes here.”\n\nDad laughed. He got three icy bottles of orange juice from the chest. “These will make us all feel better,” he said. He handed them the juice. Then he downed one himself. “That old snake wasn't rattling. He wasn't looking for trouble. Snakes are shy unless you surprise them.”\n\n“I hate snakes. I hate the desert too,” Nelson said.\n\n“Put a lid on it,” Dad said. “We got some miles to go. There will be a dirt road. That's the start of our trail.”\n\n“Dirt road?” Winston said. “What if we get stuck?”\n\n“Driving on a dirt road is gonna be awful,” Nelson said. “This is an old truck. We bounce on smooth pavement.”\n\n“Come on,” Dad said. “This is a pretty cool old truck. Thousands of miles on it. Still going strong.”\n\n“I could be home now. Playing video games. Chillin',” Winston said. “But I'm stuck here with dangerous snakes. Dad, this is cruelty to kids. I'm only eleven.”\n\n“What about me?” Nelson said. “I'm only eight!”"
        },
        {
          "pageNumber": 11,
          "text": "“Snap out of it! This is a little hike. One mile up. One mile back. Easy trail. Almost no slope. You won't even know you're climbing. Stop complaining. You'd think we were climbing Mount Everest,” Dad said.\n\n“Trailhead up there. There's the parking lot. We're here!” Dad sounded excited. “Everyone out.”\n\n“Nobody else is here. I don't see any cars,” Winston said. “Nobody else is crazy enough to come here.”\n\nA sign read Ghost Mountain Trail.\n\n“You know what that means,” Winston said. “This place is haunted. Ghosts! Boo!”\n\nDad laughed. “Ghosts only come out at night. We'll be gone before it gets dark.”\n\nNelson looked at several rocks. They had strange markings on them. They looked like bird's feet. “What's this stuff?” he asked.\n\n“Kumeyaay art. It's beautiful,” Dad said. “It's all over. Just look. Everywhere. You'll see different designs.”\n\nThe guys moved toward the trailhead. The boys had to admit it looked easy. There was hardly a slope. They started hiking.\n\n“Look at those weird rocks,” Nelson said. “They got round holes in them. What's with that?”\n\nDad pulled out his cell phone. He started taking pictures. “That's where the Kumeyaay folks pounded seeds into flour. Keep your eyes open, you guys. We're coming up on some really great art.”\n\nThere were black lines. They looked like stick figures.\n\n“What do the pictures mean?” Nelson asked."
        },
        {
          "pageNumber": 12,
          "text": "“Nobody knows,” Dad said. They passed a hillside. There were green agaves. Dad took more pictures. “The Kumeyaay people used agave for food, medicine, rope.”\n\n“Wow. Those pictures would be good for a school report,” Winston said. “My teacher would like that.”\n\nThe boys looked at each other. They frowned. They didn't want their dad to think they liked hiking. No way!\n\n“We're about to turn around. Head back,” Dad said.\n\n“That's it?” Winston asked.\n\n“Yeah,” Dad said. “Now that wasn't so bad. Was it?”\n\nThe boys didn't answer. The walk back seemed to go fast. Easier. They saw the truck.\n\n“Ready. Set. Go,” yelled Nelson. He took off. Winston was right behind him. He didn't want his little brother to win. He wanted to get back to the truck first.\n\nDad walked back to the truck. He was grinning. But he didn't say anything. He got out the ice chest. They all ate sandwiches. Then salad. And fruit. They drank iced tea.\n\nAfter eating, they climbed into the truck. It was time to go home.\n\n“We should be home before dark,” Dad said.\n\nThen it happened. The engine wouldn't start. Dad spent a few minutes looking at it. But he couldn't get it working.\n\n“The truck's dead,” Nelson cried. “We're sunk!”\n\n“Oh man,” Winston groaned. “Ghost Mountain. It's cursed. We should have known better. I knew it! I knew something bad would happen. We aren't going home.”"
        }
      ]
    },
    {
      "title": "5 ENJOY IT",
      "pages": [
        {
          "pageNumber": 13,
          "text": "5\nENJOY IT\n\n“Hold on,” Dad said. “Don't freak out, guys. This is just a little bump in the road.”\n\nHe called Mom on his cell phone. “Bella, we're having a little engine trouble. Nothing to worry about—”\n\n“The truck's dead. We're stuck! We're in the middle of nowhere,” Nelson shouted.\n\n“Don't pay any attention to him. It's all good, Bella. We had a great hike. The lunch was tasty. But I gotta call a tow truck,” Dad said calmly. He gave Nelson a dirty look. Put his finger to his lips.\n\n“Where are you?” Mom cried.\n\n“We're at the Ghost Mountain Trail. But don't worry. We'll be fine. We have plenty of food and water. A tow shouldn't take too long,” Dad said. “They can figure out what's wrong. Then we'll get on the road.”\n\n“Is the forest ranger there?” Mom asked.\n\n“No, this is just a little place,” Dad said. “Too small for a ranger.”\n\n“Just snakes,” Nelson hissed. He didn't want Mom to hear. Dad's phone picked up everything.\n\n“It'll be dark in a few hours.” Mom was worried.\n\n“Don't worry. Even if we have to stay the night. We came prepared. We got sleeping bags. We'll just sleep in the truck. Wait it out. It'll be an adventure. The sky is crazy clear. We'll stargaze. See the Milky Way. It'll be amazing.”"
        },
        {
          "pageNumber": 14,
          "text": "Winston knew his dad. Dad loved this stuff. Loved being outside. Loved camping. Maybe Dad did something to the truck. He rolled his eyes. Groaned. He would have to suck it up.\n\nDad said good-bye to Mom. He was all smiles. Then he called for a tow truck. The guy said they were swamped. They would get there after dawn.\n\n“You guys,” he said. “This is gonna be great. Something you'll remember.”\n\n“I don't want to be here in the dark,” Nelson cried.\n\n“Yeah,” Winston said. “What if some wild animals come?”\n\n“Or snakes,” Nelson said. “They'll bite us in our sleep. We'll die!”\n\n“Snakes don't crawl inside trucks,” Dad said. “They slither on the ground.”\n\n“I saw this movie. It was about a monster. It lived in the Anza Borrego Desert. Right around here. It was called the Sandman,” Nelson said. “It was huge. Its claw tracks were seven feet apart. It tore things to shreds.”\n\n“Movies aren't real. You're too old to believe that, Nelson. Mostly bighorn sheep around here. They don't bother anybody.”\n\n“I bet there are wolves. And wildcats,” Winston said.\n\n“Just calm down. Enjoy our adventure,” Dad said. “The sunset will be amazing. We can take pictures.”\n\n“Why do they call it Ghost Mountain?” Nelson asked.\n\n” 'Cause there are ghosts out here, Nel.” Winston grinned.\n\n“Knock it off,” Dad said.\n\n“I wish we were home,” Nelson said. “Mom was going to make pasta tonight. With meatballs. My favorite.”"
        },
        {
          "pageNumber": 15,
          "text": "“What about the big game? It's on tonight,” Winston said.\n\n“Come on,” Dad said. “Let's explore.”"
        }
      ]
    },
    {
      "title": "6 CAMP OUT",
      "pages": [
        {
          "pageNumber": 16,
          "text": "6\nCAMP OUT\n\nLater, it was time to unroll the sleeping bags.\n\nNelson climbed into the truck. He touched the first bag. “There's a snake! Right here in my sleeping bag. It's waiting for me to crawl inside.”\n\n“Bet it's one of those rattlers,” Winston said.\n\nDad jumped into the bed of the truck. He shoved Nelson away. Dad shook the bag. A large lizard appeared. It leaped off the truck. Then raced across the sand and disappeared.\n\n“Just a poor little lizard.” Dad laughed. “Shame on you. Making such a fuss over a lizard.”\n\n“Well, it looked like a snake,” Nelson said.\n\n“This trip was way overdue,” Dad said. “You kids need to toughen up. Big-time.”\n\nThe sun went down. The sky was red. Purple. Pink. The hills turned gold. Then the stars came out. More stars than the brothers had ever seen.\n\nNelson ruined the moment. “I can just taste Mom's dinner,” he whined.\n\n“I can smell her homemade apple pie,” Winston said.\n\nDad's phone rang. He picked up. The boys could tell who it was. Mom again. They could hear her voice loud and clear.\n\n“You guys okay?” she asked.\n\n“We're fine. We're eating those extra sandwiches you made. And we're having peanut butter cookies for dessert.”\n\n“Let me talk to the boys,” Mom said. Winston was first. “How are you doing, honey? I miss you so much.”\n\n“Oh, Mom. I wish we were home. It's awful here. Snakes and—”"
        },
        {
          "pageNumber": 17,
          "text": "Dad grabbed the phone. “No snakes, Bella. There was a lizard. These kids … I'm telling you. Our boys need this. Their brains are mush.”\n\nThe guys got into their sleeping bags. The truck bed was crowded. Dad was sound asleep first.\n\nWinston tapped Nelson. “You sleeping?”\n\n“No,” Nelson said. “I miss my bed.”\n\nThere was a humming sound. “What's that?” Winston asked.\n\n“A bug,” Nelson said. “Everything's bad out here. Probably got killer bugs too.”\n\nWinston sat up. Looked around. Then he saw a shape. It was near some rocks. He grabbed Nelson. “There's something out there! It's moving. By those rocks. I think it's coming this way.”\n\nBoth boys shoved their father hard.\n\n“Dad! Wake up!” Winston shouted. “I see something. Over there. And it's coming this way.”\n\nDad sat up. He grabbed a flashlight. Looked around the trailhead. “I don't see anything.”\n\n“Somebody is standing over there. Look by the rocks,” Winston cried.\n\nNelson chimed in, “What if it's the Sandman?”\n\n“I don't see anything. A couple cactus,” Dad said. “Come on. Go to sleep. You guys are driving me crazy!”"
        }
      ]
    },
    {
      "title": "7 BAD DREAM?",
      "pages": [
        {
          "pageNumber": 18,
          "text": "7\nBAD DREAM?\n\nAfter a few minutes, Nelson fell asleep. But Winston was wide-awake. He was sure he saw something. A dark figure. Moving around by the rocks. He was scared. But he had to check it out. He climbed silently out of the truck.\n\nWinston was shaking. But he walked toward the rocks. Then he saw the figure of a man. No, a boy. He looked older than Winston. Around fourteen. Not very tall. With long black hair. Tanned skin. Winston stared.\n\nThe boy whistled. A beautiful black and white horse came to him. The horse had no saddle. But the boy leaped on with no problem. Was he going to ride away? No. He stopped. He saw Winston.\n\nThe boy rode toward him. Winston froze. The boy raised his hand. Was it a greeting? He said nothing. He motioned to Winston. He wanted him to climb onto the horse.\n\nWinston had never ridden a horse before. He was scared. Horses seemed so big. So powerful. As the boy lowered his hand, Winston grabbed it. He allowed himself to be pulled up. Soon he was on the horse too. Sitting behind the boy.\n\nWinston held on for dear life. His heart was pounding. But he was so excited. He was riding across the desert on this beautiful horse. The fear slowly melted. Excitement took over."
        },
        {
          "pageNumber": 19,
          "text": "They rode into the dark hills. Across the sandy earth. A distant coyote howled at the full moon. There were bighorn sheep on a hillside. They did not seem bothered by the boys on the horse. A few rabbits dashed across the path.\n\nWinston was thrilled. This was better than the best video game. What a rush!"
        }
      ]
    },
    {
      "title": "8 RISE & SHINE",
      "pages": [
        {
          "pageNumber": 20,
          "text": "8\nRISE & SHINE\n\nFinally, they returned to the trailhead. Winston slid off the horse. The boy handed him a small, hard object. It was wrapped in cloth. Then the boy smiled. He rode away. Winston watched him go. Then he vanished into the dark hills.\n\nWinston stuffed the cloth in his pocket. He ran back to the pickup.\n\nBoth Dad and Nelson were still sleeping. Winston climbed into his own sleeping bag. But he couldn't sleep. He was wired. He stared at the stars. The sky turned pink with the coming dawn.\n\n“Okay, boys,” Dad said. “Time to rise and shine. Tow truck on the way. We'll be out of here soon. Maybe before sunrise.” Dad pointed to the sky. “See that bright speck? Know what that is?”\n\n“I guess an airplane. Or something,” Nelson said.\n\nDad laughed. “That's Venus. That's another reason you guys needed this hike. You're city boys who know nothing about nature.” Dad looked at Winston. “You're kinda quiet this morning.”\n\n“I'm just thinking about stuff,” Winston said. He didn't know what to say. How to tell Dad and Nelson about the night. So he said nothing.\n\nThe tow truck pulled in at six. The driver fixed the truck. They were out of there before seven. They traveled the same dirt road. Bump, bump, bump. But it seemed smoother. They were going home. That made a difference."
        },
        {
          "pageNumber": 21,
          "text": "They reached Scissors Crossing. Then headed for Julian. They stopped there for breakfast. Pancakes. Coffee for Dad. Milk for the boys. Everybody was hungry.\n\nA blonde waitress said, “So, you guys come from Ghost Mountain?”\n\n“Sure thing,” Dad said. “We had an adventure. And then some. Didn't we, boys?” He laughed. “We had engine trouble. Got to spend the night in our pickup.”\n\n“It's a great place,” she said. She looked at the boys. “You have a good time hiking with your dad?”\n\n“I'll be glad to get home,” Nelson said.\n\nThe waitress grinned. “Did you see the ghost?” she asked.\n\nWinston's head jerked up. “What ghost?”\n\n“The one the mountain is named for,” the waitress said. She looked at Winston. She winked. “I bet you saw him. There's a certain look you get. But only if you see him. It's in the eyes. I can tell. You got that look.”\n\nWinston laughed nervously. He just wasn't ready to talk about it. Maybe he never would be. He had felt so wild. So free. He had never felt that way. Until last night."
        },
        {
          "pageNumber": 22,
          "text": "The diner wasn't too busy. The waitress had a chance to chitchat. “There's a legend. Says there's a native boy out there. Out there in the desert. A ghost boy. He rides a ghost horse. But he's only seen at night. He died a long time ago. But his spirit rides the hills. Maybe during a full moon. Maybe he visits to make sure his mountain is being taken care of. Maybe he protects it. I don't know. But that's what they say.”\n\n“I like ghost stories,” Nelson said. “But to meet a real ghost? No thank you. I wouldn't want to. I'd be too scared.”"
        }
      ]
    },
    {
      "title": "9 IT WAS REAL",
      "pages": [
        {
          "pageNumber": 23,
          "text": "9\nIT WAS REAL\n\nThey finished their pancakes. Then headed out to the pickup for the ride home.\n\nDuring the drive, Dad turned to Winston. “You been real quiet this morning. You feeling okay?”\n\n“I'm okay,” Winston said. He still wasn't ready to talk.\n\n“Well, boys,” Dad said. “We're almost home. How did you like hiking? Hanging out with your dad? What's the verdict? You have a good time?”\n\n“My feet hurt. A lot. But it was okay,” Nelson said. “I liked seeing the stars. That was cool. I guess it was fun. I mean … I'm kinda proud of myself. I did it.”\n\n“Winston,” Dad said. “What do you say? Did our adventure take the shine off those video games?”\n\n“I guess so,” Winston said. “Um, I was scared. Sometimes. It wasn't comfy. Not like home. But, well, the games are fun. But they're not real. This was real. I mean,\n\nI feel good inside. Because we did it. And something else too, Dad. Um, that ghost? I sorta met him. Last night. When you two were asleep. It was awesome.”\n\nThere, Winston thought, I said it. I couldn't keep it a secret. Not forever. I don't care what anybody thinks. I had to say something.\n\nThere was silence in the truck. Dead silence.\n\n“What did you just say?” Dad asked. “I think I heard it. But I'm not sure. So tell me again. Please. And make it clear.”"
        },
        {
          "pageNumber": 24,
          "text": "“Last night,” Winston said slowly. “I knew I saw something. It was by the rocks.” He gulped. “I was scared. But I got out of the truck. I wanted a closer look. I walked slow. And then I saw him. A kid like me. Maybe older. Fourteen? Long black hair. He looked like he belonged there. He whistled. A black and white horse came.” Winston paused.\n\n“He, uh, saw me. He seemed okay. I went closer. He got up on the horse. Didn't have a saddle. He motioned to me. Seemed like he wanted me to ride with him. He pulled me up behind him. Then we rode off.”\n\n“Wow, Winston. You had some dream. Maybe it was something you ate? Hm, maybe the pickles. That's why you had that crazy dream,” Dad said.\n\n“It wasn't a dream, Dad,” Winston said. “It was real.”\n\n“It's like the waitress said. The ghost she talked about! Cool. You met him,” Nelson said. “Wow! I wish it had been me.”\n\nDad gave Nelson a playful shove. “Nah. I don't buy it. Neither should you, Nel. Don't let Winston pull our leg. It's a joke. Good one, son. Ha-ha. Wait till I tell your mom.” Dad laughed.\n\n“No joke, Dad,” Winston said. “Dead serious. It was the most thrilling thing. Ever. I can't believe it. I don't know who he was. I'm not saying he was the ghost. Maybe he wasn't. But something happened. It happened last night. And it was real.”"
        },
        {
          "pageNumber": 25,
          "text": "But Winston wasn't truly sure. Was it real? It could have been a dream. Right? The story was crazy. Wild. Impossible, really.\n\nSoon, they were home. They pulled into the driveway. Mom came running out. It was like she was watching for them. She hugged everyone.\n\n“Oh, you boys sure stink. I could smell you from the door. Get out of those dirty clothes. Go shower. I'll clean your stuff.” Then she sighed. “It's good to have all my men home.”"
        }
      ]
    },
    {
      "title": "10 SUNSET MOUNTAIN",
      "pages": [
        {
          "pageNumber": 26,
          "text": "10\nSUNSET MOUNTAIN\n\nAt dinner that night everybody talked. About the good. And the bad. About their hiking adventure. The snake. The lizard. The night sky. The stars.\n\nMom said the trip made dinner talk better. Before, the boys only talked about gaming. Now they talked about all sorts of things. Even their feelings.\n\n“Oh, Winston,” she said. “I almost forgot. The next level of Doomscape. That's your game. Right, honey? It's in the stores now. Should I buy it?”\n\n“Uh, hold off on that, Mom,” Winston said. “Let me think about it.”\n\nDad slapped his knee. Then laughed. “Hey there! Color me happy,” he shouted. “Didn't think I'd live to see the day.”\n\n“I'm getting older,” Winston said. “Next year, I'll be in middle school. Gaming seems lame. Sometimes. I don't know. Seems like they're for little kids.”\n\nNelson said, “Hey, Dad, where else can we hike? Do you know any other cool places? A tougher trail? Steeper? That one was sorta easy.”\n\n“Yeah,” Winston said. “We need a challenge. That was too simple.” Winston looked at his plate. He blushed. He felt bad because he had complained. Now he liked the idea of hiking. It was like nature was calling to him."
        },
        {
          "pageNumber": 27,
          "text": "“Oh, Winston. I forgot to tell you.” Mom started stacking plates. “Nelson, please take these to the kitchen.” Then she got up. She left the dining room. Winston and his dad gave each other a look. They didn't understand women. “Hang on,” she yelled from the down the hall.\n\nWhen she came back, she was carrying something. “While I was sorting laundry,” she said. “I found this in one of your pockets.” She handed Winston a small, hard object. It was wrapped in a piece of cloth.\n\nWinston's breath caught. His eyes got big. His hand shook. Then he took the object. How could he forget? But he had. It was from the boy. The boy from Ghost Mountain. He opened the cloth. There was a stone with beautiful markings on it. They were just like the ones at Ghost Mountain. The markings were the same!\n\nSo it wasn't a dream. It was real. Winston couldn't explain it. But it did happen. And he would never forget it. Not for as long as he lived.\n\nWinston looked at his father. “Dad, I'd like to go back to the Anza Borrego Desert. I want to hike again.”\n\n“You're on,” Dad said. “It's a big desert. I can't wait for you kids to see Sunset Mountain.”\n\n“Hold on a sec! This time I'm coming too,” Mom said. “You guys aren't keeping all the fun for yourselves. I want an adventure. Are girls allowed?”"
        },
        {
          "pageNumber": 28,
          "text": "“You bet girls are allowed,” Dad said. “Especially you, Bella.”\n\nWinston and Nelson exchanged a sappy look. Their parents were weird. Nelson made loud kissing sounds. That cracked up his big brother.\n\nWinston carried the stone to his bedroom. He put it in a special treasure box. His grandmother had given him the box. Inside were shells. From the Pacific. From the Atlantic. From the Sea of Cortez. There were also souvenirs from special places. This stone was the most special of all.\n\nWinston went to his window. He looked up at the sky. He had never done that before. Even in the city, he could see stars. He wanted to learn more. To know more. He grabbed a book from his desk. It has been there a long time. He started reading it."
        }
      ]
    }
  ]
}