{
  "id": "jungle-jenny",
  "title": "Jungle Jenny",
  "author": "Carlos Rivera",
  "coverImage": "/images/covers/jungle-jenny.jpg",
  "lexileLevel": 500,
  "genre": "Adventure",
  "summary": "When twelve-year-old Jenny wanders off a rainforest trail in Costa Rica, she must use everything she knows about nature to survive alone in the jungle and find her way back.",
  "totalPages": 15,
  "chapters": [
    {
      "title": "Lost",
      "pages": [
        {
          "pageNumber": 1,
          "text": "Jenny pressed her face against the van window. Outside, the Costa Rican jungle was a wall of green. Tall trees stretched toward the sky. Vines hung down like ropes. Flowers in red and orange dotted the shadows.\n\n\"Almost there,\" her dad said from the front seat. He was reading from a travel guide. \"The Monteverde Cloud Forest. One of the most amazing places on Earth.\"\n\nJenny's mom smiled. \"This is going to be the best part of our trip.\"\n\nJenny wasn't so sure. She liked reading about nature in books. She liked watching nature shows on TV. But actually walking through a jungle? With bugs and mud and who knows what else? That was different.\n\nThe van stopped at a wooden building with a green roof. A sign said WELCOME TO MONTEVERDE in big letters. Their guide was waiting outside. He was a tall man with a wide hat and a pair of binoculars around his neck.\n\n\"Welcome, welcome!\" he said. \"My name is Marco. Today, I will show you the heart of the rainforest.\"\n\nJenny grabbed her water bottle and stepped out of the van. The air hit her like a warm, wet blanket. It smelled like dirt and flowers and something sweet she couldn't name."
        },
        {
          "pageNumber": 2,
          "text": "The trail was narrow. Marco walked in front, pointing at things. Behind him came Jenny's parents, then two other families, then Jenny at the back.\n\n\"Look up,\" Marco said. \"See that? A resplendent quetzal. One of the most beautiful birds in the world.\"\n\nEveryone tilted their heads. Jenny saw a flash of green and red high in the branches. It was pretty, she had to admit.\n\nThey walked deeper into the forest. The trees grew thicker. The sunlight turned dim and golden, filtering through layers of leaves above. Marco talked about the different plants. He showed them a tree with roots that looked like stilts. He pointed out a tiny red frog sitting on a leaf.\n\n\"Poison dart frog,\" he said. \"Beautiful, but do not touch.\"\n\nJenny stayed a few steps behind the group. She was looking at everything. The moss on the tree trunks. The tiny streams that crossed the path. The way the light made the leaves glow.\n\nThen she saw it.\n\nA butterfly. Bright blue, the color of the sky on a perfect day. Its wings were as wide as her hand. It floated past her, just a few feet away, like it was showing off."
        },
        {
          "pageNumber": 3,
          "text": "Jenny had read about this butterfly. It was a blue morpho. She had seen pictures in her nature books, but the pictures didn't come close. The real thing was electric. It glowed.\n\nThe butterfly drifted to the left, away from the trail. Jenny took one step off the path. Then another. The butterfly floated ahead, landing on a leaf, opening and closing its wings slowly.\n\nJenny followed. She told herself she would only go a little way. Just close enough to get a good look. Maybe she could even take a picture with her mom's phone. But wait — she didn't have her mom's phone.\n\nThe butterfly lifted off again and glided deeper into the trees. Jenny kept following. The ground was soft under her sneakers. Ferns brushed against her legs. She ducked under a low branch.\n\nWhen the butterfly finally disappeared into the canopy above, Jenny stopped. She turned around.\n\nThe trail was gone.\n\nShe saw trees in every direction. Thick trunks covered in moss. Hanging vines. Green, green, and more green. Nothing looked familiar. Nothing looked like a path.\n\n\"Mom?\" she called. Her voice sounded small. \"Dad? Marco?\"\n\nThe jungle answered with the buzz of insects and the distant call of a bird.",
          "image": "/images/illustrations/jungle-jenny-1.jpg"
        },
        {
          "pageNumber": 4,
          "text": "Jenny's heart beat faster. She spun in a circle, looking for any sign of the trail. A footprint. A broken branch. Anything.\n\nNothing.\n\n\"Hello?\" she shouted louder. \"Can anyone hear me?\"\n\nA monkey screamed somewhere above her. Jenny jumped. She took a deep breath and tried to think.\n\nOkay. She was lost in the jungle. That was bad. But people knew she was here. Her parents would notice she was gone. Marco would come looking. She just had to stay calm.\n\nShe picked a direction and started walking. The ground sloped downhill. She stepped over roots that stuck up like fingers. She pushed through bushes with big waxy leaves. After ten minutes, she stopped.\n\nShe didn't know if she was going the right way. She could be walking deeper into the forest. She could be going in circles.\n\nJenny looked up. The sky was harder to see now through the thick canopy. But the light was changing. It was getting dimmer. More orange.\n\nThe sun was going down.\n\nA cold feeling spread through her chest. Night was coming. She was alone in the jungle. And no one knew where she was.\n\nJenny sat down on a fallen log. She wanted to cry. So she did, just for a minute. Then she wiped her eyes and stood up."
        },
        {
          "pageNumber": 5,
          "text": "\"Think, Jenny,\" she said out loud. Her voice sounded strange in the quiet forest. But hearing it made her feel a tiny bit better. Less alone.\n\nShe tried to remember what she had read in her nature books. What do you do when you're lost in the wild?\n\nRule number one: Don't panic. Okay. She had panicked a little. But she was done with that now.\n\nRule number two: Stay put if you can. Rescuers will look for you near where you were last seen.\n\nBut Jenny didn't know how far she had walked. She might be a long way from the trail.\n\nRule number three: Find water. If you have water, you can survive for days.\n\nWater. Yes. She still had her water bottle, but it was only half full. She needed to find more.\n\nJenny closed her eyes and listened. She heard birds calling. She heard the wind moving through the trees. She heard insects buzzing.\n\nAnd underneath all of that, she heard something else. A soft, steady sound. Like a whisper that didn't stop.\n\nRunning water.\n\nJenny opened her eyes. The sound was coming from somewhere to her right. She didn't know if it was close or far. But it was there.\n\nShe picked up her water bottle and started walking toward it."
        }
      ]
    },
    {
      "title": "Survival",
      "pages": [
        {
          "pageNumber": 6,
          "text": "The sound of water grew louder with every step. Jenny pushed through a wall of ferns and almost fell down a muddy bank. At the bottom, a stream flowed over smooth rocks. It was narrow enough to jump across, but the water was clear and fast.\n\nJenny knelt at the edge. She cupped her hands and splashed water on her face. It was cool and clean. She wanted to drink it right away, but she hesitated. Her nature book said that even clear water in the wild could make you sick.\n\nShe looked around. Big leaves shaped like elephant ears grew along the bank. She remembered reading that you could collect rainwater with large leaves. The water that fell from the sky was safer to drink than water from a stream.\n\nJenny picked one of the big leaves and bent the edges up to make a bowl. She set it on a flat rock near the stream. If it rained — and in a rainforest, it almost always rained — she would have safe water.\n\nFor now, she took small sips from her water bottle. She had to make it last.\n\nThe light was fading fast. The sky above the trees had turned from orange to purple. Soon it would be dark. Jenny needed a place to sleep."
        },
        {
          "pageNumber": 7,
          "text": "Jenny found a spot between two big tree roots that stuck up from the ground like walls. The space was just wide enough for her to lie down. She gathered fallen branches and leaned them against the roots to make a simple roof.\n\nThen she piled palm leaves on top of the branches. Layer after layer, like shingles on a house. It wasn't pretty, but it would keep some of the rain off.\n\nShe crawled inside her shelter. The ground was damp, so she laid more palm leaves down as a mat. She curled up on her side and hugged her water bottle to her chest.\n\nThe jungle got dark fast. Not like nighttime at home, where streetlights and house windows made everything glow. This was real dark. Deep dark. The kind of dark where you can't see your own hand.\n\nBut the jungle was not quiet.\n\nIt was the loudest place Jenny had ever been.\n\nFrogs started first. Hundreds of them, maybe thousands, all calling at once. High chirps and low croaks and strange clicking sounds. Then the insects joined in. A wall of buzzing and humming that seemed to come from everywhere.\n\nJenny pressed her hands over her ears. Her heart was pounding. She told herself it was just noise. Just animals doing what animals do at night."
        },
        {
          "pageNumber": 8,
          "text": "Then the howler monkeys started.\n\nThe sound was like nothing Jenny had ever heard. A deep, roaring growl that rolled through the trees. It sounded like a monster. It sounded like the jungle itself was angry.\n\nJenny squeezed her eyes shut. She knew what howler monkeys were. She had read about them. They were the loudest land animal in the world. They howled to mark their territory. They were not dangerous to people.\n\nBut knowing that and believing it in the pitch dark were two different things.\n\nSomething rustled in the bushes near her shelter. Jenny held her breath. She heard footsteps — soft, careful footsteps — moving through the leaves on the ground. Something was out there. Something bigger than a frog.\n\nThe footsteps stopped. Jenny didn't move. She didn't breathe.\n\nThen the footsteps moved away, slowly, getting quieter until they were gone.\n\nJenny let out her breath in a shaky rush. She was trembling all over. But she was okay. Whatever it was had left.\n\nShe lay in the dark and listened to the jungle sing its wild, scary song. She thought about her parents. They must be so worried. They were probably out there right now, looking for her with flashlights.\n\n\"I'm here,\" she whispered. \"I'm right here.\"",
          "image": "/images/illustrations/jungle-jenny-2.jpg"
        },
        {
          "pageNumber": 9,
          "text": "Jenny didn't think she would sleep. But at some point, the chorus of frogs became a kind of lullaby, and her eyes got heavy, and the next thing she knew, light was filtering through the gaps in her leaf roof.\n\nMorning.\n\nShe crawled out of the shelter and stretched. Her clothes were damp from the humidity. Her back was sore from sleeping on the ground. But she was alive. She had survived a night in the jungle.\n\nJenny checked her leaf bowl. It had rained during the night — she had slept right through it — and the leaf was full of water. She lifted it carefully and drank. The water was cool and tasted like nothing, which was perfect.\n\nShe refilled her water bottle from the leaf and set it out to collect more.\n\nHer stomach growled. She was hungry. She had not eaten since lunch yesterday. But she knew better than to eat random jungle plants. Some could be poisonous. She would have to wait.\n\nJenny walked to the stream and washed her face. The morning light made everything look different. Less scary. The trees were full of color — red flowers, yellow fungi, green moss in a hundred different shades. A blue butterfly floated past, and Jenny almost laughed.\n\n\"You got me into this,\" she told it."
        },
        {
          "pageNumber": 10,
          "text": "A loud squawk made Jenny look up. A toucan sat on a branch above her. Its beak was bright yellow and orange, almost too big for its body. It tilted its head and looked at her with a round black eye.\n\nThen it spread its wings and flew.\n\nJenny watched it go. And then she remembered something from one of her nature books. Toucans eat fruit. They fly toward fruit trees in the morning. And fruit trees often grow in clearings or at the edges of the forest, where there is more sunlight.\n\nIf she followed the toucan, it might lead her to an open area. And an open area might mean a road. Or a river. Or people.\n\nIt was a long shot. But it was better than sitting here and waiting.\n\nJenny grabbed her water bottle and started walking in the direction the toucan had flown. She followed the stream too, staying close to the water. Another rule she remembered: follow water downhill. Streams lead to rivers. Rivers lead to towns.\n\nThe jungle was thick, but the stream carved a path through it. Jenny hopped from rock to rock, ducking under branches, climbing over fallen logs. She moved slowly and carefully. She watched where she put her feet.\n\nThe sun rose higher. The air got hotter. Jenny kept walking."
        }
      ]
    },
    {
      "title": "Found",
      "pages": [
        {
          "pageNumber": 11,
          "text": "Jenny walked for what felt like hours. The stream got wider. Other small streams joined it, and soon it was more like a small river. The trees on either side started to thin out. More sunlight reached the ground.\n\nHer legs ached. Her sneakers were soaked and heavy with mud. Mosquito bites covered her arms. But she kept going. Every time she wanted to stop, she thought about her parents. She thought about her bed at the hotel. She thought about the plate of rice and beans she would eat when she got back.\n\nThe trees opened up ahead. Jenny pushed through one last wall of bushes and stumbled into a clearing.\n\nShe stood at the edge of a wide, brown river. The water moved slowly, carrying sticks and leaves downstream. On the other side, she could see a gravel road cutting through the trees.\n\nA road. An actual road.\n\nJenny's eyes filled with tears, but this time they were happy tears. She had done it. She had found her way out.\n\nBut the river was too wide to cross. And the current looked strong. She needed another way to get someone's attention.\n\nJenny looked up and down the river. To her left, about a hundred yards away, she saw something that made her heart jump. A small wooden dock."
        },
        {
          "pageNumber": 12,
          "text": "Jenny ran along the riverbank toward the dock. When she got closer, she saw that it was old and partly broken. But it meant that people came here. People used this dock.\n\nShe climbed onto the wooden planks and looked out at the river. Nothing. No boats. No people. Just water and trees and sky.\n\nShe needed to make herself visible. If a boat came by, the driver might not notice a small girl standing on a broken dock. She needed something bigger. Something that said HELP from far away.\n\nJenny looked at the gravel along the riverbank. There were rocks everywhere — gray, white, brown, all different sizes. She started picking them up and carrying them to a flat, muddy area near the water.\n\nShe laid the rocks out in the shape of a giant arrow. The arrow pointed toward the dock where she was standing. Each rock was as big as her fist. She made the arrow ten feet long so it could be seen from the river or even from the air.\n\nThen she gathered sticks and made a big X next to the arrow. She had read that an X was a universal signal for help.\n\nWhen she was done, she stood back and looked at her work. The white and gray rocks stood out against the dark mud. It was clear. It was obvious.\n\nNow she just had to wait."
        },
        {
          "pageNumber": 13,
          "text": "Jenny sat on the dock with her feet hanging over the water. She finished the last of her water bottle. The sun was high and hot. She splashed river water on her neck to cool down.\n\nShe tried not to think about how hungry she was. She tried not to think about what would happen if no one came.\n\nAn hour passed. Maybe two. Jenny watched the river. She watched a turtle slide off a log into the water. She watched dragonflies zip back and forth like tiny helicopters. She watched the clouds drift across the sky.\n\nThen she heard it. A low humming sound. It was coming from upstream.\n\nJenny stood up so fast she almost fell off the dock. She shaded her eyes with her hand and looked up the river.\n\nA boat. A small motorboat with a green and white stripe on the side. It was moving slowly, close to the bank.\n\nJenny jumped up and down. She waved her arms over her head. She screamed as loud as she could.\n\n\"HEY! OVER HERE! HELP! HELP ME!\"\n\nThe boat kept coming. It was getting closer. Had they seen her? Jenny waved harder. She pulled off her bright red shirt — she had a tank top underneath — and swung it in circles above her head.",
          "image": "/images/illustrations/jungle-jenny-3.jpg"
        },
        {
          "pageNumber": 14,
          "text": "The boat turned toward her.\n\nJenny's knees went weak with relief. She almost sat down right there on the dock. But she kept waving, kept shouting, until the boat pulled up alongside the old wooden planks.\n\nA woman in a green uniform and a wide hat reached out a hand. A park ranger. The patch on her shoulder said MONTEVERDE CONSERVATION.\n\n\"Jenny? Are you Jenny?\"\n\n\"Yes!\" Jenny grabbed the ranger's hand. \"That's me. I'm Jenny.\"\n\n\"Come aboard. Quickly now.\"\n\nJenny climbed into the boat. And there, sitting in the back, were her mom and dad.\n\nHer mom let out a sound that was half laugh, half sob. She pulled Jenny into a hug so tight that Jenny could barely breathe. Her dad wrapped his arms around both of them. His eyes were red.\n\n\"We thought — we were so scared —\" her mom couldn't finish the sentence.\n\n\"I'm okay,\" Jenny said. Her voice cracked. \"I'm okay, Mom. I'm here.\"\n\nHer dad pressed his face into her hair. \"Don't ever do that again,\" he whispered. \"Please. Don't ever do that again.\"\n\nJenny held on to her parents and cried. She wasn't scared anymore. She wasn't brave anymore. She was just a kid who missed her mom and dad."
        },
        {
          "pageNumber": 15,
          "text": "The ranger drove the boat downstream toward the reserve station. She gave Jenny a granola bar and a bottle of water. Jenny ate the granola bar in three bites. It was the best thing she had ever tasted.\n\n\"You were smart,\" the ranger said. \"Following the water. Making that signal with the rocks. A lot of adults wouldn't think of that.\"\n\n\"I read a lot of nature books,\" Jenny said quietly.\n\nThe ranger smiled. \"Well, those books saved your life.\"\n\nJenny looked back at the jungle as the boat moved down the river. The trees rose up like a green wall, thick and mysterious and alive. Somewhere in there was her little shelter made of branches and palm leaves. Somewhere in there was the stream where she had collected rainwater in a giant leaf. Somewhere in there was a blue morpho butterfly with wings like pieces of sky.\n\nThe jungle had scared her. It had tested her. It had made her cry and shake and feel more alone than she had ever felt.\n\nBut it had also shown her something. That she was stronger than she thought. That the things she learned from books could matter in the real world. That being scared didn't mean she couldn't be brave.\n\nJenny turned back to her parents. Her mom was still holding her hand.\n\n\"I want to come back someday,\" Jenny said. \"But next time, I'm bringing a better map.\""
        }
      ]
    }
  ]
}
