{
  "id": "little-big-top",
  "title": "Little Big Top",
  "author": "Doris Hiller",
  "coverImage": "/images/covers/little-big-top.jpg",
  "lexileLevel": 550,
  "genre": "Fiction",
  "summary": "When thirteen-year-old Luis lands a summer job at a small traveling circus, he discovers that the real show isn't just under the big top — it's the courage you find when the lights go out.",
  "totalPages": 20,
  "chapters": [
    {
      "title": "JOB HUNTING",
      "pages": [
        {
          "pageNumber": 1,
          "text": "The thing about being broke is that everything costs money. I know that sounds obvious, but you don't really get it until you're thirteen and your mom is working double shifts at the hospital and you're eating cereal for dinner three nights a week. Not the good cereal, either. The kind that comes in a bag instead of a box.\n\nMy name is Luis Delgado, and the summer before eighth grade was supposed to be the best one yet. My friend Marco had a pool. Jasmine was having a big birthday party in July. There was going to be a cookout on the Fourth. But all of that costs something — a swimsuit that fits, a birthday present, even just bus fare to get across town.\n\nSo instead of planning my summer fun, I was planning how to make money. I mowed lawns for two weeks until Mr. Gustafson's ancient mower broke down and he blamed me. I walked dogs, but the only dog I could find was a tiny mean one named Biscuit who bit my ankle every single time."
        },
        {
          "pageNumber": 2,
          "text": "I tried selling lemonade, which made me feel like I was six years old. I made four dollars and drank most of the lemonade myself. I was running out of ideas.\n\nThen one Tuesday morning, I saw the poster. It was stapled to a telephone pole on Oak Street, right next to a lost cat flyer and an ad for guitar lessons. The poster was bright red and yellow, with big curly letters:\n\nTHE LITTLE BIG TOP\nA TRAVELING CIRCUS OF WONDER\nSHOWS ALL WEEK AT THE FAIRGROUNDS\n\nAnd at the bottom, in smaller letters that changed everything:\n\nHELP WANTED — SEE MS. PEARL\n\nI stood there on the sidewalk, staring at those two words. Help wanted. I pulled the poster off the pole, folded it up, and stuck it in my back pocket. Then I started walking toward the fairgrounds.\n\nThe fairgrounds were on the edge of town, past the high school and the strip mall with the dollar store. I'd been there for the county fair every October, but in the summer, the place was usually empty. Not today.",
          "image": "/images/illustrations/little-big-top-1.jpg"
        },
        {
          "pageNumber": 3,
          "text": "Trucks and trailers were parked in a wide circle on the dusty field. People were hauling ropes, hammering stakes, and shouting directions at each other. In the middle of it all, a big striped tent was rising up like a slow balloon. It was red and white, a little faded, with patches sewn on here and there. It wasn't the biggest tent I'd ever seen, but there was something about it. It looked like it had stories to tell.\n\nI walked up to a guy carrying a coil of thick rope over his shoulder. \"I'm looking for Ms. Pearl?\"\n\nHe pointed with his chin toward a silver trailer near the entrance. \"Knock loud. She's probably on the phone.\"\n\nI knocked loud. The door swung open and I was looking up — way up — at the tallest woman I had ever met. Ms. Pearl had to be at least six foot three. She had short silver hair, dark brown skin, and earrings shaped like tiny trapeze artists. She looked down at me like she was deciding whether I was worth her time."
        },
        {
          "pageNumber": 4,
          "text": "\"You here about the job?\" she asked.\n\nI held up the poster. \"Yes, ma'am.\"\n\n\"How old are you?\"\n\n\"Thirteen.\"\n\nShe looked me over. \"You look strong enough. Can you carry a tray?\"\n\n\"Yes, ma'am.\"\n\n\"Can you shout?\"\n\n\"I — what?\"\n\n\"Shout. Yell. Project your voice so the folks in the back row can hear you over a brass band and three clowns on a unicycle.\" She raised one eyebrow. \"Can you do that?\"\n\nI didn't know if I could. But I knew I needed this job. I thought about my mom coming home at midnight with her feet hurting. I thought about cereal for dinner.\n\n\"Yes, ma'am,\" I said. \"I can do that.\"\n\nMs. Pearl smiled. It was a big smile, the kind that takes over a person's whole face. \"Good. I need a candy butcher. You start tomorrow morning, seven sharp. Don't be late. Circus people hate late.\"\n\nI had no idea what a candy butcher was. But I had a job.\n\nI practically ran home."
        }
      ]
    },
    {
      "title": "A CANDY BUTCHER",
      "pages": [
        {
          "pageNumber": 5,
          "text": "I showed up at 6:45 the next morning because Ms. Pearl said circus people hate late, and I wasn't going to test that on day one. The fairgrounds smelled different than they had the day before. Yesterday it was all dust and diesel fuel. Today it smelled like popcorn and hay and something sweet I couldn't name.\n\nA short guy with a buzz cut and a clipboard was waiting for me by the entrance. His name was Danny, and he was the head of what he called \"the front of house crew.\" That meant everyone who wasn't a performer — the ticket takers, the ushers, and people like me.\n\n\"So you're the new candy butcher,\" Danny said, looking at his clipboard. \"Ever done this before?\"\n\n\"I don't actually know what it is,\" I admitted.\n\nDanny laughed. \"Oldest job in the circus, kid. A candy butcher walks through the crowd selling snacks and drinks. Popcorn, peanuts, cotton candy, sodas. You carry a tray, you shout, and you make change fast. Think you can handle it?\"",
          "image": "/images/illustrations/little-big-top-2.jpg"
        },
        {
          "pageNumber": 6,
          "text": "\"Absolutely,\" I said, even though making change fast was not one of my strengths. Math was my worst subject.\n\nDanny led me to a supply trailer behind the big top. Inside, it was like a tiny store — boxes of popcorn bags, bags of peanuts, a cotton candy machine, and coolers full of soda cans. He handed me my uniform: a bright red vest with gold buttons and THE LITTLE BIG TOP stitched across the back in yellow thread.\n\n\"Put it on,\" Danny said.\n\nThe vest was a little big, but I buttoned it up and stood straight. Danny nodded and handed me the tray. It was wooden, painted red, with a thick strap that went around my neck. When he loaded it with bags of popcorn and peanuts, the strap dug into my shoulders.\n\n\"That's going to hurt at first,\" Danny said. \"You'll get used to it. Now let's practice your call.\"\n\n\"My call?\"\n\n\"Your sales pitch. What you shout to get people to buy. Every candy butcher has their own style.\""
        },
        {
          "pageNumber": 7,
          "text": "Danny showed me the basics. He cupped his hands around his mouth and belted out: \"POPCORN! PEANUTS! ICE-COLD SODA! GET YOUR TREATS RIGHT HERE!\" His voice bounced off the trailer walls and made my ears ring.\n\n\"Now you try,\" he said.\n\nMy first attempt was terrible. My voice cracked and I sounded like a scared mouse. Danny made me do it again. And again. By the tenth time, I was getting louder, but Danny shook his head.\n\n\"Louder isn't better,\" he said. \"You need to sound like you're having the best time of your life. Like those peanuts are the greatest peanuts on planet Earth. Nobody wants to buy snacks from a kid who sounds miserable.\"\n\nSo I tried again, this time with a grin on my face. \"POPCORN! PEANUTS! COTTON CANDY! COME AND GET IT!\" I added a little bounce, like I was so excited about the popcorn I could barely stand still.\n\nDanny grinned. \"There it is. That's your call, kid. Now let's go meet the rest of the crew.\""
        },
        {
          "pageNumber": 8,
          "text": "Danny walked me through the camp. The circus people were everywhere, getting ready for the afternoon show. I met Sal and Benny, the clown duo, who were practicing squirting each other with fake flowers. I met the Orlov Brothers, three muscular guys who did an acrobatics act. I met Graciela, who trained the poodles, and old Mr. Kim, who did magic tricks that made coins disappear.\n\nEveryone was friendly, but in a busy way. They said hello, shook my hand, and went right back to work. These people took their jobs seriously.\n\n\"First show is at two o'clock,\" Danny told me. \"You start selling thirty minutes before showtime. Walk through the crowd, hit every section. When the show starts, stand in the aisles. People get hungry during the acrobat act — don't ask me why. And never, ever walk in front of a performer during their act. Ms. Pearl will fire you on the spot.\"\n\nI nodded, trying to remember everything. My tray was heavy on my shoulders. My vest was itchy. And I had never been more excited in my life."
        }
      ]
    },
    {
      "title": "FATIMA FLAME",
      "pages": [
        {
          "pageNumber": 9,
          "text": "By Wednesday, I had the routine down. Show up early, load the tray, sell before the show, sell during the show, clean up after. My shoulders were sore from the tray, and my voice was scratchy from shouting, but I was making money. Real money. Ms. Pearl paid in cash at the end of each day, and I had already made more in three days than I'd made in two weeks of mowing lawns and walking Biscuit.\n\nBut the best part of the job wasn't the money. It was the show.\n\nEvery afternoon and evening, I got to watch the most amazing things I had ever seen. Sal and Benny made the whole tent shake with laughter. The Orlov Brothers flew through the air like they had wings. Graciela's poodles jumped through hoops and walked on their hind legs. Mr. Kim made a woman's watch disappear and then found it inside a sealed popcorn bag — one of mine.\n\nBut the act that stopped me cold, every single time, was Fatima Flame.",
          "image": "/images/illustrations/little-big-top-3.jpg"
        },
        {
          "pageNumber": 10,
          "text": "Fatima was the closing act, the star of the show. The lights would go down. A single drum would start beating, slow and deep. Then a spotlight would hit the center ring, and there she was.\n\nShe was tall, with long black hair pulled back tight. She wore a costume covered in tiny mirrors that caught the light and threw sparks of color across the tent. She didn't smile. She didn't wave. She just stood there, holding two long metal torches, and stared at the audience like she was daring them to look away.\n\nThen she lit the torches.\n\nThe fire leaped up, orange and blue, and Fatima began to move. She spun the torches in wide circles, faster and faster, until the flames made solid rings of light. She tossed them in the air and caught them behind her back. And then — the part that made the whole crowd gasp — she tilted her head back, opened her mouth, and lowered a flaming torch right past her lips.\n\nFire eating. Real fire eating. Every single time, I forgot to breathe."
        },
        {
          "pageNumber": 11,
          "text": "On Thursday morning, I got to the fairgrounds early and saw Fatima practicing behind the big top. She was working with a single torch, moving slowly, repeating the same motion over and over. Tilt, open, lower. Tilt, open, lower.\n\nI stood there watching, too nervous to say anything. But she spotted me.\n\n\"You're the candy butcher,\" she said. It wasn't a question.\n\n\"Yes, ma'am. I'm Luis.\"\n\n\"I know. I heard your call. It's good. You've got energy.\" She set down the torch and wiped her hands on a towel. \"You want to know how it works, don't you? The fire eating.\"\n\nI nodded. \"Doesn't it burn?\"\n\n\"It can. If you do it wrong, it absolutely will.\" She picked up the torch again. \"The trick is breath control. You exhale slowly when the torch goes in. The breath pushes the flame away from your skin. You never inhale — that would pull the fire into your lungs.\"\n\n\"That sounds terrifying,\" I said.\n\nFatima looked at me with those sharp dark eyes. \"The fire isn't the dangerous part,\" she said. \"Fear is.\""
        },
        {
          "pageNumber": 12,
          "text": "She explained what she meant. \"When you're afraid, your body tenses up. You hold your breath. You flinch. And that's when you get burned. The key is to stay calm, stay focused, and trust your training. Fear makes you do the wrong thing at the wrong time.\"\n\nI thought about that. It made sense, not just for fire eating, but for a lot of things.\n\nFatima sat down on an overturned bucket and drank from a water bottle. Up close, without the costume and the spotlight, she looked tired. There were dark circles under her eyes.\n\n\"How long have you been doing this?\" I asked.\n\n\"Twelve years. Started when I was nineteen.\" She looked around at the trailers and the dusty field. \"It's not a glamorous life, Luis. The pay isn't great. You live out of a trailer. You're always in a new town where you don't know anybody. Some weeks it rains and nobody comes to the show.\"\n\n\"So why do you do it?\"\n\nShe smiled for the first time. It changed her whole face. \"Because when I'm in that ring, with the fire in my hands and a thousand people holding their breath — there's nothing else like it in the world.\""
        }
      ]
    },
    {
      "title": "THE BIG SHOW",
      "pages": [
        {
          "pageNumber": 13,
          "text": "Saturday was the big day. Ms. Pearl had been talking about it all week. Saturday night was always the biggest crowd, the most energy, the best show. She wanted everything perfect.\n\nI showed up at six in the morning, two hours earlier than usual. The whole camp was buzzing. Danny had me stocking extra supplies — double the popcorn, triple the cotton candy, extra ice for the sodas. \"We're going to sell out tonight,\" he said. \"Saturday crowds are hungry.\"\n\nBy late afternoon, the fairgrounds were packed. Cars lined up along the road. Families streamed through the entrance with kids on their shoulders. I could hear the excited chatter from inside the supply trailer, and my heart started beating faster. This was going to be huge.\n\nI loaded my tray — it was heavier than ever — and headed into the crowd. \"POPCORN! PEANUTS! COTTON CANDY!\" I was selling bags as fast as I could hand them out. Kids tugged on their parents' sleeves, pointing at my tray. I made change, handed over snacks, and kept moving."
        },
        {
          "pageNumber": 14,
          "text": "The tent was full. Every seat taken, with people standing along the back wall. Ms. Pearl stepped into the center ring wearing a tall top hat and a coat with long tails. Her voice boomed through the speakers.\n\n\"Ladies and gentlemen! Boys and girls! Welcome to THE LITTLE BIG TOP!\"\n\nThe crowd roared. The show began.\n\nSal and Benny were on fire — not literally, that was Fatima's department. But their comedy was sharper than ever. Benny fell off the unicycle four times, and each fall got a bigger laugh. The Orlov Brothers did a new trick where one brother stood on the other two's shoulders and then did a backflip down. The crowd screamed.\n\nI sold popcorn through it all, but honestly, I was watching more than selling. This was the best show I'd ever seen. Mr. Kim made an entire table disappear. Graciela's poodles formed a pyramid. Everything was clicking.\n\nThen the lights went down for the final act. The drum started its slow beat. The spotlight found the center ring.\n\nFatima walked out, torches in hand. The crowd went silent.",
          "image": "/images/illustrations/little-big-top-4.jpg"
        },
        {
          "pageNumber": 15,
          "text": "She was halfway through her routine when it happened.\n\nFatima had just tossed both torches into the air, spinning end over end. She caught them perfectly, one in each hand. The crowd gasped. She was about to go into the fire-eating finale — the part where she eats the flame and then breathes out a stream of sparks.\n\nAnd then every light in the tent went out.\n\nNot just the spotlight. Everything. The overhead lights, the exit signs, the little bulbs strung along the tent poles. Total darkness, except for the two flames in Fatima's hands.\n\nFor one second, nobody moved. Then the murmuring started. Kids crying. People standing up. Someone shouted, \"What happened?\" A baby started wailing.\n\nI was standing in the aisle near the back, my tray still hanging from my neck. I could see Ms. Pearl in the dim glow of Fatima's torches, and even from thirty feet away, I could see the panic on her face.\n\n\"The generator,\" Danny said from somewhere behind me. His voice was tight. \"The main generator just died.\""
        },
        {
          "pageNumber": 16,
          "text": "People started heading for the exits. In the dark, with hundreds of people pushing toward the doors, it was getting dangerous. I could hear parents calling for their kids. Someone tripped over a chair.\n\nMs. Pearl grabbed a megaphone. \"Please stay calm, folks! We're going to get the lights back on! Just stay in your seats!\" But her voice shook, and the crowd wasn't listening.\n\nDanny was on his radio, calling for the maintenance crew. \"Where's Hector? Hector, come in! The main generator is down!\" Static. No answer.\n\nI stood there in the dark, my heart hammering. The tray was heavy on my shoulders. I could feel the panic spreading through the tent like a wave.\n\nAnd then I remembered something.\n\nTwo days ago, I had gone to the storage truck to get more popcorn bags. In the back, behind the boxes, I had seen something: a small red generator, about the size of a suitcase, with a tag that said BACKUP — EMERGENCY USE ONLY.\n\nI set my tray down on the nearest seat and started running."
        }
      ]
    },
    {
      "title": "UNDER THE LIGHTS",
      "pages": [
        {
          "pageNumber": 17,
          "text": "The storage truck was parked behind the big top. I ran through the dark, tripping over tent ropes and dodging equipment. I banged my shin on something metal and bit down on the pain. No time for that.\n\nI found the truck and yanked open the back doors. Inside, it was pitch black. I pulled out my phone — three percent battery, but the flashlight worked. I climbed in and shoved aside boxes of popcorn bags, stacks of paper cups, and rolls of tickets.\n\nThere it was. The red backup generator, sitting in the corner. It was smaller than I remembered, and it had a thick layer of dust on it. The tag was still attached: BACKUP — EMERGENCY USE ONLY.\n\nI tried to lift it. It was heavy — maybe sixty pounds. I could barely get it off the ground.\n\n\"Hey!\" I shouted into the dark. \"I need help! Someone help me!\"\n\nTwo crew members came running — a woman named Rita and a guy I only knew as Big Mike. \"The backup generator,\" I said, pointing. \"We can use this.\"\n\nBig Mike grabbed it like it weighed nothing."
        },
        {
          "pageNumber": 18,
          "text": "We hauled the generator to the power hookup behind the tent. Big Mike set it down and Rita started checking the connections. My phone died, so we were working by the glow of a flashlight Rita had on her keychain.\n\n\"Do you know how to start this thing?\" Rita asked Big Mike.\n\nHe shook his head. \"Hector's the generator guy.\"\n\nI looked at the machine. There was a fuel valve, a choke, and a pull cord, like a lawnmower. I had started Mr. Gustafson's lawnmower a hundred times before it broke down.\n\n\"I think I do,\" I said.\n\nI turned the fuel valve to OPEN. I set the choke to START. I grabbed the pull cord and yanked it hard. Nothing. I yanked again. The engine coughed. One more pull, putting everything I had into it.\n\nThe generator roared to life.\n\nRita plugged in the cables. For a second, nothing happened. Then, one by one, the lights inside the big top flickered back on. I heard the crowd react — cheering, clapping, laughing with relief. The most beautiful sound I had ever heard.",
          "image": "/images/illustrations/little-big-top-5.jpg"
        },
        {
          "pageNumber": 19,
          "text": "I ran back inside. The tent was glowing again. People were settling back into their seats, wiping their eyes, hugging their kids. Ms. Pearl was at the megaphone, her voice steady now. \"Thank you for your patience, folks. And now — the moment you've been waiting for!\"\n\nThe spotlight hit the center ring. Fatima was still there. She hadn't moved. She had been standing in the dark that whole time, holding her torches, waiting. The flames had burned low, but she calmly lit them fresh from a small fire pot at her feet.\n\nThen she performed the greatest fire-eating act I will ever see.\n\nMaybe it was the emotion of the moment. Maybe it was the crowd, who had been through something scary and needed something beautiful. But Fatima was electric. She spun fire like she was painting the air. She breathed sparks that floated up like orange stars. And when she tilted her head back and swallowed the flame, the whole tent erupted.\n\nStanding ovation. Every single person on their feet. Some people were crying. I was one of them, but I will deny that forever."
        },
        {
          "pageNumber": 20,
          "text": "After the show, Ms. Pearl found me outside the supply trailer. She was still in her ringmaster coat, but she had taken off the top hat. Her eyes were red.\n\n\"Luis Delgado,\" she said. \"You saved my show tonight.\"\n\n\"I just remembered the generator,\" I said.\n\nShe shook her head. \"You did more than that. You kept your head. You acted. Most people freeze when things go wrong. You ran toward the problem.\" She reached into her coat pocket and pulled out an envelope. \"Your pay for the week. Plus a bonus.\"\n\nI took the envelope. It was thick.\n\nFatima walked over, still in her mirror costume, her hair loose around her shoulders. She looked at me and nodded. Just a small nod, but it felt like a medal.\n\n\"You didn't let fear stop you,\" she said.\n\nI walked home under the stars, the envelope in my pocket and my red vest still on. My shoulders ached from the tray. My shin was bruised from the truck. I was exhausted.\n\nBut I was already thinking about tomorrow. Because the show must go on. And I was part of it now."
        }
      ]
    }
  ]
}
