{
  "id": "little-big-top",
  "title": "Little Big Top",
  "author": "Doris Hiller",
  "coverImage": "/images/covers/little-big-top.svg",
  "lexileLevel": 530,
  "genre": "Action,Adventure,BesTellers,Circus,Danger,Fiction,Jobs,Mystery,People of Color,Relationships,Suspense,Tension,Theft,Thrillers",
  "summary": "Blowing the show: That's what circus people call it when you leave before the season is over.  Ben Vincent won't blow the show. He likes to finish everything he starts.  He wants to become an acrobat, to fly high in the Big Top with the Great Zellinis. However, someone is at work to change his plans, to finish him before he flies in the little big top.",
  "totalPages": 42,
  "chapters": [
    {
      "title": "1 JOB HUNTING",
      "pages": [
        {
          "pageNumber": 1,
          "text": "CHAPTER 1\nJOB HUNTING\n\nPancho Cardoza stopped to buy a copy of the Miami Herald. Then he stopped again to have breakfast and read the paper. He ordered eggs and opened the paper to the want ads. Under “Help Wanted” he found these words:\n\nSEE THE COUNTRY! Small circus needs new acts and other help.\n\nToby Brothers Circus.…\n\nA telephone number was given, but Pancho didn’t take the time to call. When he finished eating, he got into his car and drove north of the city. He stopped at the place given in the ad.\n\nAs Pancho stopped the car he saw a high fence and a locked gate. There was a sign on the gate. He got out of the car to read it. It said: The Winter Home of the Toby Brothers Circus. Keep Out! This means you!\n\nPancho looked at the sign for a while, wondering what to do. Then he got back into his car and turned it around. He was about to drive away when a sports car stopped in front of him. A young woman with hair the color of a fire engine was in it. She waved at him.\n\n“Follow me!” she called. “Ill show you how to get in.”"
        },
        {
          "pageNumber": 2,
          "text": "She led the way to a side road and another gate. This one wasn’t locked. It didn’t need a lock to keep people out—there was a man standing in front of it with a tent stake in his hand. The man was so big the stake looked like a small stick. No one was going to get past that man without a very good reason.\n\nThe young woman stopped her car beside the giant, and his face broke into a smile. Pancho heard him say, “Miss Flame, it’s nice to see you again! How’s your mom?” The man’s voice was very soft.\n\n“You can ask her yourself in a few minutes, Tiny,” the woman said. “She’s driving our camper. She should be along pretty soon.”\n\nThen the little car raced past the man and up the road.\n\nPancho pulled up and stopped. He found himself looking up into the giant’s clear, blue eyes. The big man no longer seemed like someone Pancho had to be afraid of. Pancho was sure he wouldn’t hurt anyone. The tent stake he held was all an act.\n\n“I came to answer an ad in the paper,” Pancho said.\n\n“OK,” Tiny said. “You want to go to the office.” He pointed down a line of parked trucks and cars. “Go down to where that yellow camper is, then turn right.”"
        },
        {
          "pageNumber": 3,
          "text": "Pancho drove to where the yellow camper was and turned right. But he couldn’t see anything that looked like an office. He got out of his car and stood looking around. He saw cars and trucks of all shapes and sizes. He also saw a large circus tent about 60 feet across. The smell of animals—elephants, he guessed—was in the air.\n\nThe woman the giant had called Miss Flame came out of the tent. The morning sun made her hair as bright as fire. “What you’re looking for is in there,” she said, pointing to the tent.\n\nPancho gave her a questioning look.\n\n“You want the office,” she said. It wasn’t a question.\n\n“You must be a mind reader,” Pancho told her.\n\n“I am,” she answered with a smile. Then she walked away.\n\nPancho watched her until she was out of sight. Then he went inside the tent. He stopped three feet inside the opening.\n\nA few men were standing there. One of them turned to Pancho. “Looking for the office?” he asked.\n\n“Yes,” Pancho answered.\n\nThe man pointed across the tent. Pancho saw a number of people sitting on wood seats. In front of them, the ground was covered with sawdust. In the middle of the sawdust, a small circus ring had been set up. Inside the ring were three men dressed like clowns. On the side of the ring, a woman and two men stood waiting, dressed in the tight blue costumes of trapeze artists."
        },
        {
          "pageNumber": 4,
          "text": "“You want the man in the white hat,” the man said.\n\n“That’s the office?” Pancho said.\n\n“That’s Mr. Toby. The hat is his office. When you see that white hat, you’re looking at the office.”\n\n“Thanks,” Pancho said. Then he walked toward Toby. He took the long way, walking next to the side of the tent.\n\nAs he got close to where the people were sitting, Pancho began to understand what was going on. The people on chairs were looking at new acts. The people in costume were trying out for the circus.\n\nNo one seemed to see Pancho. He stood near the ring and watched. The clowns played tricks on each other, then ran in circles. They hit each other with funny sticks and fell down. They didn’t say a word, but everyone knew what they were doing. The people watching from the chairs laughed.\n\n“That’s real fine,” Mr. Toby, the man in the white hat, said. He was a fat man about 60 years old. “We always have room for good clowns.”\n\nThe next act was the acrobats. They did some tumbling, jumped on a trampoline, then worked with a pair of trapezes high off the ground. The woman in the act was not very big. One of the men wasn’t, either. But the second man was wide as a door. The others would swing through the air and the big man would always be there to catch them.\n\n“OK, that’s fine,” Toby said. “What are your names?”"
        },
        {
          "pageNumber": 5,
          "text": "The big man did the talking for the group. “We’re The Great Zellinis,” he said.\n\n“You’re all named Zellini?”\n\nThe big man smiled. “None of us is. I’m Walter Kelly, and they are Joe Wilson and Penny Fowler. Zellini just seemed like a better name for the act.”\n\nMr. Toby smiled and nodded. “I can understand that, Walter,” he said. “I don’t have a brother, but Toby Brothers Circus sounded better than Bill Toby’s Circus.”\n\nAs Pancho watched, he felt a hand on his arm. He turned and found himself face to face with a chimpanzee. The ape was wearing a dress and a hat with flowers on it.\n\n“Hello,” Pancho said.\n\nThe animal jumped into Pancho’s arms and began to rock back and forward. Soon everyone was looking at the chimpanzee.\n\nAnd at Pancho.\n\n“Are you here to try out?” Mr. Toby called to Pancho.\n\n“Who—me?” Pancho asked.\n\n“Yes, you,” Toby said. “I don’t talk to animals. Besides, that ape, Sally, is already with the show.”\n\nPancho walked over to Toby.\n\n“What can you do?” Toby asked.\n\n“I’m not sure,” Pancho said.\n\n“Well, come over here, then,” Toby said. “We can all find out together.”"
        }
      ]
    },
    {
      "title": "2 A CANDY BUTCHER",
      "pages": [
        {
          "pageNumber": 6,
          "text": "CHAPTER 2\nA CANDY BUTCHER\n\nPancho followed Toby to the ring.\n\n“You must have had some idea what you wanted to try out for before you came here,” Toby said.\n\nPancho nodded.\n\n“OK, what was it?”\n\n“I used to do a lot of trampoline work in school,” Pancho said. “I thought maybe I could be an acrobat.”\n\n“What made you change your mind?”\n\nPancho pointed to the three people who had just tried out. “The Great Zellinis,” he said. “They’re really good.”\n\n“Never mind that. Let’s see what you can do,” Toby said.\n\nPancho ran over to where a trampoline was set up. He kicked off his shoes and jumped on the trampoline. He jumped up and down a few times. Then he tried a few tricks. He threw himself forward and landed on his back. Then he bounced to his feet again. Next he turned a few somersaults in the air. He followed that with a giant jump to the ground.\n\n“That’s it? That’s all you can do?” Toby asked.\n\n“Yes,” Pancho answered.\n\n“That’s not very much,” Toby said.\n\n“No, I guess it isn’t,” Pancho answered. He started to put on his shoes again.\n\n“We can’t use you as an acrobat,” Toby said. “Are you willing to do something else?”\n\n“Like what?” Pancho wanted to know."
        },
        {
          "pageNumber": 7,
          "text": "“Like working at different jobs when we set up the tents and take them down. And maybe being a candy butcher during the show. Almost everyone with the circus has more than one job.”\n\n“What’s a candy butcher?” Pancho asked.\n\n“That’s someone who sells candy.”\n\nPancho nodded. “OK, that sure sounds fine to me.”\n\n“Then you have a job,” Toby said. “Go tell Tiny Tom you’re working for him.”\n\n“Who’s Tiny Tom?” Pancho asked.\n\n“He’s probably the first man you saw here. You can’t miss him. He stands almost 8 feet tall. Tiny is our tent boss. He sees to it that the tents get up in each new city and town we play in. He sees they’re taken down in the right way when we’re ready to leave. And he makes sure all tears in the tents are fixed as soon as they happen.”\n\n“OK, I’ll find him,” Pancho said. “And thanks again for the job.”\n\nPancho started to walk away. Then he heard steps behind him. Someone said, “Just a second.” It was Walter Kelly, the leader of The Great Zellinis.\n\n“Yes?” Pancho asked.\n\n“Do you really want to be an acrobat?” Walter Kelly asked.\n\n“I’d like to be, but I’m not good enough,” Pancho said.\n\n“That’s true, you’re not good enough now. But you could be. I was watching you. You have some very nice moves. You could be very good if you worked at it.”\n\nPancho smiled. “Thanks for saying so,” he said."
        },
        {
          "pageNumber": 8,
          "text": "“My friends and I work out every morning. We’ll do it all season. You’re welcome to work out with us if you want to,” Kelly said. “I think you could be a good flyer.”\n\n“A flyer?” Pancho said. “What’s that?”\n\n“It’s what I’m not,” Kelly said. “There are two kinds of trapeze artists—flyers and catchers. It’s the flyers who do all the wild moves in the air—turn somersaults and things like that. Catchers, like me, have to be strong enough to hold one or two people. I catch the others after they do their tricks.”\n\nBut the people watch the flyers, not the catchers, Pancho thought.\n\n“Do you work with a net?”\n\n“Yes, we do,” Walter said. “We believe in being safe.”\n\n“Good. So do I,” Pancho said. “How long do you think it will take me to become a flyer?”\n\n“You should be good enough by the end of the season,” Walter said. Then he added, “If you don’t blow the show.”\n\n“If I don’t blow the show?” Pancho said. “What’s that mean?”\n\n“That’s more circus talk. It means if you don’t leave before the season is over.”\n\n“Oh, I won’t do that,” Pancho said.\n\n“How can you be so sure? You haven’t worked a day yet.”\n\n“I’m sure,” Pancho said. “I like to finish everything I start.”"
        }
      ]
    },
    {
      "title": "3 FATIMA FLAME",
      "pages": [
        {
          "pageNumber": 9,
          "text": "CHAPTER 3\nFATIMA FLAME\n\nPancho went to the side gate. Tiny Tom was there, checking the people coming through. “Mr. Toby told me to tell you I’m working for you,” Pancho told him.\n\nThe big man smiled. “Good. A lot of work has been left until the last minute. I can use all the help I can get.”\n\n“Why do you wait until the last minute?” Pancho asked.\n\n“Because most of the work can’t be done until then. Is this your first time with a circus?”\n\n“Yes,” Pancho said.\n\n“I thought so. Don’t worry about it, though. We were all first of May at one time,” the big man said.\n\n“First of May? Is that more circus talk?”\n\n“Uh-huh,” the giant nodded. “It means new to the circus life.”\n\n“I guess I have a lot to learn—starting with a new way to talk,” Pancho said.\n\n“You’ll catch on,” Tiny said. “If you don’t blow the show. Er … that means.…”\n\n“I already know what that means,” Pancho said. “And I won’t.”\n\n“Good. Do you have a place to sleep?”\n\n“No.”\n\n“OK. Pick out a bed in the sleeping truck.” He pointed out a large truck with red paint on its sides. “You can have any bed that isn’t being used. Then go over to the cook tent and get something to eat. We’re going to the first stop on our tour tonight. You’ll be too busy to eat later.”"
        },
        {
          "pageNumber": 10,
          "text": "Pancho went to the sleeping truck and found himself a soft bed toward the back. Then he headed out for something to eat.\n\nWhen Pancho reached the cook tent, the woman with the red hair was already there. The cook gave Pancho a dish of meat and vegetables. The smell of the food made him more hungry than he had thought he was. He took his food and sat down across from the young woman.\n\n“Hi, I’m Pancho Cardoza,” he said. “What’s your name?”\n\n“They call me Fatima Flame,” she answered, smiling.\n\n“You didn’t fool me with that talk about being a mind reader,” Pancho said.\n\nShe looked up. “I didn’t?”\n\n“No. I know how you did it. You never saw me before, so I had to be new. That’s how you were sure I was looking for the office—for Mr. Toby.”\n\n“How did I know you wanted to come to the circus in the first place?”\n\n“I was sitting in my car by the locked gate. Where else would I have been going?”\n\nThe woman nodded. “I guess you could look at it that way,” she said.\n\nThey both ate without talking for a few minutes. Then the woman suddenly said, “Mr. Toby is on his way to the cook tent. He’s angry about something. Don’t talk to him or he’ll take it out on you. He’ll jump all over the first person who speaks to him.”"
        },
        {
          "pageNumber": 11,
          "text": "Pancho turned. He could see Mr. Toby coming toward the cook tent. But Toby didn’t look like he was mad about anything. Pancho turned back to the woman. She was starting to leave. He wanted to go with her. He wanted to talk to her some more. But he was too hungry to walk off and leave his food. “I’ll see you later,” Pancho said.\n\nShe smiled. “You can be sure of it,” she said.\n\nA man at another table pushed his chair back and stood up. He was a new worker, like Pancho. “Mr. Toby!” he called.\n\n“What do you want from me?” Toby half shouted. “Can’t you see I have things on my mind? Someone has been making Sally, the chimpanzee, afraid. Now she’s hiding in the back of her cage and won’t come out. I paid over $3,000 for that animal. I want her out where the people can see her. You haven’t been frightening her, have you?”\n\n“Oh, no, sir. No, sir,” the man said. He forgot what he wanted to talk to Toby about.\n\n“I hope you haven’t,” Toby said, blowing clouds of angry smoke from his cigar. “For your own good, I hope you haven’t.” Then he stormed away."
        },
        {
          "pageNumber": 12,
          "text": "Pancho finished eating, then headed back to find Tiny Tom. As he passed a large cage on wheels, he heard the chimpanzee. He stopped and looked into the cage. He could see the animal at the back of the cage, sitting on her box of toys. She was making strange noises.\n\n“What’s the matter, Sally?” he called in a low voice.\n\nAt the sound, the animal stopped making noises.\n\nPancho kept talking, keeping his voice soft and low. Soon Sally came from the back of the cage. She came close to him. He reached inside and rubbed her back. When he started to pull away, she caught his arm. She didn’t want him to go, and she was very strong.\n\n“Let go, Sally,” Pancho said. “I’ll be back. We’re friends now. And when I find out who’s been mean to you, I’ll take care of it.”\n\nIt was almost as though Sally could understand. She let go of Pancho’s arm and watched him leave. And when he was gone, she didn’t hide in the back of her cage again."
        }
      ]
    },
    {
      "title": "4 FIRST OF MAY",
      "pages": [
        {
          "pageNumber": 13,
          "text": "CHAPTER 4\nFIRST OF MAY\n\nTiny had a group of workers standing around him at the side gate.\n\n“Most of you are first of May,” he said. “So watch real close. Listen to everything I say. Remember everything I do. We have to take down all the large tents. Then, after we drive 100 miles to our first show stop, we have to set up the circus on a new lot. If you live to be a thousand, you’ll never work more than you will tonight.”\n\nTiny Tom looked over the workers. Then he pointed to Pancho. “Stay close to me,” he said. “You’ve got bright eyes. You look like you learn fast.”\n\n“OK,” Pancho said.\n\nA deep voice spoke from the group of workers. “So you got yourself a new second man, huh Tiny? You might as well not bother yourself with him. He’ll blow the show before you can say bye-bye, baby.”\n\nMatt Murphy was the one who spoke. He was a tent worker who had been around for a few seasons. For one season he had been Tiny Tom’s second man. He was big, with a red face and long arms. He was dirty and wore torn clothes.\n\n“Don’t listen to him, Pancho,” said Tiny Tom. “Just another wise guy.” When Murphy walked away, Tiny spoke to the workers again. “Sometimes we put the tents close together. Sometimes we put them far apart. That’s because all lots aren’t the same size.”\n\nPancho and the others nodded."
        },
        {
          "pageNumber": 14,
          "text": "“We don’t do anything with the small tents and stands you see around the circus. They don’t belong to Mr. Toby. We just put up and take down the big tents. There are two of them besides the cook tent. One of them is the Big Top. That’s already in one of the trucks. The other one is over there.” He pointed to the tent where Pancho had found the “office.”\n\n“That one is used for the Side Show. We put it up to the left of the Big Top. But, the Big Top is our most important job. And we always have to remember to leave lots of room behind it.”\n\n“Why is that?” Pancho asked.\n\n“Because the space behind the Big Top is where the circus people live. That’s where we put the cook tent. And that’s where we park all the cars and trucks. The back door of the Big Top is there, too. And that’s where all the acts go in and out. The front door is only for the people who pay money.”\n\nWhen the talk was over, the crew took down the Side Show tent. With Tiny Tom standing in the center shouting orders, it was easy. Everyone helped put the tent on one of the circus trucks. Then they started out.\n\nAlong the way, Mr. Toby had nailed small signs to poles and trees. All the workers had to do was follow the signs. No one could get lost."
        },
        {
          "pageNumber": 15,
          "text": "By five in the morning, the trucks had stopped in the new town and the tents had been set up. The circus elephants had done most of the heavy work, like pulling the ropes to raise the tents. Still, Pancho was tired. The sky was turning pink. Soon the sun would be up.\n\nIt seemed to Pancho he had just closed his eyes in the sleeping truck when Walter Kelly was talking to him. “Time to get up,” Walter said. “The Great Zellinis are about to work on their act.”\n\nPancho pulled himself out of bed. “What time is it?”\n\n“It’s seven o’clock already,” Walter said.\n\n“Is that all?”\n\n“Joe and Penny and I have been working for an hour.”\n\nPancho went with Walter. He met Joe Wilson and Penny Fowler and worked out with them. He learned how to hold the trapeze and keep his mind on swinging through the air. The Zellinis were good teachers. He was sure he would learn a lot in the weeks to come.\n\nThen he went back to the sleeping truck for more rest. But at noon he was on his way to the cook tent. He had to eat then, since the first show of the day was at one o’clock. Once it began, he would be too busy selling candy to eat."
        },
        {
          "pageNumber": 16,
          "text": "Tiny Tom was in the cook tent when Pancho got there. Pancho sat at his table. They talked about their work until Pancho saw the woman with the red hair again.\n\nHe pointed her out to Tiny Tom. “There’s Fatima,” Pancho said. “Do you know if that’s her real name?”\n\n“Of course not. That’s her circus name. Her real name is Judy Saunders. She works in the Side Show with her mother.”\n\n“Has she been with the circus long?” Pancho asked.\n\n“Three years, at least,” Tiny said. “That’s how long I’ve been with this circus. Before that, I can’t say. Why do you ask?”\n\n“She’s very nice to me,” Pancho said.\n\n“Is there any other reason?”\n\n“Yes. She says she can read minds. It’s a trick, of course. But I can’t be sure how she pulls it off.”\n\n“You think it’s a trick, do you?”\n\n“Sure, don’t you?” Pancho asked.\n\n“I used to think so. Now I’m not sure,” Tiny said. “I once heard her say good-bye to a man like he was going away. The next day he suddenly left the show. Either she can read minds or she’s a real smart woman. Maybe both. One thing’s for sure, she keeps her eyes open. Fatima doesn’t miss a thing.”\n\nThey finished eating and headed toward the Big Top. Tiny was going to teach Pancho what he had to know to be a good candy butcher.\n\nWhen they turned a corner, Mr. Toby was coming toward them."
        },
        {
          "pageNumber": 17,
          "text": "“Oh, oh!” Tiny said. “Mr. Toby is mad about something.”\n\n“How do you know?” Pancho asked.\n\n“When the show is on the road, you only see him on the back lot if something’s wrong. Besides, he’s smoking. The only time he smokes is when he’s angry.”\n\nSo that’s how she knew, Pancho thought. He was remembering the time Fatima Flame had known Mr. Toby was angry.\n\nHe didn’t get to remember any more, though. Mr. Toby had reached them.\n\nToby took his cigar out of his mouth and looked up at Tiny. “The bear is loose!” he said. Then he walked away fast."
        }
      ]
    },
    {
      "title": "5 THE BEAR Is LOOSE!",
      "pages": [
        {
          "pageNumber": 18,
          "text": "CHAPTER 5\nTHE BEAR Is LOOSE!\n\n“Will it hurt someone?” Pancho asked. “What kind of bear is it?”\n\n“We don’t have a bear with the show,” Tiny said. “Not the kind you’re thinking of.”\n\n“Oh? What was that, then—more circus talk?”\n\n“That’s right. It means someone is stealing. There’s a thief on the lot.”\n\nPancho had more questions, but they would have to wait. When the show was over, Tiny told him everyone who wasn’t working would meet at the cook tent to talk.\n\n“How can you be so sure?” Pancho said, asking another question anyway.\n\n“Because that’s the way it is with circus people. We always stick together when things go wrong. We work together. As soon as word gets out, we all meet. This time we’ll meet at the cook tent, because the trouble is everyone’s problem.”\n\nAnd it was just as Tiny Tom had said. After the show, everyone who didn’t have to work turned up at the cook tent. There wasn’t enough room inside for everyone, so a few people rolled up the sides of the tent and sat right outside.\n\nMr. Toby climbed on a chair to talk. “I guess you’ve all heard by now—the bear is loose!”\n\nThere was angry talk from the crowd.\n\n“It happened this morning,” he went on. “Someone got into Jack Gower’s camper while he was out. The door was locked. The person must have come through the roof opening. Jack came back and found his watch was gone.”"
        },
        {
          "pageNumber": 19,
          "text": "There were more angry sounds from the crowd.\n\n“Now, we can’t have any more of this,” Toby said. “We live too close to each other. We have to be able to trust each other. I want the person who took Jack’s watch to give it back. All that person has to do is leave it where someone can find it. Once the watch is returned, that will be the end of it.”\n\n“I think we can find out who the thief is,” someone called from the crowd. It was Matt Murphy.\n\n“What do you mean?” Toby asked.\n\n“I mean, the bear wasn’t loose last season,” Murphy said. “It’s only now, the first day of the new season, that the bear is loose. The bear has to be one of the first of May.”\n\n“There are a lot of new people this season,” Mr. Toby said.\n\n“How many of them are acrobats?” Murphy asked. “The person who went through Jack Gower’s roof opening had to be strong and quick to drop inside and then climb out. How many first of May’s could do that?”\n\n“Not many,” Mr. Toby said slowly.\n\nSuddenly, everyone was looking at Pancho.\n\n“You got anything to say?” Toby asked him.\n\nPancho shook his head. “What can I say?”\n\n“You can tell us where you were when the watch was taken,” Mr. Toby said.\n\n“I don’t know where I was,” Pancho said. “When was it taken?”"
        },
        {
          "pageNumber": 20,
          "text": "“Jack went to the cook tent at ten. When he got back to his camper a half-hour later, the watch was gone,” Mr. Toby said.\n\nPancho rubbed his ear.\n\nMatt Murphy pushed his way through the crowd. He stopped in front of Pancho. “Well?” Murphy said. “Now you know when the thief took the watch. Where were you?”\n\n“I was sleeping,” Pancho said.\n\n“Did anyone see you?” Murphy asked.\n\n“How should I know? I said I was sleeping.”\n\n“That’s not good enough!” Murphy said. “Maybe you better get off the lot before you get hurt.”\n\n“Just a minute!” Mr. Toby broke in. “I run this show. I’m the one who throws people off the lot. Not you, Murphy.”\n\n“I just thought that since he’s the thief—”\n\n“We don’t know that,” Toby said. “It looks that way, but we can’t be sure. Yet. If we ever are sure, I’ll be the one to send him away. There are too many people blowing the show on their own for me to fire someone without cause.”\n\nToby spoke to the crowd. “OK, you can all go about your business again.”\n\nIn the weeks that followed, the circus was in a new town almost every day. And only Tiny Tom and The Great Zellinis would speak to Pancho.\n\nTiny talked to him only because he had to work with him. It was clear that Murphy had been trying to convince Tiny that Pancho was the thief."
        },
        {
          "pageNumber": 21,
          "text": "The Great Zellinis spoke to Pancho because they knew how tired he had been after working out with them the morning the watch was taken. And they didn’t stop working out with him every morning.\n\nEveryone else went to a lot of trouble to stay away from him. Only Sally, the chimpanzee, was always glad to see him. She would race along the ground to him. Or sit in his arms, rocking.\n\nThen one afternoon, after the one o’clock show, Pancho saw Fatima Flame walking toward him. She didn’t turn away when she saw him.\n\n“Hello, Judy,” Pancho said.\n\n“Hello,” she answered, stopping beside him.\n\n“I’m glad to see you’ll still talk to me,” he said.\n\n“Why not?” She looked deep into his eyes. “You’re not the thief.” Then she asked, “How did you know my real name?”\n\n“I asked Tiny Tom when we were still talking about things besides work. He told me. He said Fatima Flame is your circus name. And Judy Saunders is your real name.”\n\nShe smiled. “That’s right.”\n\n“Do you want me to tell you my real name?” Pancho asked. He was joking.\n\n“No,” she answered.\n\n“Why not?”\n\n“Because I know your real name’s the one you use,” she said. “I’m a mind reader, remember. I can tell what’s real and what isn’t real.” Then she smiled again and walked away."
        }
      ]
    },
    {
      "title": "6 A NEW TENT BOSS",
      "pages": [
        {
          "pageNumber": 22,
          "text": "CHAPTER 6\nA NEW TENT BOSS\n\nThree months went by, and nothing new was taken. Pancho was glad of that. He hoped people would forget the charges Matt Murphy had made.\n\nPancho was heading for the sleeping truck. It was early morning. He had just finished helping put up the Big Top. Sally, the chimpanzee, came running toward him, screaming in the frightened way she had. She threw herself at Pancho and hung on.\n\nPancho often saw Sally walking around the circus lot. She always ran free during the day. She was only locked up at night. Mr. Toby knew she would never run away. Besides, people liked to see her walking around in her little dresses.\n\nBut this morning Sally was very afraid.\n\n“Take it easy, Sally,” Pancho said in a low voice. “You have nothing to be afraid of. I’ll take care of you.” He held her and rubbed her back the way she liked.\n\nShe stopped screaming and rested against him. He was about to put her down when Matt Murphy showed up. He stepped from between two trucks, and Sally started screaming again.\n\nPancho held her with more force, but it didn’t help much. He could feel her heart beating against his chest. She was afraid, more afraid than he had ever seen her. No one, not even an animal, should have to be that afraid. It made Pancho angry."
        },
        {
          "pageNumber": 23,
          "text": "Pancho stepped in front of Murphy. “What have you been doing to Sally?” he asked. “Why is she so afraid?”\n\n“I’ve got nothing to say to you,” Murphy said. His eyes were filled with hate.\n\nPancho wanted to put Sally down and smash Murphy, but he couldn’t. The ape was too strong, and she wouldn’t let go. All Pancho could do was hold her and watch Murphy walk away.\n\nAfter Murphy had gone about 30 feet, he turned. “If you’re so interested in questions and answers, come to the cook tent after the first show. There’ll be a meeting,” he called.\n\n“A meeting?” Pancho said. He was almost afraid to ask, but he did. “What about?”\n\n“Ha!” Murphy laughed, but it was clear he didn’t think anything was funny. “As if you didn’t know.”\n\nPancho had to hold Sally a long time after Murphy was gone. Patting her, he stepped back out of the way and stood between two campers. He and Sally could not be seen unless someone looked out a window. That’s how he happened to hear the people talking inside one of the campers.\n\n“There’s a meeting at the cook tent after the first show,” a woman said.\n\n“How come?” a man asked.\n\n“The bear is loose again,” she told him. “This time Murphy’s really got it in for that thief Pancho.”"
        },
        {
          "pageNumber": 24,
          "text": "The man laughed. “Matt really wants Pancho out of here, doesn’t he? He’s afraid Pancho will get Tiny’s job before he does. To tell you the truth, I’d like to see Pancho and Matt gone.”\n\nOutside the window, Pancho held Sally close to him and thought, Oh, no!\n\nLater, Pancho lay awake in the sleeping truck, thinking about the meeting. He didn’t have to work, so he would go to the meeting. As he rested, some men came into the truck. Others left. They all gave him funny looks.\n\nPancho was feeling angry and a little sad. It wasn’t fair. He had worked hard and minded his own business. He didn’t want Tiny’s job and he hadn’t taken anything.\n\nWhat he did want was to finish the season and become an acrobat. He was learning a lot, and there was much more to learn. The Great Zellinis were fine teachers, but he knew it took time.\n\nAlmost anyone else would have left the show months before. He had heard of men blowing the show for less reason than the charges Matt Murphy had made. Now it looked like he would be told to go. All his work had been for nothing.\n\nIt was still an hour before the first show. It would probably be his last show. At the meeting later, he would probably be asked to leave. Or worse, told to leave.\n\n“Pancho Cardoza!” a voice called."
        },
        {
          "pageNumber": 25,
          "text": "Pancho looked up to see Mr. Toby coming toward him. He was smoking a cigar—the sign that something was wrong.\n\nIt doesn’t look like I’m going to see another show, Pancho thought. He got to his feet so he would be standing when Mr. Toby reached him.\n\n“I want to talk to you, Pancho,” Mr. Toby said.\n\nPancho didn’t say anything. He just stood there.\n\n“I just got some bad news,” Mr. Toby said.\n\nStill Pancho said nothing.\n\n“Tiny Tom has gone. Sometime after the Big Top was put up this morning, he left. He just backed his camper off the lot and drove away.”\n\n“I didn’t think he would ever blow the show,” Pancho said in surprise.\n\n“Well, he did. I understand he was given more money by another circus.”\n\nPancho didn’t know what to say. He wasn’t ready for this. He had thought Mr. Toby was going to ask him to leave—not tell him someone else had gone.\n\n“Tell me,” Mr. Toby said, “do you think you can be tent boss?”\n\n“Me?”\n\n“Sure, why not you? You’ve been working with Tiny Tom long enough. If you’re smart, you’ve learned to do his job. You have, haven’t you?”\n\n“Yes, I’ve learned his job,” Pancho said.\n\n“Good. What do you say? Do you want to be tent boss?”\n\n“What about Matt Murphy—he’s been wanting that job,” Pancho asked.\n\n“Forget Murphy. He doesn’t work well with people. He’s a lone wolf.”\n\n“Then what about the candy?” Pancho asked."
        },
        {
          "pageNumber": 26,
          "text": "“Anyone can be a candy butcher. If you’re tent boss, you won’t have to sell candy. I can get someone else.”\n\nPancho thought a minute. “OK,” he said. “I’d like the job. But.…”\n\n“But what?” Mr. Toby broke in.\n\n“But I was told there’s going to be a meeting at the cook tent after the first show. The bear is loose again.”\n\n“What has that got to do with you?” Mr. Toby asked.\n\n“Nothing,” Pancho said.\n\n“Then there’s no problem,” Mr. Toby said."
        }
      ]
    },
    {
      "title": "7 THE MEETING",
      "pages": [
        {
          "pageNumber": 27,
          "text": "CHAPTER 7\nTHE MEETING\n\nPancho walked to the cook tent after the first show. He was feeling better after his talk with Mr. Toby. Pancho knew that if Mr. Toby had been against him, it wouldn’t have mattered what anyone else thought. So the same was true with having Mr. Toby on his side—it didn’t matter what anyone else thought.\n\nThat was a good thing. Because it was clear what most of the circus people were thinking. They left Pancho pretty much alone.\n\nMr. Toby took charge of the meeting. He stood on a chair and said, “The bear is loose again. The thief took another watch—Bill Sullivan’s. Bill left it on a nail in his hot dog stand. When he turned to look at it, it was gone.”\n\nMatt Murphy waved his hand. “I have a question,” he said.\n\n“What is it?” Mr. Toby asked.\n\n“Where was Pancho Cardoza when it happened?” Murphy turned an ugly smile toward Pancho.\n\n“I don’t think that matters,” Mr. Toby said.\n\n“Oh?” Murphy said. “Why not?”\n\n“Because Pancho Cardoza isn’t stupid. And anyone who goes around stealing watches isn’t very smart. I don’t think Pancho is the bear. Besides,” Toby said as he smiled, “Pancho is my new tent boss. I needed a tent boss to take Tiny Tom’s place. And he’s the best man I could get.”\n\nMurphy looked shocked. He didn’t say anything. Then he threw up his hands and walked out of the cook tent."
        },
        {
          "pageNumber": 28,
          "text": "That ended it. Murphy would have liked to keep pointing his finger at Pancho, but now his hands were tied. If Mr. Toby trusted Pancho, Pancho was going to stay.\n\nBut the rest of the circus people were still not willing to be near Pancho or talk to him.\n\nWhen the meeting broke up, Fatima Flame came over to him.\n\n“Hello,” she said.\n\n“Hello, Fatima. Are you still sure I’m not the bear?”\n\nShe looked him in the eye. “Yes, I am.”\n\n“If you’re a real mind reader, how come you don’t know who the bear is?”\n\n“I do know,” she said. “I also know that the bear’s luck is running out.”\n\n“If you know, why don’t you tell Mr. Toby?” said Pancho.\n\n“I’m not sure he’d believe me. Anyway, maybe the bear’s already left the show. Or if he hasn’t, maybe it’s better that he’s caught stealing. Sooner or later he’ll be caught. If not in this state, then in another one.”\n\n“You know,” Pancho said, “I almost believe you can read minds. I’m going to have to see your act before the season is over.”\n\n“If you do, you’ll buy a ticket like everyone else,” Fatima said.\n\n“That’s OK. I’m sure your act is worth paying to see.”\n\nFatima laughed. “In that case, you don’t have to pay. Come to the eight o’clock show tonight.”"
        },
        {
          "pageNumber": 29,
          "text": "It was a month before the thief took anything again. Then he took part of a costume. It belonged to a woman who danced in the Side Show. It was a beautiful silk blouse. Again the bear had broken into a truck through its roof opening. Once again, everyone knew the thief had to be an acrobat.\n\nThere was another meeting at the cook tent. No one had seen anything. No one pointed a finger at Pancho or anyone else. But many pairs of eyes turned to Pancho. They didn’t speak, but he knew what they were thinking.\n\nThe following month was a long one for Pancho. If the end of the season had not been so near, he would have left. As it was, the next thing the bear took almost forced Pancho to blow the show.\n\nBefore each act, The Great Zellinis hung a good luck piece from their trapeze. The piece was a small statue of a gypsy. It was tied to a chain. Both the gypsy and the chain were solid gold. Once in a while the acrobats would forget to take the statue down. When they did, it would hang high above the tent floor all night.\n\nOnly the last time they forgot it, the gypsy wasn’t there when they returned.\n\nSomeone had taken it."
        }
      ]
    },
    {
      "title": "8 A CHANGE FOR PANCHO",
      "pages": [
        {
          "pageNumber": 30,
          "text": "CHAPTER 8\nA CHANGE FOR PANCHO\n\n“Look, Mr. Toby,” Pancho said. “I can’t stand having everyone hate me the way they do. I can count on the fingers of one hand the people who will talk to me. One hand!”\n\nMr. Toby nodded. “I know this season hasn’t been easy for you, Pancho. But I can’t change the way people think, even if they’re wrong.”\n\n“I know that, Mr. Toby. I’m not saying you caused it, or that you can do anything about it. I think I should have left the show long ago. But I kept hoping someone would catch the thief. Instead, things have gotten worse, not better. So I’m going to leave the show.”\n\n“Of course you are,” Mr. Toby said. “The season ends tonight. There’s only one show left. Almost everyone will be going tonight.”\n\n“I don’t mean tonight,” Pancho said. “I mean now.”\n\n“You mean you would blow the show and leave me without a tent boss?”\n\n“Mr. Toby, there isn’t a job in this circus that you couldn’t do. You can be tent boss for one night. That’s true, isn’t it?”\n\n“Yes, that’s true. But I hate to see you leave. All that’s left is the evening show.”\n\nPancho shook his head. “I don’t want to stay for it. I feel bad that I have to leave, Mr. Toby, but I can’t take it any more.”"
        },
        {
          "pageNumber": 31,
          "text": "Mr. Toby held out his hand to Pancho. “Well, if you can’t, you can’t. You lasted a long time, son. I’m not sure I would have stayed as long as you did. It’s no fun having everyone act badly toward you.”\n\nSuddenly, Pancho and Mr. Toby saw that everyone was rushing toward the Big Top.\n\n“The show’s over,” Pancho said. “What can be going on?”\n\nThey joined the crowd just in time to see Joe Wilson come out of the tent. He was holding his arm in a strange way and walking slowly.\n\nWalter Kelly followed Joe out. Then he saw Pancho and Mr. Toby. He came over to them.\n\n“What’s wrong?” Mr. Toby asked.\n\n“It’s Joe,” Walter said. “He went up to see if he could find any clues about the thief who got our good luck piece. He wasn’t careful enough, and he fell.”\n\n“Where was your net?” Mr. Toby asked.\n\n“It was there, sir. But nets keep acrobats from getting killed. They don’t always keep us from getting hurt, though.”\n\n“And Joe got hurt?” Toby said.\n\n“Yes. We think he broke his arm.”\n\nMr. Toby rubbed his hand across his face. “That’s all we needed,” he said. “We have a circus to put on. That means clowns and elephants and acrobats. We must have all three. What kind of a trapeze act can you put on with only one flyer?”"
        },
        {
          "pageNumber": 32,
          "text": "“Well,” Walter began, “I was thinking we could use Pancho for the last show. He has been working out with us every day. He could work with Penny.”\n\n“Pancho has decided to blow the show,” Mr. Toby said.\n\n“What!” Walter put his hand on Pancho’s arm. “Is that right?”\n\n“Yes,” Pancho said.\n\n“That’s crazy. The season ends tonight anyway. Stick around. We need you,” Walter said.\n\n“Well.…”\n\n“Don’t make me beg,” Walter said.\n\n“OK,” Pancho told him. “I’ll stay. I guess I can hold out for a few more hours.”\n\n“That’s the way to talk,” Walter said.\n\nMr. Toby pounded Pancho on the back. “Good man!” he said. “If you’d left before the season was over, you might have been sorry the rest of your life. Sometimes quitting before you finish a thing can get to be a habit.”\n\n“Look,” Walter said to Pancho. “Go over to Joe’s camper and he’ll let you have his costume. Put it on, then come back and meet me in the Big Top. We have time to go through the act a few times before the last show starts.”\n\nPancho rushed over to Joe’s camper. Joe was just going out to find a doctor to look at his arm.\n\n“Take what you need,” Joe said, giving Pancho the key. “Just lock up when you leave. No use making things too easy for the bear.”"
        },
        {
          "pageNumber": 33,
          "text": "Pancho put on Joe’s costume. Then he locked the door and started back toward the Big Top. Suddenly he heard Sally scream. He turned and headed for the row of trucks where her cage was parked.\n\nAs he turned the last corner, he saw Matt Murphy. Murphy was standing inside Sally’s cage. He held a long stick—and he was using it to hit the frightened animal. As he was hitting her, he was closing her toy box with his free hand."
        }
      ]
    },
    {
      "title": "9 THE BEAR’S MISTAKE",
      "pages": [
        {
          "pageNumber": 34,
          "text": "CHAPTER 9\nTHE BEAR’S MISTAKE\n\n“Stop!” Pancho shouted, running toward Murphy.\n\nMurphy looked around in surprise. It was clear he had thought everyone was busy at the Big Top. He hadn’t thought he’d be seen.\n\nNow Murphy threw away the stick. Then he climbed out of the cage and ran.\n\nWhen Pancho got to the cage, he looked inside. Sally seemed to be OK. She was frightened, but she didn’t seem to be hurt.\n\n“It’s OK now,” Pancho called to the chimpanzee. Then he turned and kept after Murphy.\n\nAs he ran, Pancho saw Murphy duck under one of the trucks down the row from Sally’s cage. Pancho followed him under. When he came out he saw Murphy only 50 yards away. Pancho ran harder, trying to close in on the man.\n\nSuddenly, Pancho knew what Murphy was doing. He was heading for the front of the Big Top. Murphy probably thought he would be safe from Pancho if he could get to where the circus people were. The workers would keep Pancho away from him.\n\nThis made Pancho run with even more speed. He didn’t want anyone coming between him and Murphy. Murphy needed a lesson, and Pancho wanted to give it to him.\n\nPancho finally caught up with Matt Murphy in sight of the Big Top. Murphy ran out from between the Side Show tent and the power truck. Pancho was right behind him. Pancho threw himself through the air and landed on Murphy’s back."
        },
        {
          "pageNumber": 35,
          "text": "Murphy and Pancho crashed to the ground. Then the two men rolled in the dirt. Murphy tried to kick Pancho. Then he tried to rub dirt in his eyes. But when the rolling stopped, Pancho was on top, sitting on Murphy. Murphy’s arms were pinned by Pancho’s legs.\n\n“You aren’t as afraid as Sally was,” Pancho said. “But you should be.”\n\nHe was about to teach Murphy a lesson when Mr. Toby and two of the workers ran up. They pulled him away from Murphy.\n\n“What do you think you’re doing?” Toby asked Pancho in an angry voice.\n\n“He has a thing or two coming,” Pancho said. “He was hurting Sally. I caught him in her cage. He was hitting her with a long stick.”\n\n“Is that true?” Mr. Toby asked Murphy.\n\n“No!” Murphy said. “I wouldn’t hit that ape!” But his eyes got small and mean, and his answer was too quick. He had hit Sally.\n\n“Murphy!” Mr. Toby said. “I want you off this lot in ten minutes. If you’re not gone by then I’m going to let Pancho beat you like a drum.”\n\nThen Fatima came up to the men. She had been watching everything. “Wait a minute,” she said. “Before Murphy leaves, I want to show all of you something.”\n\n“It better be important,” said Mr. Toby. “I want this man out.”\n\nFatima looked sure of herself. “It is,” she said. Then she led them to Sally’s cage."
        },
        {
          "pageNumber": 36,
          "text": "A whole crowd of circus people followed. Murphy walked behind. The cage was open as it always was during the day. Sally was hiding far in the back, making low cries.\n\nPancho went to the door of the cage and climbed in. Mr. Toby and Fatima were right behind him. They walked back to where Sally was.\n\n“Everything is OK now,” Pancho told Sally. He held her and rubbed her back the way she liked. Mr. Toby checked her over to see if she had any cuts. She didn’t.\n\n“She’ll be fine,” Mr. Toby said. “Now what do you want to show us?” he asked Fatima.\n\nThe woman opened Sally’s toy box. Mr. Toby looked in. He saw something shine, next to one of the toys. He took the shiny thing out of the box. It was a gold watch.\n\n“Well I’ll be!” he said. Then he hunted through the toys. Soon he found several more things that weren’t toys. He held them up for everyone to see. “Look at this,” Mr. Toby called to the circus people. He held up the silk shirt that had been taken. Then The Great Zellinis’ good luck piece. “It seems that Sally isn’t a chimpanzee after all,” he said. “She’s a bear.”\n\n“No, she’s not,” Fatima broke in. “Sally’s not the real bear.”\n\n“How do you know about all this, Fatima?” asked Mr. Toby."
        },
        {
          "pageNumber": 37,
          "text": "“Some of you think I can read minds,” she said. “And some of you think I can’t. Well, I’m not saying, one way or the other. But one thing’s for sure—I can read faces. Look at Murphy’s face. Why is Sally so afraid of him? Because he made Sally do his dirty work, that’s why. Murphy forced her to go through those roofs to steal for him. And up the trapeze. Murphy himself lifted the watch at the hot dog stand.”\n\n“But why are these things in Sally’s toy box?” asked Pancho. “Why didn’t Murphy keep them?”\n\n“Maybe Murphy was afraid to hide them in his camper,” Fatima said. “He knew that the only one who ever touched Sally’s toys was the chimpanzee herself. I know that Murphy put the stuff in that box.”\n\nEveryone turned to look at Murphy, who stood at the back of the crowd outside the cage. He backed away. Then he broke into a run, shooting quick looks behind him to see if anyone was after him. Murphy went around the side of the first tent he came to and was gone.\n\n“Should I run after him?” Pancho asked Mr. Toby.\n\n“Let him go,” Mr. Toby said. “He’s not worth running after. He’s got no place to go but down.”\n\nMr. Toby turned to Fatima. “From now on, nobody’s going to say that you can’t read minds, Fatima,” he said. “You sure guessed right on this one.”\n\n“Guessed?” Fatima said, smiling."
        },
        {
          "pageNumber": 38,
          "text": "Then she climbed down from the cage. Pancho and Mr. Toby followed. Pancho still held Sally, and he talked to her in a low voice. The circus people crowded around. They didn’t mind being with Pancho now. A few of them told him how sorry they were for acting the way they had.\n\n“You can all save being sorry for later,” Mr. Toby said. “Pancho is taking Joe Wilson’s place with The Great Zellinis. He’s going to be a flyer in the last show of the season.”\n\nMr. Toby reached out and took Sally from Pancho’s arms. “Get over to the Big Top,” he said to Pancho. “The show will be starting soon.”\n\nPancho walked to the tent. Man, he thought to himself, am I glad we found the good luck piece. I think I’m going to need it."
        }
      ]
    },
    {
      "title": "10 LAST SHOW",
      "pages": [
        {
          "pageNumber": 39,
          "text": "CHAPTER 10\nLAST SHOW\n\nThe show began with all the performers walking around the Big Top floor. Everyone was in costume and make-up. Even the elephants had on colored costumes.\n\nPancho walked around the track with The Great Zellinis. In front of Pancho were the clowns. One of the clowns dropped back to where Pancho was walking. “I have something to tell you,” he said.\n\n“What is it?” Pancho asked.\n\n“Fatima said to tell you she’ll be at the back door.”\n\n“You mean after the show?” Pancho asked.\n\n“No. She’ll be there during the act.”\n\nThat made Pancho feel good. Circus people almost never watched each other’s acts. They almost never watched at the back door when the show was going on, either. When they did, it showed they thought they were seeing something special.\n\nPancho, Walter, and Penny waited outside the back door of the Big Top until they heard their music. Then they ran in and climbed up to where the trapezes were swinging.\n\nWalter caught one of the trapezes and tied the good luck piece to it. Then he hung by his legs from the trapeze and swung far out over the ring. Hanging by his legs left his hands free.\n\nThen Pancho swung from the other side. When he was near Walter he let go of his trapeze. Walter caught him. They hung from the one trapeze for a few seconds. Then Pancho grabbed his own trapeze and went back.\n\nPenny followed with another trick."
        },
        {
          "pageNumber": 40,
          "text": "Then it was Pancho’s turn again. This time he did a somersault when he came off his trapeze. Again Walter caught him before he could fall to the net below.\n\nThen Penny came swinging back toward Pancho and Walter. As she flew out from her trapeze, Walter let go of Pancho. Pancho grabbed the trapeze Penny had just left, and Walter took hold of Penny.\n\nThey did a number of tricks that were easy for them. This was to warm up and be sure of their timing. Then they did a few harder tricks. The noise from the crowd made it clear that everyone liked what they saw.\n\nWhile he waited for his next turn, Pancho looked down. He was so surprised he almost fell. The back door was packed with circus people. And they were all looking up. Pancho had never seen so many circus people watching one act. It made him feel good, because he knew they were there to see him. Though almost no one had talked to him for months, now they liked him.\n\nMr. Toby was standing off to one side of the door. He, too, was looking up. Pancho looked close to see if he was smoking his cigar. He wasn’t. That meant that he wasn’t worried about anything. Everything was all right.\n\nPancho looked at Walter. They were ready to begin their last trick. Pancho wanted to leave the trapeze and do three somersaults before Walter caught him."
        },
        {
          "pageNumber": 41,
          "text": "Just as he was ready to swing out, Pancho looked down again. The people by the back door were shouting and waving as much as the people who had paid to see the show.\n\nLooking down had not been the right thing to do. When Pancho left the trapeze, his timing was off. He did the three somersaults, but he didn’t come close to Walter. Walter wasn’t able to catch him.\n\nPancho tumbled end over end toward the net below. He rolled himself into a ball by grabbing his legs and holding them to his chest. When he hit the net, he bounced high into the air. He bounced three times, and finally caught the net to stop another bounce. Then he lowered himself to the ground.\n\nThe band started to play the music for the next act. Pancho ran to the band leader.\n\n“I’m not finished yet,” Pancho told her. “I want to try that again.”\n\nPancho climbed back up and waved to his catcher. Walter waved back, showing he was ready to try again, too.\n\nEveryone was very still. Even the clowns stopped playing and looked up. Pancho flew out and back on the trapeze four times. Then he let go of it again.\n\nHe did the three somersaults, and this time Walter was there to catch him. The crowd went wild. It was a long time before the next act could begin."
        },
        {
          "pageNumber": 42,
          "text": "Later, when everything was over, Pancho left the Big Top with the other acts. Fatima was waiting for him outside the back door.\n\nPancho spoke first. “Now that the season is over,” he said, “can I call you Judy? Or do I have to keep calling you by your circus name?”\n\n“It doesn’t matter,” she said. “You can call me Judy if you want to.”\n\n“I want to,” he said.\n\nThey stood side by side. Now that the last show was over, everyone seemed to be in a hurry. Pancho and Judy were the only ones who stood still. People from the acts and all the workers were rushing about. Mr. Toby was calling workers to him. He was doing the job of tent boss.\n\n“What are you going to do now?” Pancho asked Judy.\n\n“My mother and I will probably sign on with one of the Mexican circuses,” she said. “We do that almost every winter. The Mexican circuses put on shows all winter. What are you going to do, Pancho?”\n\n“A mind reader like you shouldn’t have to be told,” he said."
        }
      ]
    }
  ]
}