{
  "id": "dream-dead",
  "title": "Dream of the Dead",
  "author": "Sarah Blackwell",
  "coverImage": "/images/covers/dream-dead.jpg",
  "lexileLevel": 600,
  "genre": "Mystery",
  "summary": "Thirteen-year-old Zara keeps dreaming about a girl she's never met, standing in front of a house that turns out to be real. When she investigates, she uncovers a fifty-year-old secret that someone desperately wants her to find.",
  "totalPages": 15,
  "chapters": [
    {
      "title": "THE DREAMS BEGIN",
      "pages": [
        {
          "pageNumber": 1,
          "text": "The girl stood in the middle of the road. She had dark braids that hung past her shoulders and a white dress that looked like it belonged in an old photograph. Behind her rose a tall Victorian house with a sagging porch and broken windows. The sky was the color of a bruise.\n\nZara tried to speak, but no sound came out. She tried to move, but her feet were stuck to the ground. The girl stared at her with wide, dark eyes. Then she raised one hand and pointed at the house.\n\nHer mouth moved. She was saying something, but Zara couldn't hear it. The wind picked up. Dead leaves scraped across the road like tiny claws. The girl pointed harder, her whole arm shaking.\n\nThen Zara woke up.\n\nShe sat straight up in bed, her heart slamming against her ribs. Sweat stuck her T-shirt to her back. The room was dark except for the glow of her alarm clock: 3:17 a.m.\n\nJust a dream, she told herself. Just a stupid dream.\n\nBut she could still feel the cold from it, deep in her bones, like she'd been standing outside in winter."
        },
        {
          "pageNumber": 2,
          "text": "At school the next morning, Zara couldn't shake the feeling. She sat in her usual spot at the back of Ms. Hernandez's English class, but she wasn't listening to the lesson about metaphors. She was thinking about the girl with the braids.\n\nThe dream had felt so real. Not like a normal dream where things shift and don't make sense. Everything had been sharp and clear, like watching a movie. She could still picture every detail of that house: the peeling paint, the crooked shutters, the way the porch steps sagged in the middle.\n\n\"Earth to Zara.\" Devon slid into the seat next to her. He was her best friend since third grade, the kind of person who noticed everything. \"You look terrible.\"\n\n\"Thanks,\" she said.\n\n\"No, I mean it. Did you sleep at all?\"\n\nZara chewed her lip. She wanted to tell someone, but it sounded so weird. She dreamed about a girl pointing at a house. Big deal. People had weird dreams all the time.\n\nBut this was different. She knew it was different.\n\n\"I had this dream,\" she started. \"And I can't stop thinking about it.\""
        },
        {
          "pageNumber": 3,
          "text": "She told Devon everything at lunch. They sat at their usual table in the corner of the cafeteria, away from the noise. Devon listened without interrupting, which was rare for him.\n\nWhen she finished, he leaned back in his chair. \"So this girl was just... standing there? Pointing?\"\n\n\"Yeah. At the house. Like she wanted me to go inside.\"\n\n\"And you've never seen her before?\"\n\nZara shook her head. \"Never. But she felt familiar, somehow. Like I was supposed to know her.\"\n\nDevon picked at his sandwich. \"It's probably just stress. Remember when I had those dreams about being chased by a giant math test? That was during finals.\"\n\n\"This isn't like that,\" Zara said. \"This felt real. Like she was actually there, trying to tell me something.\"\n\nDevon studied her face. Whatever he saw there made him stop joking. \"Okay,\" he said quietly. \"So what do you want to do about it?\"\n\n\"Nothing. It was just a dream.\"\n\nBut even as she said it, she didn't believe it. And from the look on Devon's face, he didn't believe it either.\n\nThat night, Zara was afraid to fall asleep."
        },
        {
          "pageNumber": 4,
          "text": "She tried everything. She watched videos on her phone until her eyes burned. She read a book. She counted backward from a thousand. But eventually, sleep pulled her under like a current she couldn't fight.\n\nThe girl was waiting.\n\nThis time, Zara was closer. Close enough to see the freckles on the girl's nose and the dirt on the hem of her white dress. Close enough to see that her eyes weren't just dark, they were desperate. The girl wasn't just pointing at the house. She was begging.\n\nPlease, her mouth said. Please.\n\nThe house loomed behind her, bigger than before. The windows were dark, but something moved behind the glass on the second floor. A curtain shifted. A shadow passed.\n\nThe girl grabbed Zara's wrist. Her fingers were ice cold, cold enough to burn. Zara gasped and looked down at the girl's hand on her arm.\n\nThat's when she saw it. On the girl's wrist, a thin bracelet with a charm shaped like a crescent moon.\n\nThe girl pulled her toward the house. The front door creaked open by itself, revealing nothing but darkness inside.\n\nZara screamed and woke up.\n\nThis time, she didn't go back to sleep.",
          "image": "/images/illustrations/dream-dead-1.jpg"
        },
        {
          "pageNumber": 5,
          "text": "\"She touched me,\" Zara whispered to Devon the next morning. They were walking to school through the October chill, their breath making small clouds. \"In the dream. She grabbed my wrist. And when I woke up...\"\n\nShe pushed up her sleeve. Devon stopped walking.\n\nThere, on the inside of her wrist, were four faint red marks. Exactly where the girl's fingers had been.\n\n\"That's not possible,\" Devon said. But his voice was thin.\n\n\"I know.\"\n\nThey stood there on the sidewalk, staring at the marks. A car drove past. Somewhere, a dog barked. Normal morning sounds in a normal town. But nothing felt normal anymore.\n\n\"Okay,\" Devon said. He took a deep breath. \"Okay. So either you scratched yourself in your sleep, or...\"\n\n\"Or something is happening to me.\"\n\nHe nodded slowly. \"We need to figure this out. Can you draw the house? If it's a real place, maybe we can find it.\"\n\nZara thought about the sagging porch, the broken windows, the tall pointed roof.\n\n\"I don't need to draw it,\" she said. \"I see it every time I close my eyes.\"\n\nShe didn't know it yet, but she was about to see it with her eyes wide open."
        }
      ]
    },
    {
      "title": "THE HOUSE ON MAPLE STREET",
      "pages": [
        {
          "pageNumber": 6,
          "text": "It happened on the way to school the next day. Zara and Devon took their usual route down Oak Avenue, turned left on Pine, and then cut through the neighborhood on Maple Street to save time.\n\nZara had walked this way a hundred times. Maybe a thousand. She knew every house, every fence, every cracked square of sidewalk.\n\nBut today, she saw it.\n\nThe house from her dreams.\n\nShe stopped so suddenly that Devon walked three steps past her before he realized she wasn't beside him anymore. He turned around. \"What?\"\n\nZara couldn't speak. She could only point, just like the girl in her dreams.\n\nThe Victorian house sat back from the road behind a rusted iron fence. The yard was a jungle of dead weeds and overgrown bushes. Paint peeled from every surface. The porch sagged in the middle, exactly like in her dream. Two upstairs windows stared down at them like empty eye sockets.\n\n\"That's it,\" Zara whispered. \"That's the house.\"\n\nDevon looked at her. Then he looked at the house. Then back at her.\n\n\"You've walked past this house before,\" he said carefully. \"Maybe you just noticed it and your brain put it in a dream.\"\n\n\"Maybe,\" Zara said. But she knew that wasn't true."
        },
        {
          "pageNumber": 7,
          "text": "They came back after school.\n\nZara had spent the whole day thinking about it. Every class, every hallway, every minute. By the time the final bell rang, she had made up her mind. She was going inside.\n\nDevon was not excited about this plan.\n\n\"It's trespassing,\" he said as they stood on the sidewalk, staring at the house through the iron fence.\n\n\"The gate's open.\"\n\n\"It could be dangerous. The floors could collapse.\"\n\n\"Then we'll be careful.\"\n\n\"Your mom would kill you.\"\n\n\"My mom doesn't have to know.\"\n\nDevon sighed. He always sighed like that before he gave in. \"If I die in there, I'm haunting you forever.\"\n\nThey pushed through the gate. The hinges screamed, a long, rusty shriek that made them both flinch. The front path was cracked, with weeds pushing through like fingers reaching up from underground.\n\nThe porch steps groaned under their weight. Zara reached for the front door. The knob was so cold it hurt her hand, even though the afternoon was warm. She turned it.\n\nThe door swung open with a long, low creak that seemed to go on forever.\n\nInside, the house was dark, and it smelled like something that had been closed up for a very long time."
        },
        {
          "pageNumber": 8,
          "text": "Dust hung in the air like fog. Zara turned on her phone flashlight and swept it across the room.\n\nA living room. Old furniture covered in white sheets, like ghosts sitting in chairs. A fireplace filled with ashes. Wallpaper peeling off the walls in long, curling strips. Everything was gray with dust.\n\n\"Nobody's been here in years,\" Devon said. His voice was barely above a whisper, even though they were alone.\n\nThey moved through the first floor. A dining room with a long table. A kitchen where the cabinets hung open and mice had chewed through the drawers. Everything was frozen in time, like someone had just walked out and never come back.\n\nThen Zara found the stairs.\n\nShe didn't want to go up. Something in her stomach told her not to. But something else, something stronger, pulled her forward. The same feeling from the dream. The same pull.\n\n\"Second floor,\" she said. \"That's where I need to go.\"\n\n\"How do you know that?\"\n\n\"I just do.\"\n\nThe stairs creaked with every step. Halfway up, Devon grabbed her arm. \"Do you hear that?\" he whispered.\n\nZara listened. From somewhere above them came a soft sound. Like someone humming."
        },
        {
          "pageNumber": 9,
          "text": "They stood frozen on the stairs, barely breathing. The humming faded, then stopped. Maybe it was just the wind pushing through cracks in the walls. Maybe.\n\nZara kept climbing.\n\nThe second floor hallway had three doors. Two were open, showing empty bedrooms. The third was closed. Something about it made Zara's skin prickle. The door was painted pale blue, and someone had stuck flower stickers on it, the kind a kid would put up. They were faded and peeling now, but Zara could still make out daisies and sunflowers.\n\nA child's room.\n\nShe turned the knob and pushed. The door stuck, then gave way with a pop.\n\nInside was a small bedroom. A twin bed with a faded pink bedspread. A wooden dresser. A shelf with old books, their spines cracked and yellow. A window with lace curtains that had turned brown with age. On the wall, someone had taped up drawings, pictures of horses and trees and a family holding hands.\n\nZara stepped inside and felt something shift under her foot. She looked down. One of the floorboards was loose, sitting slightly higher than the others.\n\n\"Devon,\" she said. \"Come look at this.\""
        },
        {
          "pageNumber": 10,
          "text": "They knelt on the dusty floor. Zara worked her fingers under the edge of the loose board and pulled. It came up with a groan, revealing a dark space underneath.\n\nDevon aimed his phone light into the gap.\n\nThere, in the darkness beneath the floor, was a tin box. It was about the size of a lunch box, rusted at the edges, with a faded picture of flowers on the lid.\n\nZara reached in and lifted it out. It was lighter than she expected. Something shifted inside when she tilted it.\n\nHer hands were shaking. She didn't know why, but she felt like she was about to cry. Like this was the moment everything had been building toward, all the dreams, all the fear, all the cold fingers on her wrist.\n\nShe opened the lid.\n\nInside were letters. A small stack of them, written on lined paper in neat, careful handwriting. And underneath the letters, a photograph.\n\nZara picked up the photograph and held it in the light. A girl stared back at her. Dark braids. Freckles on her nose. A thin bracelet on her wrist with a charm shaped like a crescent moon.\n\nIt was her. The girl from the dreams.\n\n\"Oh my god,\" Devon breathed."
        }
      ]
    },
    {
      "title": "ANSWERS",
      "pages": [
        {
          "pageNumber": 11,
          "text": "They took the box to Zara's house. Her mom was still at work, so they spread everything out on the kitchen table and started reading.\n\nThe letters were dated. The earliest one was from March 1975. The latest was from October of that same year. They were all written by the same person.\n\nDear Diary, the first one began. Mama says we're moving to California. I don't want to go. This is my home. My friends are here. My whole life is here.\n\nThe handwriting was small and neat. Each letter was signed the same way: Elena.\n\nZara read them in order, one by one. Elena wrote about school. About her best friend, Maria. About her cat named Pepper. About how her parents fought at night when they thought she was sleeping. About how scared she was of starting over in a new place where she didn't know anyone.\n\nThe letters got sadder as the months went on. Elena wrote about packing boxes. About saying goodbye to Maria. About hiding in her room and crying.\n\nThen the letters changed. Elena had a plan.\n\nI'm not going with them, she wrote in August. I'm going to hide. They can't make me leave if they can't find me.\n\nZara's stomach turned cold.",
          "image": "/images/illustrations/dream-dead-2.jpg"
        },
        {
          "pageNumber": 12,
          "text": "The September letters were frantic. Elena described her hiding plan in detail. She would sneak out the night before the move and stay at an abandoned barn outside of town. She'd packed a bag with food and clothes and her favorite book. She'd wait until her family left, then go to Maria's house.\n\nIt'll work, she wrote. It has to work. I'd rather be alone here than somewhere new.\n\nZara's hands trembled as she picked up the last letter. It was dated October 3, 1975.\n\nDear Diary, it began. Tonight is the night. Mama and Daddy finished loading the truck. We leave tomorrow morning at six. But I won't be there.\n\nI hid this box under the floor so no one would find my letters. Maybe someday, someone will. Maybe someday, someone will read this and know that a girl named Elena lived here and loved this house and didn't want to leave.\n\nThe letter stopped in the middle of a sentence. The last line read: I hear someone com\n\nThat was it. The pen had dragged across the paper, leaving a long line that trailed off the edge.\n\nZara set the letter down. Her eyes were wet.\n\n\"Something happened to her,\" she said. \"Something happened that night.\""
        },
        {
          "pageNumber": 13,
          "text": "The next day was Saturday. Zara and Devon went to the public library.\n\nThe librarian, Mrs. Chen, helped them find the local newspaper archives on microfilm. It took two hours of scrolling through tiny, blurry text, but they finally found what they were looking for.\n\nThe article was from the Maplewood Gazette, dated October 8, 1975. The headline read: FAMILY RELOCATES; DAUGHTER STAYS WITH RELATIVES.\n\nThe article was short. The Reyes family had moved to California. Their daughter, Elena, age 12, had gone to live with relatives in another state because she didn't want to leave her school.\n\nThat was it. Three sentences. No follow-up story. No questions asked.\n\nBut Zara had read Elena's letters. Elena hadn't gone to live with relatives. She had planned to run away and hide.\n\n\"This doesn't make sense,\" Devon said, squinting at the screen. \"If she ran away, wouldn't there be a missing person report? A search?\"\n\n\"Not if everyone thought she was somewhere else,\" Zara said slowly. \"Her parents told people she was with relatives. The relatives probably thought she was with her parents. Nobody checked.\"\n\nThe weight of it settled on her like a heavy coat. Elena had fallen through the cracks."
        },
        {
          "pageNumber": 14,
          "text": "That night, Zara sat on her bed with the photograph in her hands. Elena stared up at her with those dark, serious eyes. The crescent moon bracelet caught the light.\n\n\"I found your letters,\" Zara whispered to the picture. \"I know you were here.\"\n\nShe thought about Elena hiding under the floorboards of her own room, writing letters to a diary that nobody would ever read. She thought about a twelve-year-old girl who loved her home so much she couldn't bear to leave it. She thought about how nobody had come looking.\n\nFor fifty years, Elena's story had been hidden under a loose board in an empty house. Fifty years of silence.\n\nBut then the dreams started. The girl with the braids, standing in the road. Pointing at the house. Begging Zara to come inside. To find the box. To read the letters.\n\nTo know.\n\nZara understood now. Elena didn't want to be forgotten. That was all. She didn't want to be a three-sentence article in an old newspaper. She wanted someone to know she existed. That she mattered.\n\nZara wiped her eyes and picked up her phone. She had work to do."
        },
        {
          "pageNumber": 15,
          "text": "On Monday morning, Zara walked into the police station on Main Street with Devon beside her and the tin box in her hands.\n\nThe officer at the front desk gave them a funny look, two eighth graders with a rusty box, but he listened. Zara told him everything. About the house on Maple Street. About the letters. About Elena Reyes, who was twelve years old in 1975 and was never reported missing.\n\nShe left out the dreams. Some things were too hard to explain.\n\nThe officer took notes. He said he'd look into it. He said they did the right thing by coming in.\n\nWalking home, Devon was quiet for a long time. Then he said, \"Do you think they'll find out what happened to her?\"\n\n\"I don't know,\" Zara said honestly. \"But at least now someone is asking the question.\"\n\nThat night, Zara went to bed and closed her eyes. She braced herself for the dream, for the cold and the pointing and the desperate eyes.\n\nBut the dream didn't come.\n\nInstead, she dreamed of a field full of sunflowers under a wide blue sky. And somewhere, far away, she heard a girl laughing.\n\nFor the first time in weeks, Zara slept through the night."
        }
      ]
    }
  ]
}
