{
  "id": "prince-pauper",
  "title": "The Prince and the Pauper",
  "author": "Mark Twain (adapted)",
  "coverImage": "/images/covers/prince-pauper.jpg",
  "lexileLevel": 650,
  "genre": "Classic",
  "summary": "Two boys who look exactly alike — one a prince, one a pauper — accidentally swap lives and discover that the world looks very different depending on which side of the palace gates you stand on.",
  "totalPages": 12,
  "chapters": [
    {
      "title": "Two Boys",
      "pages": [
        {
          "pageNumber": 1,
          "text": "A long time ago, in the great city of London, two baby boys were born on the very same day.\n\nThe first boy was named Edward. He was born in a grand palace with golden walls and silk curtains. Trumpets blew and bells rang across the city to celebrate his arrival. He was a prince — the son of King Henry the Eighth — and all of England rejoiced.\n\nThe second boy was named Tom Canty. He was born in a tiny, falling-apart house on Offal Court, one of the dirtiest streets in London. No trumpets blew for Tom. No bells rang. His father, John Canty, was a thief and a bully who cared nothing for his new son.\n\nAs the years passed, the two boys grew up in worlds that could not have been more different. Edward wore fine clothes and ate roasted meats and sweet cakes. Tom wore rags and was lucky to get a crust of bread. Edward had tutors who taught him Latin and French. Tom learned to beg for coins on the street."
        },
        {
          "pageNumber": 2,
          "text": "But here is the strange thing: even though their lives were nothing alike, the two boys looked exactly alike. They had the same golden hair, the same bright blue eyes, and the same small, sharp nose. If you put them side by side, you could not tell one from the other.\n\nTom Canty was a dreamer. At night, while his father snored and rats scratched in the walls, Tom would close his eyes and imagine he was a prince. He pictured himself walking through marble hallways, eating whatever he wanted, and never being cold or hungry again.\n\n\"If only I could see a real prince,\" Tom whispered to himself one morning. \"Just once. Just to know what it's like.\"\n\nThat very day, Tom made a decision. He would walk to the palace. He had nothing to lose. His father would beat him whether he stayed home or wandered off, so he might as well go somewhere interesting.\n\nTom walked for over an hour through twisting streets until, at last, he saw the palace gates shining in the sunlight. They were enormous — tall iron bars topped with gold.",
          "image": "/images/illustrations/prince-pauper-1.jpg"
        },
        {
          "pageNumber": 3,
          "text": "Tom pressed his face between the bars and stared. Inside, he could see gardens with perfect green hedges and fountains shooting water into the air. And there, walking along a stone path, was a boy about his own age dressed in silk and velvet.\n\n\"A prince,\" Tom breathed. \"A real prince.\"\n\nA palace guard spotted Tom and shoved him hard. \"Get away from here, you filthy rat!\" the guard snarled.\n\nTom stumbled backward and fell in the mud. But Prince Edward had seen the whole thing. He ran to the gate.\n\n\"How dare you treat someone like that!\" Edward shouted at the guard. \"Open the gate at once and let him in!\"\n\nThe guard obeyed immediately. Tom could not believe what was happening. He was actually walking through the palace gates.\n\nEdward led Tom inside to his private room. It was bigger than Tom's entire house. \"Are you hungry?\" Edward asked.\n\nTom nodded, unable to speak. Edward clapped his hands, and servants brought plates of food — roast chicken, fresh bread, cheese, and fruit. Tom had never seen so much food in his life."
        },
        {
          "pageNumber": 4,
          "text": "While Tom ate, the two boys talked. Edward wanted to hear all about Tom's life on the streets. To the prince, it sounded like an exciting adventure.\n\n\"You get to run wherever you want?\" Edward said, his eyes wide. \"You can play in the mud and swim in the river? I wish I could do that. I have to sit through lessons all day and bow to people I don't even like.\"\n\nTom laughed. \"And I wish I could eat like this every day and sleep in a real bed.\"\n\nThen Edward noticed something. \"Tom — we look exactly alike! Stand here, next to the mirror.\"\n\nThey stood side by side and stared at their reflections. It was like looking at twins.\n\n\"Let's trade clothes!\" Edward said with a grin. \"Just for fun. I want to know what it feels like to wear your clothes, and you can try mine.\"\n\nThey swapped outfits, laughing the whole time. But when Edward — now dressed in Tom's rags — stepped into the hallway, a guard grabbed him roughly.\n\n\"How did you get back in here, beggar boy?\" the guard growled. And before Edward could say a word, the guard threw him out through the palace gates."
        }
      ]
    },
    {
      "title": "Trading Places",
      "pages": [
        {
          "pageNumber": 5,
          "text": "Edward landed on the cobblestones outside the palace. He jumped to his feet and banged on the gate.\n\n\"Let me in!\" he shouted. \"I am the Prince of Wales! I command you to open this gate!\"\n\nThe guard laughed. A crowd gathered, and they laughed too. Here was a skinny boy in rags, covered in mud, claiming to be the prince. What a joke!\n\n\"Sure you are, Your Majesty,\" a man called out. \"And I'm the King of France!\" Everyone roared with laughter.\n\nEdward's face turned red with anger. He had never been treated like this in his entire life. People had always bowed to him, called him \"Your Highness,\" and rushed to do whatever he asked. Now they were mocking him.\n\nA group of boys threw rotten vegetables at him. Dogs chased him through an alley. Edward ran, confused and frightened. The streets of London were nothing like his beautiful palace. They were dark, crowded, and they smelled terrible.\n\n\"When I get back to the palace,\" Edward muttered through clenched teeth, \"someone is going to pay for this.\""
        },
        {
          "pageNumber": 6,
          "text": "Meanwhile, inside the palace, Tom Canty was terrified.\n\nServants kept bowing to him. Ladies called him \"my prince.\" A man in a long robe explained that he had a meeting with the Spanish ambassador in one hour.\n\n\"I'm not the prince!\" Tom said desperately. \"I'm Tom Canty from Offal Court. Please, there's been a mistake!\"\n\nBut nobody believed him. They whispered to each other that the prince must be ill. Perhaps he had a fever that was making him confused.\n\nAt dinner, Tom sat at a huge table covered with more dishes than he could count. He didn't know which fork to use — he had never used a fork at all. He picked up a piece of chicken with his fingers, and the entire room went silent. A servant gently placed a fork in Tom's hand.\n\n\"The prince is definitely not well,\" someone whispered.\n\nKing Henry himself came to see Tom. The king was enormous — a giant man with a red beard and small, sharp eyes. Tom was so scared he could barely breathe.\n\n\"My son,\" the king said gently. \"You do not seem yourself. Do you know who I am?\"",
          "image": "/images/illustrations/prince-pauper-2.jpg"
        },
        {
          "pageNumber": 7,
          "text": "Tom swallowed hard. \"You are the king, sir.\"\n\n\"And who are you?\"\n\nTom almost said \"Tom Canty\" again, but the look in the king's eyes stopped him. There was worry there, but also something harder — something that said the wrong answer would lead to trouble.\n\n\"I am... your son,\" Tom said quietly.\n\nThe king smiled and patted Tom's head. \"Good. You gave us a fright. Rest now. You will feel better in the morning.\"\n\nAfter the king left, Tom sat alone in Edward's enormous bedroom. The bed was the size of a small boat, piled high with feather pillows. Despite everything, Tom had to admit — the bed was amazing.\n\n\"Maybe this won't be so bad,\" he whispered. \"Just for a little while.\"\n\nOut in the dark streets of London, Edward was having the worst night of his life. He had wandered into Offal Court by accident, and John Canty — Tom's father — had found him.\n\n\"There you are, boy!\" Canty grabbed Edward by the arm. \"Where have you been? Get inside before I break your arm.\""
        },
        {
          "pageNumber": 8,
          "text": "\"Unhand me!\" Edward shouted. \"I am Prince Edward, and I order you to release me!\"\n\nJohn Canty stared at him, then burst out laughing. \"Prince Edward, is it? You've finally lost your mind.\" He dragged Edward inside the cramped, filthy house and threw him onto a pile of straw.\n\nEdward had never been hit in his life. That night, when he refused to go out and beg, John Canty raised his hand. Edward learned very quickly that being a prince meant nothing without a palace around you.\n\nThe next morning, Edward escaped. He ran through the streets, still insisting to anyone who would listen that he was the true prince. Most people ignored him. Some threw things at him.\n\nBut then he met Miles Hendon.\n\nMiles was a tall, strong soldier with a kind face and a long sword at his side. He had just returned from years of fighting in foreign wars. When he found Edward surrounded by a group of bullies, he scattered them with one fierce look.\n\n\"Now then,\" Miles said, kneeling down. \"Who are you, lad?\"\n\n\"I am Edward, Prince of Wales,\" Edward said firmly.\n\nMiles raised an eyebrow. He didn't quite believe it — but he didn't laugh, either. And that was enough for Edward."
        }
      ]
    },
    {
      "title": "The Truth Comes Out",
      "pages": [
        {
          "pageNumber": 9,
          "text": "Days passed. Miles took care of Edward, buying him food and protecting him from danger. Edward was grateful, but he never stopped trying to get back to the palace.\n\nDuring his time on the streets, Edward saw things he had never imagined. He saw children who were hungry and sick, with no one to help them. He saw people thrown in jail for stealing a loaf of bread. He saw beggars with no shoes, even in winter.\n\n\"How can this be?\" Edward said to Miles one evening. \"These are my people. I had no idea they suffered like this.\"\n\n\"Most kings don't,\" Miles said quietly.\n\nEdward clenched his fists. \"When I am king, things will be different. I promise you that.\"\n\nMeanwhile, at the palace, Tom Canty was getting better at pretending to be the prince. He learned which fork to use. He learned how to wave at crowds. He even started to enjoy the soft beds and endless food.\n\nBut then terrible news came. King Henry had died.\n\nThat meant the prince — which everyone believed was Tom — would be crowned the new King of England. Tom felt sick. Playing prince was one thing. Becoming king was something else entirely."
        },
        {
          "pageNumber": 10,
          "text": "The coronation was held at Westminster Abbey, the grandest church in all of England. Thousands of people crowded inside. Lords and ladies wore their finest clothes. Trumpets blasted. Choirs sang.\n\nTom walked down the long aisle in a golden robe that was so heavy he could barely stand up straight. The crown — glittering with rubies and diamonds — sat on a velvet pillow, waiting for him.\n\nThe Archbishop lifted the crown. Tom held his breath. This was it. In a moment, he would be king, and the real Edward might never get his life back.\n\n\"STOP!\"\n\nThe shout echoed through the abbey. Every head turned. There, at the back of the church, stood a boy in dirty, torn clothes. He was thin and bruised, but he held his chin high.\n\n\"That is not the king!\" Edward shouted, marching down the aisle. \"I am Edward, the true Prince of Wales, and that boy is wearing my crown!\"\n\nThe crowd gasped. Guards moved to grab him, but then they stopped. They looked at Edward. They looked at Tom. The two boys were identical.",
          "image": "/images/illustrations/prince-pauper-3.jpg"
        },
        {
          "pageNumber": 11,
          "text": "The lords argued among themselves. How could they tell which boy was the real prince? They asked question after question. Both boys knew the palace. Both boys knew the names of the servants. Tom had learned all of this during his weeks pretending to be Edward.\n\n\"This is a trick!\" one lord shouted, pointing at Edward. \"Throw this beggar out!\"\n\nBut then a wise old lord stepped forward. \"If this boy is truly the prince,\" he said, \"then he will know one thing that no one else could know. Where is the Great Seal of England? It has been missing for weeks. Only the real prince would know where he put it.\"\n\nEdward closed his eyes and thought. Where had he put it? He had been holding it the day Tom visited. He remembered setting it down when they traded clothes.\n\n\"It is in a small cabinet in my bedroom,\" Edward said, \"inside the suit of armor near the window.\"\n\nA servant ran to check. Minutes later, he returned, holding up the Great Seal. The crowd erupted in cheers.\n\nTom stepped forward with a huge smile of relief. \"He's telling the truth. He is the real prince, and I am glad to give this back.\""
        },
        {
          "pageNumber": 12,
          "text": "There was one funny detail that came out later. While Tom had been living in the palace, he had found the Great Seal but had no idea what it was. It was heavy and flat, and Tom thought it was perfect for one thing: cracking walnuts. The royal seal of England had been used as a nutcracker for weeks.\n\nWhen Edward heard this, he laughed harder than he had ever laughed in his life.\n\nEdward was crowned king that very day. True to his word, he never forgot what he had seen on the streets of London. He made new laws to help the poor. He ordered that no child should go hungry. He shut down the worst jails and pardoned people who had been locked up for small crimes.\n\nThe people called him \"the boy king with the kind heart.\"\n\nAs for Tom Canty, Edward gave him a fine house, new clothes, and enough food to last a lifetime. Tom never had to beg again. He spent the rest of his days reading books and telling the story of the time he accidentally became the King of England.\n\nAnd Miles Hendon? Edward made him a lord, because Miles had believed in him when nobody else did. That, Edward said, was worth more than gold."
        }
      ]
    }
  ]
}
